DSCore.DateTime.Components(System.DateTime)
Estrae i singoli componenti di un valore di DateTime.
dateTime: DateTime da cui ottenere componenti
Rappresentazione numerica dell'anno (1-9999)
Rappresentazione numerica del mese (1-12)
Rappresentazione numerica del giorno (1-[giorni del mese])
Rappresentazione numerica dell'ora (0-23)
Rappresentazione numerica dei minuti (0-59)
Rappresentazione numerica dei secondi (0-59)
Rappresentazione numerica dei secondi (0-999)