DSCore.List.IndexOf(System.Collections.IList,System.Object)
Restituisce l'indice dell'elemento nell'elenco specificato. La corrispondenza tra l'elenco specificato e l'elemento di destinazione deve essere esatta (ossia int con int, double con double, string con string, object con object, ecc.)
list: L'elenco in cui individuare l'elemento.
element: L'elemento il cui indice deve essere restituito.
L'indice dell'elemento dell'elenco. Verrà restituito l'indice non valido -1 se non viene trovata una corrispondenza esatta.
index,indexof