DSCore.DummyPythonEvaluator
Valutatore Python che genera solo un errore durante la valutazione.
Utilizzato principalmente per indicare che non è stato possibile trovare un vero valutatore Python.

DSCore.DummyPythonEvaluator.Evaluate(System.String,System.Collections.IList,System.Collections.IList)
Genera un'eccezione con il messaggio assegnato.