Autodesk.DesignScript.Geometry.Vector.ToString
Ottiene una rappresentazione stringa del vettore

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Confronta due vettori
other: L'altro vettore
Returns: Indica se i due oggetti sono uguali

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
Ottiene un hashcode per il tipo
Returns: Hashcode univoco per l'oggetto corrente

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Definisce un vettore a partire da tre coordinate euclidee
x: Coordinata X
y: Coordinata Y
z: Coordinata Z
Returns: Vettore creato da coordinate
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Definisce un vettore a partire da tre coordinate euclidee e normalizza il vettore
x: Coordinata X
y: Coordinata Y
z: Coordinata Z
normalized: True per normalizzare il vettore, false per non normalizzarlo
Returns: Vettore creato da coordinate
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Definisce un vettore a partire da due estremità. Il risultato è un vettore che va dal punto iniziale al punto finale.
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
Ottiene il vettore asse X canonico (1,0,0)
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
Ottiene il vettore asse Y canonico (0,1,0)
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
Ottiene il vettore asse Z canonico (0,0,1)
z,basis,up

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Definisce il prodotto scalare tra due vettori
vec: un secondo vettore
Returns: Prodotto scalare risultante
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Determina se due vettori sono paralleli.
otherVector: Altro vettore
Returns: Restituisce true se i vettori sono paralleli; false in caso contrario.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Determina se due vettori sono quasi uguali. Un valore di tolleranza di 1e-5 specificato per gestire problemi di precisione.
otherVector: Altro vettore
Returns: Restituisce true se i vettori sono quasi uguali; false in caso contrario.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Trasforma il vettore corrente mediante una matrice CoordinateSystem di input.
coordinateSystem: Sistema di coordinate utilizzato per trasformare il vettore
Returns: Vettore trasformato

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Ruota un vettore attorno ad un asse per un numero specifico di gradi
axis: Vettore asse di rotazione
degrees: Numero di gradi da ruotare
Returns: Vettore ruotato
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Ruota un vettore intorno all'origine del piano e alla normale, per un numero specifico di gradi
plane: Piano di rotazione
degrees: Numero di gradi da ruotare
Returns: Vettore ruotato
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Adatta in scala il vettore intorno all'origine in modo uniforme
scale_factor: Fattore di scala
Returns: Vettore in scala
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
Restituisce l'angolo tra i due vettori nell'intervallo [0, 180] gradi.
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Restituisce l'angolo tra i due vettori in gradi da 0 a 360. Utilizza l'asse di rotazione per determinare la direzione dell'angolo.
otherVector: Altro vettore
rotationAxis: Asse di rotazione
Returns: Restituisce l'angolo tra i vettori forniti in gradi compresi tra 0 e 360
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Restituisce l'angolo tra i due vettori nell'intervallo [0, 360] gradi. Utilizza l'asse di rotazione per determinare la direzione dell'angolo.
rotation angle