Autodesk.DesignScript.Geometry.Mesh.ToString
Ottiene una rappresentazione stringa della mesh

Autodesk.DesignScript.Geometry.Mesh.ByPointsFaceIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
Crea una mesh da una raccolta di punti e una raccolta di IndexGroup che fanno riferimento alla raccolta di punti
vertexPositions: Elenco di punti che determinano le posizioni dei vertici
indices: Indici per vertici
Returns: Mesh creata da punti
mesh,meshes