Autodesk.DesignScript.Geometry.NurbsCurve.ToString
Ottiene una rappresentazione stringa di NurbsCurve

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea una curva BSpline mediante punti di controllo espliciti. NOTA 1: le curve BSpline con deg=1 hanno discontinuità G1 che danno origine a problemi per l'estrusione, l'estrusione su percorso ed altre operazioni. È consigliabile evitarle ed utilizzare curve PolyCurve. NOTA 2: se la curva è periodica (chiusa), il primo e l'ultimo punto DEVONO coincidere.
points: Punti per curva NURBS
Returns: NurbsCurve creata da punti
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Crea una curva BSpline mediante punti di controllo espliciti. NOTA 1: le curve BSpline con deg=1 hanno discontinuità G1 che danno origine a problemi per l'estrusione, l'estrusione su percorso ed altre operazioni. È consigliabile evitarle ed utilizzare curve PolyCurve. NOTA 2: se la curva è periodica (chiusa), il primo e l'ultimo punto DEVONO coincidere.
points: Punti per curva NURBS
degree: Grado della curva
Returns: NurbsCurve creata da punti
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Crea una curva BSpline mediante punti di controllo espliciti. NOTA 1: le curve BSpline con deg=1 hanno discontinuità G1 che danno origine a problemi per l'estrusione, l'estrusione su percorso ed altre operazioni. È consigliabile evitarle ed utilizzare curve PolyCurve. NOTA 2: se la curva è periodica (chiusa), il primo e l'ultimo punto DEVONO coincidere.
points: Punti per curva NURBS
degree: Grado della curva
closeCurve: Attiva/Disattiva per chiudere la curva
Returns: NurbsCurve creata da punti
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
Crea una curva BSpline da vertici di controllo, pesi e nodi. DAI DOCUMENTI ASM: Grado: deve essere maggiore di 1 (spline lineare a tratti) e inferiore a 26 (grado base di B-spline massimo supportato da ASM). Pesi: tutti i valori di peso (se forniti) devono essere rigorosamente positivi. I pesi inferiori a 1e-11 verranno respinti e la funzione restituisce un errore. Nodi: il vettore nodo deve essere una sequenza non decrescente. La molteplicità interna dei nodi non può essere superiore a grado + 1 nel nodo iniziale/finale ed a grado in un nodo interno (ciò consente la rappresentazione di curve con discontinuità G1). Si noti che i vettori nodo non bloccati sono supportati, ma verranno convertiti in vettori bloccati e le modifiche corrispondenti verranno applicate ai dati di peso/punto del controllo. Matrice nodi: le dimensioni della matrice devono essere num_control_points + degree + 1
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Crea una curva BSpline tramite interpolazione tra i punti. NOTA 2: se la curva è periodica (chiusa), il primo e l'ultimo punto DEVONO coincidere.
points: Punti per curva NURBS
closeCurve: Attiva/Disattiva per chiudere la curva
Returns: NurbsCurve creata da punti
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
Ottiene i punti di controllo della NurbsCurve. Si tratta dei punti che la curva utilizza per l'interpolazione.
Returns: Una serie di punti