Autodesk.DesignScript.Geometry.Ellipse.ToString
Ottiene una rappresentazione stringa dell'ellisse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Crea un'ellisse centrata nel punto di input, allineata con il piano XY del sistema di coordinate globali (WCS), con i raggi asse X e Y specificati.
origin: Punto di origine dell'ellisse
xAxisRadius: Raggio asse X
yAxisRadius: Raggio asse Y
Returns: Ellisse creata da origine e raggi
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crea un'ellisse centrata nel punto di input, con i due assi specificati. Gli assi devono essere perpendicolari tra loro.
origin: Punto di origine dell'ellisse
xAxisRadius: Raggio asse X
yAxisRadius: Raggio asse Y
Returns: Ellisse creata da vettori di origine
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crea un'ellisse centrata e allineata con il CoordinateSystem di input, con un raggio x_radius nella direzione X del sistema di coordinate e un raggio y_radius nella direzione Y del sistema di coordinate.
origin: Sistema di coordinate di origine dell'ellisse
xAxisRadius: Raggio asse X
yAxisRadius: Raggio asse Y
Returns: Ellisse creata da sistema di coordinate e raggi
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Crea un'ellisse centrata e allineata con il piano di input, con un raggio x_radius nella direzione dell'asse X del piano e un raggio y_radius nella direzione dell'asse Y del piano.
plane: Piano in cui viene disegnato l'arco di ellisse
xAxisRadius: Raggio asse X
yAxisRadius: Raggio asse Y
Returns: Ellisse creata da piano e raggi
ellipse,aligned ellipse,ellipsebylengths