Autodesk.DesignScript.Geometry.Solid.ToString
Ottiene una rappresentazione stringa del solido

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Crea un solido generando loft tra curve chiuse di sezione trasversale di input, con una curva di guida. La curva di guida deve intersecare tutte le curve di sezione trasversale.
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Crea un solido generando loft tra curve chiuse di sezione trasversale di input, con curve di guida. Le curve di guida devono intersecare tutte le curve di sezione trasversale.
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
Crea un solido generando loft tra sezioni trasversali composte da elementi PolyCurve chiusi. Questa operazione è ottimizzata per sezioni composte esclusivamente da segmenti di linea, con vertici che seguono lo stesso ordine. L'opzione di controllo e correzione garantisce la validità del solido prodotto quando è attivata, mentre quando è disattivata dovrebbe aumentare le prestazioni.
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Crea un solido di rivoluzione effettuando l'estrusione su percorso della curva di profilo intorno al raggio dell'asse formato dall'origine e dal vettore dell'asse, dall'angolo iniziale in gradi all'angolo di estrusione su percorso in gradi.
profile: Curva di profilo di cui eseguire la rivoluzione
axisOrigin: Origine asse di rivoluzione
axisDirection: Direzione asse di rivoluzione
startAngle: Angolo iniziale in gradi
sweepAngle: Angolo di estrusione su percorso in gradi
Returns: Solido creato mediante rivoluzione
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
Unisce un elenco di solidi al solido corrente.
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
Differenza booleana tra il solido corrente e un altro solido

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
Restituisce un involucro solido dalle facce del solido corrente
internalFaceThickness: Distanza in base alla quale estendere la shell verso l'interno
externalFaceThickness: Distanza in base alla quale estendere la shell verso l'esterno
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Proietta la geometria di input su questo solido nella direzione del vettore di input. Attualmente questo metodo di proiezione supporta solo punti o curve.
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
Separa un solido in solidi singoli se contiene più di un blocco disgiunto. Restituisce lo stesso solido se è un unico blocco contiguo.
Returns: solidi disgiunti separati
split,disjoint