Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
Ottiene una rappresentazione stringa di TSplineSurface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea un piano T-Spline "orientato", posizionato in corrispondenza del punto di origine con vettore normale, ma con un orientamento specifico dell'asse X.
Ciò non influisce sulle operazioni di divisione, intersecazione, progetto e così via; consente solo di specificare l'orientamento del CoordinateSystem di input.
origin: Punto di origine del piano
normal: Normale del piano
xAxis: Asse X del piano
minCorner: Punto 2D di angolo minimo nelle coordinate del piano
maxCorner: Punto 2D di angolo massimo nelle coordinate del piano
xSpans: Numero di campate in larghezza
ySpans: Numero di campate in lunghezza
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Piano della superficie T-Spline
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare un piano con origine sull'asse X e Y.
L'asse Z è il prodotto vettoriale dei due vettori.
origin: Punto di origine del piano
xAxis: Asse X del piano
yAxis: Asse Y del piano
minCorner: Punto 2D di angolo minimo nelle coordinate del piano
maxCorner: Punto 2D di angolo massimo nelle coordinate del piano
xSpans: Numero di campate in larghezza
ySpans: Numero di campate in lunghezza
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Piano della superficie T-Spline
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCylinderRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Costruire un cilindro T-Spline definito in base ad un CoordinateSystem principale, raggio e altezza del cilindro
cs: Il centro e la base del cilindro verranno adattati al piano X-Y del sistema di coordinate
radius: Raggio di un cilindro
height: Altezza di un cilindro
radiusSpans: Numero di campate nella circonferenza
heightSpans: Numero di campate in altezza
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Superficie T-Spline cilindrica
tspline,cylinder,radius,height

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare un cono T-Spline con un dato raggio base in corrispondenza del punto iniziale
che si estende fino all'apice del punto finale.
startPoint: Punto iniziale di un cono
endPoint: Punto finale di un cono
radius: Raggio della base del cono
radiusSpans: Numero di campate nella circonferenza
heightSpans: Numero di campate in altezza
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Superficie T-Spline conica
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare un cono T-Spline con asse dal punto iniziale al punto finale, con il raggio specificato in corrispondenza di inizio e fine.
Questo oggetto non dispone di un apice e presenta la forma di un tronco di solido.
startPoint: Punto iniziale di un cono
endPoint: Punto finale di un cono
startRadius: Raggio iniziale di un cono
endRadius: Raggio finale di un cono
radiusSpans: Numero di campate nella circonferenza
heightSpans: Numero di campate in altezza
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Superficie T-Spline conica
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea un cono T-Spline con punto base in corrispondenza dell'origine del CoordinateSystem. Il cono si estende nella direzione dell'asse Z del CoordinateSystem,
con base circolare sul piano XY del sistema stesso.
cs: Il centro e la base del cono verranno adattati al piano X-Y di questo sistema di coordinate
height: Altezza di un cono
radius: Raggio di un cono
radiusSpans: Numero di campate nella circonferenza
heightSpans: Numero di campate in altezza
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Superficie T-Spline conica
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare un cono T-Spline con punto base in corrispondenza dell'origine del CoordinateSystem. Il cono si estende nella direzione dell'asse Z del CoordinateSystem,
con base circolare sul piano XY del sistema stesso.
cs: Il centro e la base del cono verranno adattati al piano X-Y di questo sistema di coordinate
height: Altezza di un cono
startRadius: Raggio iniziale di un cono
endRadius: Raggio finale di un cono
radiusSpans: Numero di campate nella circonferenza
heightSpans: Numero di campate in altezza
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Superficie T-Spline conica
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare una sfera T-Spline centrata nel punto di input, con il raggio specificato.
centerPoint: Centro di una sfera
radius: Raggio di una sfera
radiusSpans: Numero di campate radiali
heightSpans: Numero di campate in altezza
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Superficie T-Spline sferica
tspline,sphere,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare una sfera T-Spline contenente quattro punti di input sulla superficie.
points: Quattro punti nell'elenco per creare una sfera. I punti non devono essere complanari
radiusSpans: Numero di campate radiali
heightSpans: Numero di campate in altezza
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Superficie T-Spline sferica
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare un toro T-Spline con centro e raggi specificati, allineato con il piano XY reale di default
center: Centro del toro
innerRadius: Raggio interno di un toro
outerRadius: Raggio esterno di un toro
innerRadiusSpans: Numero di campate radiali interne
outerRadiusSpans: Numero di campate radiali esterne
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Superficie T-Spline toroidale
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare un riquadro T-Spline centrato nel punto di input e con la larghezza, lunghezza e altezza specificate.
origin: Centro di un riquadro
width: Larghezza di un riquadro
length: Lunghezza di un riquadro
height: Altezza di un riquadro
xSpans: Numero di campate in larghezza
ySpans: Numero di campate in lunghezza
zSpans: Numero di campate in altezza
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Cuboide T-Spline
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare un riquadro T-Spline centrato e orientato in base al CoordinateSystem di input, con larghezza, lunghezza e altezza specificate.
cs: Il piano X-Y del riquadro verrà allineato con il piano X corrispondente
width: Larghezza di un riquadro
length: Lunghezza di un riquadro
height: Altezza di un riquadro
xSpans: Numero di campate in larghezza
ySpans: Numero di campate in lunghezza
zSpans: Numero di campate in altezza
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Cuboide T-Spline
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare un riquadro T-Spline che si estende dal punto più basso al più alto.
lowPoint: Primo punto dell'angolo
highPoint: Secondo punto dell'angolo
xSpans: Numero di campate in larghezza
ySpans: Numero di campate in lunghezza
zSpans: Numero di campate in altezza
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Cuboide T-Spline
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare una quadball T-Spline con centro sull'origine del CoordinateSystem e raggio specificato
cs: Sistema di coordinate locale
radius: Raggio del quadball
spans: Numero di campate in due dimensioni dei lati del quadball
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Quadball T-Spline
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare un quadball T-Spline con centro e raggio determinati, allineata con il piano XY reale di default
center: Punto centrale del quadball
radius: Raggio del quadball
spans: Numero di campate in due dimensioni dei lati del quadball
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Quadball T-Spline
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Costruire la superficie T-Spline da una superficie NURBS utilizzando una strategia di suddivisione della curvatura.
La superficie di input NURBS viene ricreata con nodi uniformi posizionati a intervalli
parametrici o di lunghezza d'arco uguali in base al flag useArcLen corrispondente e
arrotondati in base alla superficie NURBS di grado 3. La T-Spline di output viene suddivisa in base a
un dato numero di campate e nelle direzioni u e v.
nurbsSurface: Superficie NURBS di input
uSpans: Numero di campate richieste nella direzione U
vSpans: Numero di campate richieste nella direzione V
uUseArcLen: Indica se utilizzare la lunghezza dell'arco o la suddivisione parametrica nella direzione parametrica u
vUseArcLen: Indica se si desidera utilizzare la lunghezza dell'arco o la suddivisione parametrica nella direzione parametrica v
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
Costruire la superficie T-Spline da una superficie NURBS utilizzando una strategia di suddivisione della curvatura.
La superficie di input NURBS viene ricreata al grado 3. La T-Spline di output contiene numeri di campate e
posizioni in ogni direzione rilevata automaticamente a seconda della curvatura.
nurbsSurface: Superficie NURBS di input
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByExtrude(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Costruire una T-Spline mediante l'estrusione di una curva lungo il vettore dato.
curve: Curva di profilo
direction: Vettore estrusione
frontDistance: Distanza di estrusione per direzione di vettore
backDistance: Distanza di estrusione rispetto alla direzione del vettore
frontSpans: Numero di campate in base alla direzione del vettore. Nessuna estrusione per direzione vettore verrà eseguita se 0 è stato superato
backSpans: Numero di campate rispetto alla direzione del vettore. Nessuna estrusione rispetto alla direzione del vettore verrà eseguita se 0 è stato superato
profileSpans: Numero di campate nella direzione del profilo. Definito automaticamente se il valore corrisponde a 0 o meno
uniform: Utilizzare la strategia uniforme o la curvatura per la distribuzione delle campate lungo la direzione del profilo
inSmoothMode: Mostrare superficie T-Spline nel riquadro o nella visualizzazione uniforme
tspline,extrude,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Costruire una T-Spline eseguendo lo sweep di una curva di sezione trasversale lungo una traiettoria.
profile: Curva di profilo
path: Traiettoria della curva
parallel: Le espansioni ls devono essere parallele nella direzione della traiettoria
pathSpans: Numero di campate nella traiettoria
profileSpans: Numero di campate nel profilo. Definito automaticamente se 0 o valore inferiore
pathUniform: Utilizzare la strategia uniforme o la curvatura per la distribuzione delle campate lungo il percorso
profileUniform: Utilizzare la strategia uniforme o la curvatura per la distribuzione delle campate lungo il profilo
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Creare una superficie T-Spline eseguendo lo sweep della curva di profilo attorno all'asse formato
dall'asse di origine e da quello di direzione, partendo da start_angle in gradi
ed eseguendo poi lo sweep in base a sweep_angle in gradi.
profile: Curva di profilo
axisOrigin: Centro di rotazione
axisDirection: Asse di rotazione
startAngle: Angolo da cui iniziare la rotazione
sweepAngle: Angolo in corrispondenza del quale terminare la rotazione
radialSpans: Numero di campate nel raggio
axialSpans: Numero di campate in altezza. Definito automaticamente se 0 o valore inferiore
uniform: Utilizzare la strategia uniforme o la curvatura per la distribuzione delle campate
symmetry: Opzioni di simmetria di una superficie T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Creare una superficie di tubazioni in una rete di curve o linee.
In corrispondenza di ogni intersezione della curva viene creato un giunto uniforme.
Alcuni parametri presentano un valore singolo o un elenco; ciascuna curva ha due valori.
curves: Un elenco di curve da cui creare condotte
defaultRadius: Raggio di default per la creazione di tubazioni
snappingTolerance: La tolleranza utilizzata per rilevare le intersezioni della curva
segmentsCount: Il numero di segmenti in ciascuna tubazione. Sono consentiti i valori singoli o un elenco, due volte più lungo del numero delle curve
endRotations: I valori delle rotazioni finali di ciascuna tubazione (in gradi). Sono consentiti i valori singoli o gli elenchi, due volte più lunghi del numero delle curve
endRadii: I valori dei raggi finali di ciascuna tubazione. Sono consentiti i valori singoli o gli elenchi, due volte più lunghi del numero delle curve
endPercentage: Valori (da 0 a 1) dalla fine di ogni curva di input al punto iniziale del mesh della tubazione. Sono consentiti i valori singoli o gli elenchi, due volte più lunghi del numero delle curve
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Crea una superficie di condotte da una rete di curve o linee.
Viene creato un giunto levigato ad ogni intersezione di curva.
Alcuni parametri assumono un singolo valore o un elenco - un valore per curva.
curves: Un elenco di curve da cui creare tubazioni
defaultRadius: Raggio di default per la creazione di tubazioni
snappingTolerance: La tolleranza utilizzata per rilevare le intersezioni della curva
segmentsCount: Numero di segmenti per ciascuna curva. La dimensione dell'elenco può essere il numero delle curve o 1 per la replica o 0 per la determinazione automatica.
autoHandleStart: Se è "true", i parametri del punto di manipolazione all'inizio di ogni curva vengono generati automaticamente e i parametri personalizzati di rotationsAtStart, radiiAtStart e positionsAtStart vengono ignorati.
autoHandleEnd: Se è "true", i parametri del punto di manipolazione alla fine di ogni curva vengono generati automaticamente e i parametri personalizzati di rotationsAtEnd, radiiAtEnd e positionsAtEnd vengono ignorati.
startRotations: Angolo di rotazione personalizzato in gradi per ciascun punto di manipolazione della tubazione all'inizio di ogni curva. Questo parametro viene ignorato quando autohandlestart è "true". La dimensione dell'elenco può essere il numero di curve o 1 per la replica.
endRotations: Angolo di rotazione personalizzato in gradi per ciascun punto di manipolazione della tubazione alla fine di ogni curva. Questo parametro viene ignorato quando autoHandleEnd è "true". La dimensione dell'elenco può essere il numero di curve o 1 per la replica.
startRadii: Raggio personalizzato per ciascun punto di manipolazione della tubazione all'inizio di ogni curva. Questo parametro viene ignorato quando autohandlestart è "true". La dimensione dell'elenco può essere il numero di curve o 1 per la replica.
endRadii: Raggio personalizzato per ciascun punto di manipolazione della tubazione alla fine di ogni curva. Questo parametro viene ignorato quando autoHandleEnd è "true". La dimensione dell'elenco può essere il numero di curve o 1 per la replica.
startPositions: Posizione personalizzata per ciascun punto di manipolazione della tubazione all'inizio di ogni curva in percentuale compresa tra 0 e 1 lungo la lunghezza dell'arco della curva. Questo parametro viene ignorato quando autoHandleStart è true. La dimensione dell'elenco può essere il numero di curve o 1 per la replica. Le posizioni iniziale e finale non devono sovrapporsi tra di loro su ciascuna curva. Idealmente, la posizione iniziale deve essere vicina a 0, mentre la posizione finale vicina a 1.
endPositions: Posizione personalizzata per ciascun punto di manipolazione della tubazione alla fine di ogni curva in percentuale compresa tra 0 e 1 lungo la lunghezza dell'arco della curva. Questo parametro viene ignorato quando autoHandleEnd è true. La dimensione dell'elenco può essere il numero di curve o 1 per la replica. Le posizioni iniziale e finale non devono sovrapporsi tra di loro su ciascuna curva. Idealmente, la posizione iniziale deve essere vicina a 0, mentre la posizione finale vicina a 1.
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
Indica se la T-Spline si trova in un riquadro o presenta la modalità levigata
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
Indica se una T-Spline è aperta.
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Convertire una superficie T-Spline in solido o superficie, a seconda della forma.
Nota: potrebbero essere presenti sottili modifiche impreviste nella B-Rep risultante se la superficie di input è stata creata con una versione di T-Spline successiva rispetto a quella caricata in Dynamo poiché in questo caso una copia della superficie verrà sottoposta a downgrade alla versione di Dynamo e sarà utilizzata nella conversione.
matchTopology: Determina se il corpo risultante deve avere la stessa topologia della superficie T-Spline in input.
Returns: Entità topologia (solido o superficie)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
Convertire la superficie T-Spline in mesh. Una mesh può contenere triangoli e quadrilateri.
minSegments: Il numero minimo di segmenti in ciascuna direzione. Viene sempre creato almeno un segmento.
tolerance: Distanza massima consentita tra la mesh e la superficie. Se viene impostata su zero o su un valore negativo viene disattivata
Returns: Entità mesh
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
Elenco dei vertici saldati in un unico vertice.
vertices: Vertici da saldare
newPosition: Posizione del grip del vertice risultante. Se viene passato un valore nullo, viene utilizzata la posizione media dei grip.
keepSubdCreases: Mantenere le triangolazioni secondarie della topologia di input
Returns: Superficie T-Spline con vertici saldati
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Annullare la saldatura di tutti i bordi specificati; verrà annullata la saldatura di ogni vertice su tutti i bordi.
edges: Un gruppo di spigoli per cui annullare la saldatura
Returns: Superficie T-Spline con bordi non saldati
tspline,unweld,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Annullare la saldatura di tutti i vertici specificati. Verrà annullata la saldatura di tutti i bordi su ogni vertice.
vertices: Un insieme di vertici per cui annullare la saldatura
Returns: Superficie T-Spline con vertici non saldati
tspline,unweld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Creare una corrispondenza con T-Spline e perimetro chiuso di curve
tsEdges: Perimetro bordo T-Spline chiuso con cui creare una corrispondenza
curves: Perimetro curva chiuso con cui creare una corrispondenza
continuity: Continuità della geometria per cui si sta tentando di eseguire la corrispondenza: G0, G1, G2
useArclength: Indica se utilizzare o meno l'allineamento arcLength durante la creazione della corrispondenza
useRefinement: Se è True, verranno aggiunti ulteriori punti di controllo alla T-Spline per garantire la corrispondenza alle superfici entro un dato margine di tolleranza.
numRefinementSteps: Numero massimo di passaggi di affinamento. Viene ignorato se useRefinement è impostato su False
refinementTolerance: Tolleranza da raggiungere. Viene ignorata se useRefinement è impostato su False
usePropagation: Indica se si desidera utilizzare la propagazione durante la creazione delle corrispondenze
widthOfPropagation: Determina la quantità di superficie interessata dalla corrispondenza. Ignorato se il valore usePropagation è impostato su False
tangentScale: Scala della tangente. Viene ignorata se la continuità non è impostata su G1
curvParamWeight: Peso parametro curvatura. Viene ignorato se la continuità non è impostata su G2
flipSourceTargetAlignment: Indica se invertire la direzione di allineamento
Returns: Superficie T-Spline posizionata tra i bordi T-Spline e la curva del perimetro
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Creare una corrispondenza con T-Spline e perimetro chiuso di curve
tsEdges: Perimetro bordo T-Spline chiuso con cui creare una corrispondenza
curves: Perimetro curva chiuso con cui creare una corrispondenza
continuity: Continuità della geometria per cui si sta tentando di eseguire la corrispondenza: G0, G1, G2
useArclength: Indica se utilizzare o meno l'allineamento arcLength durante la creazione della corrispondenza
useRefinement: Se è True, verranno aggiunti ulteriori punti di controllo alla T-Spline per garantire la corrispondenza alle superfici entro un dato margine di tolleranza.
numRefinementSteps: Numero massimo di passaggi di affinamento. Viene ignorato se useRefinement è impostato su False
refinementTolerance: Tolleranza da raggiungere. Viene ignorata se useRefinement è impostato su False
usePropagation: Indica se si desidera utilizzare la propagazione durante la creazione della corrispondenza
widthOfPropagation: Determina la quantità di superficie interessata dalla corrispondenza. Ignorato se il valore usePropagation è impostato su False
scale: Scala della tangente per G1 o scala di curvatura per G2. Viene ignorata se la continuità è G0.
flipSourceTargetAlignment: Indica se invertire la direzione di allineamento
Returns: Superficie T-Spline posizionata tra i bordi T-Spline specificati e il perimetro di curve
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Creare una corrispondenza con T-Spline e un perimetro chiuso di bordi B-Rep.
Il perimetro di bordi viene convertito in perimetro di curve, quindi viene eseguita la corrispondenza
tsEdges: Perimetro bordo T-Spline chiuso con cui creare una corrispondenza
brepEdges: Perimetro bordo B-Rep chiuso con cui creare una corrispondenza
continuity: Continuità della geometria per cui si sta tentando di eseguire la corrispondenza: G0, G1, G2
useArclength: Indica se utilizzare o meno l'allineamento arcLength durante la creazione della corrispondenza
useRefinement: Se è True, verranno aggiunti ulteriori punti di controllo alla T-Spline per garantire la corrispondenza alle superfici entro un dato margine di tolleranza.
numRefinementSteps: Numero massimo di passaggi di affinamento. Viene ignorato se useRefinement è impostato su False
refinementTolerance: Tolleranza da raggiungere. Viene ignorata se useRefinement è impostato su False
usePropagation: Indica se si desidera utilizzare la propagazione durante la creazione delle corrispondenze
widthOfPropagation: Determina la quantità di superficie interessata dalla corrispondenza. Ignorato se il valore usePropagation è impostato su False
tangentScale: Scala della tangente. Viene ignorata se la continuità non è impostata su G1
curvParamWeight: Peso parametro curvatura. Viene ignorato se la continuità non è impostata su G2
flipSourceTargetAlignment: Indica se invertire la direzione di allineamento
Returns: Superficie T-Spline posizionata tra i bordi T-Spline e il bordo del perimetro BRep
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
Modificare lo stile di visualizzazione di T-Spline.
Visualizzazione uniforme se True, con riquadro in caso contrario.
enable: Attiva o disattiva la visualizzazione uniforme
Returns: T-Spline con lo stile di visualizzazione selezionato
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Creazione di un ponte tra due gruppi di facce. Gli elementi del
primo gruppo vengono considerati come elementi derivati della superficie. Gli elementi
del secondo gruppo possono derivare da questa superficie o appartenere
ad un'altra superficie. La topologia all'interno di ogni gruppo potrebbe non essere
adiacente, ma deve creare lo stesso numero di singoli perimetri.
firstGroup: Primo gruppo di facce da unire
secondGroup: Secondo gruppo di facce da unire
followCurves: Creazione di ponti per le curve per ogni singolo perimetro di
topologia (nel caso di elenchi vuoti vengono utilizzate linee rette,
nel caso di curve singole esse vengono replicate se viene rilevato
più di un perimetro di input)
frameRotations: Numero di rotazioni complete attorno
alla normale della cornice lungo la curva ponte per ciascun perimetro
della topologia (0 se viene passato un elenco vuoto,
se invece viene passato un valore esso viene replicato in caso di rilevamento di più di un perimetro di input)
spansCounts: Numero di segmenti lungo il ponte per ogni perimetro
della topologia. Il numero di campate di ciascun gruppo deve essere
superiore al numero di rotazioni corrispondenti (1 se viene passato un elenco vuoto,
se invece viene passato un valore esso viene replicato in caso di rilevamento
di più di un perimetro di input)
cleanBorderBridges: Eliminare i ponti tra i bordi.
keepSubdCreases: Mantenere le triangolazioni secondarie
della topologia di input
firstAlignVertices: Elenco di vertici di orientamento per
ciascun perimetro di topologia appartenente al primo gruppo (il numero di vertici deve
corrispondere a quello dei perimetri di input rilevati o l'elenco può essere vuoto)
secondAlignVertices: Elenco di vertici di orientamento per
ciascun perimetro di topologia appartenente al secondo gruppo (il numero di vertici deve
corrispondere a quello dei perimetri di input rilevati o l'elenco può essere vuoto)
flipAlignmentFlags: Elenco dei flag che indica se
è necessario invertire l'allineamento del ponte per il perimetro topologia corrispondente.
(se l'elenco è vuoto, False è impostato, se è presente un valore esso viene
replicato per ciascun perimetro di input rilevato)
Returns: Superficie T-Spline con topologia, collegata da ponte
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Creazione di un ponte tra un gruppo di facce e un gruppo di bordi. Gli elementi del
primo gruppo vengono considerati come elementi derivati della superficie. Gli elementi
del secondo gruppo possono derivare da questa superficie o appartenere
ad un'altra superficie. La topologia all'interno di ogni gruppo potrebbe non essere
adiacente, ma deve creare lo stesso numero di singoli perimetri.
firstGroup: Primo gruppo di facce da unire
secondGroup: Secondo gruppo di bordi da unire
followCurves: Creazione di ponti per le curve per ogni singolo perimetro di
topologia (nel caso di elenchi vuoti vengono utilizzate linee rette,
nel caso di curve singole esse vengono replicate se viene rilevato
più di un perimetro di input)
frameRotations: Numero di rotazioni complete attorno
alla normale della cornice lungo la curva ponte per ciascun perimetro
della topologia (0 se viene passato un elenco vuoto,
se invece viene passato un valore esso viene replicato in caso di rilevamento di più di un perimetro di input)
spansCounts: Numero di segmenti lungo il ponte per ogni perimetro
della topologia. Il numero di campate di ciascun gruppo deve essere
superiore al numero di rotazioni corrispondenti (1 se viene passato un elenco vuoto,
se invece viene passato un valore esso viene replicato in caso di rilevamento
di più di un perimetro di input)
cleanBorderBridges: Eliminare i ponti tra i bordi.
keepSubdCreases: Mantenere le triangolazioni secondarie
della topologia di input
firstAlignVertices: Elenco di vertici di orientamento per
ciascun perimetro di topologia appartenente al primo gruppo (il numero di vertici deve
corrispondere a quello dei perimetri di input rilevati o l'elenco può essere vuoto)
secondAlignVertices: Elenco di vertici di orientamento per
ciascun perimetro di topologia appartenente al secondo gruppo (il numero di vertici deve
corrispondere a quello dei perimetri di input rilevati o l'elenco può essere vuoto)
flipAlignmentFlags: Elenco dei flag che indica se
è necessario invertire l'allineamento del ponte per il perimetro topologia corrispondente.
(se l'elenco è vuoto, False è impostato, se è presente un valore esso viene
replicato per ciascun perimetro di input rilevato)
Returns: Superficie T-Spline con topologia, collegata da ponte
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Creazione di un ponte tra un gruppo di bordi e un gruppo di facce. Gli elementi del
primo gruppo vengono considerati come elementi derivati della superficie. Gli elementi
del secondo gruppo possono derivare da questa superficie o appartenere
ad un'altra superficie. La topologia all'interno di ogni gruppo potrebbe non essere
adiacente, ma deve creare lo stesso numero di singoli perimetri.
firstGroup: Primo gruppo di bordi da unire
secondGroup: Secondo gruppo di facce da unire
followCurves: Creazione di ponti per le curve per ogni singolo perimetro di
topologia (nel caso di elenchi vuoti vengono utilizzate linee rette,
nel caso di curve singole esse vengono replicate se viene rilevato
più di un perimetro di input)
frameRotations: Numero di rotazioni complete attorno
alla normale della cornice lungo la curva ponte per ciascun perimetro
della topologia (0 se viene passato un elenco vuoto,
se invece viene passato un valore esso viene replicato in caso di rilevamento di più di un perimetro di input)
spansCounts: Numero di segmenti lungo il ponte per ogni perimetro
della topologia. Il numero di campate di ciascun gruppo deve essere
superiore al numero di rotazioni corrispondenti (1 se viene passato un elenco vuoto,
se invece viene passato un valore esso viene replicato in caso di rilevamento
di più di un perimetro di input)
cleanBorderBridges: Eliminare i ponti tra i bordi.
keepSubdCreases: Mantenere le triangolazioni secondarie
della topologia di input
firstAlignVertices: Elenco di vertici di orientamento per
ciascun perimetro di topologia appartenente al primo gruppo (il numero di vertici deve
corrispondere a quello dei perimetri di input rilevati o l'elenco può essere vuoto)
secondAlignVertices: Elenco di vertici di orientamento per
ciascun perimetro di topologia appartenente al secondo gruppo (il numero di vertici deve
corrispondere a quello dei perimetri di input rilevati o l'elenco può essere vuoto)
flipAlignmentFlags: Elenco dei flag che indica se
è necessario invertire l'allineamento del ponte per il perimetro topologia corrispondente.
(se l'elenco è vuoto, False è impostato, se è presente un valore esso viene
replicato per ciascun perimetro di input rilevato)
Returns: Superficie T-Spline con topologia, collegata da ponte
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Creazione di un ponte tra due gruppi di bordi. Gli elementi del
primo gruppo vengono considerati come elementi derivati della superficie. Gli elementi
del secondo gruppo possono derivare da questa superficie o appartenere
ad un'altra superficie. La topologia all'interno di ogni gruppo potrebbe non essere
adiacente, ma deve creare lo stesso numero di singoli perimetri.
firstGroup: Primo gruppo di bordi da unire
secondGroup: Secondo gruppo di bordi da unire
followCurves: Creazione di ponti per le curve per ogni singolo perimetro di
topologia (nel caso di elenchi vuoti vengono utilizzate linee rette,
nel caso di curve singole esse vengono replicate se viene rilevato
più di un perimetro di input)
frameRotations: Numero di rotazioni complete attorno
alla normale della cornice lungo la curva ponte per ciascun perimetro
della topologia (0 se viene passato un elenco vuoto,
se invece viene passato un valore esso viene replicato in caso di rilevamento di più di un perimetro di input)
spansCounts: Numero di segmenti lungo il ponte per ogni perimetro
della topologia. Il numero di campate di ciascun gruppo deve essere
superiore al numero di rotazioni corrispondenti (1 se viene passato un elenco vuoto,
se invece viene passato un valore esso viene replicato in caso di rilevamento
di più di un perimetro di input)
cleanBorderBridges: Eliminare i ponti tra i bordi.
keepSubdCreases: Mantenere le triangolazioni secondarie
della topologia di input
firstAlignVertices: Elenco di vertici di orientamento per
ciascun perimetro di topologia appartenente al primo gruppo (il numero di vertici deve
corrispondere a quello dei perimetri di input rilevati o l'elenco può essere vuoto)
secondAlignVertices: Elenco di vertici di orientamento per
ciascun perimetro di topologia appartenente al secondo gruppo (il numero di vertici deve
corrispondere a quello dei perimetri di input rilevati o l'elenco può essere vuoto)
flipAlignmentFlags: Elenco dei flag che indica se
è necessario invertire l'allineamento del ponte per il perimetro topologia corrispondente.
(se l'elenco è vuoto, False è impostato, se è presente un valore esso viene
replicato per ciascun perimetro di input rilevato)
Returns: Superficie T-Spline con topologia, collegata da ponte
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
Riempi i fori in una T-Spline
edges: Gruppo di bordi con foro interno. I bordi devono essere di tipo bordo.
fillMethod: Metodo per il riempimento dei fori: 0 - tassellazione, 1 - poligoni, 2 - comprimi, 3 - comprimi e salda
keepSubdCreases: Mantenere le triangolazioni secondarie della topologia di input
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
Comprime tutta la topologia sulla superficie e fa in modo che gli indici siano contigui. Questa funzione mantiene l'ordine relativo degli indici.
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
L'interpolazione in avanti sposta i punti di controllo sulle posizioni dei parametri sulla superficie. L'interpolazione inversa, invece, genera un punto sulla superficie di ciascun punto di controllo originale e lo sposta in corrispondenza del punto della superficie.
reverse: Direzione di interpolazione: in avanti se è False, inversa in caso contrario
Returns: T-Spline interpolata nella direzione indicata
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Copiare le facce selezionate nella nuova superficie. La nuova superficie non presenta simmetrie
faces: Facce da duplicare
Returns: Superficie T-Spline con solo facce selezionate
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Spostare vertici specificati lungo un vettore specificato
vertices: Elenco dei vertici da spostare
vector: Direzione in cui effettuare lo spostamento
onSurface: Flag che indica se utilizzare la superficie o i punti di controllo dei vertici

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSS(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface},System.String)
Esporta gruppo definito di superfici T-Spline in file scena T-Spline
tSplineSurfaces: Gruppo di superfici T-Spline da esportare
filePath: Percorso del file in cui eseguire il salvataggio
Returns: Percorso in cui si sta salvando il gruppo di T-Spline
tspline,export,save,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface,System.String)
Esporta una data superficie T-Spline in un file mesh T-Spline
tSplineSurface: Superficie T-spline da esportare
filePath: Percorso del file in cui eseguire il salvataggio
Returns: Percorso in cui si sta salvando la superficie T-Spline
tspline,export,save,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
Scrivere la superficie T-Spline in una stringa in formato mesh T-Spline.
tSplineSurface: Superficie T-Spline da serializzare
Returns: Stringa in cui la superficie T-Spline viene serializzata
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
Creare una superficie T-Spline dalla stringa in formato mesh T-Spline.
content: Rappresentazione stringa del file mesh T-Spline
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Superficie T-Spline appena caricata nell'elenco
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
Caricare una superficie T-Spline da un dato file mesh T-Spline
filePath: Percorso del file da cui eseguire il caricamento
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Superficie T-Spline appena caricata nell'elenco
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.IO.FileInfo,System.Boolean)
Caricare una superficie T-Spline da un dato file mesh T-Spline
file: File da cui eseguire il caricamento
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Superficie T-Spline appena caricata nell'elenco
tspline,import,load,tsm,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
Caricare una serie di superfici T-Spline da un dato file scena T-Spline
filePath: Percorso del file da cui eseguire il caricamento
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Un gruppo di superfici T-Spline appena caricato
tspline,import,load,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.IO.FileInfo,System.Boolean)
Caricare una serie di superfici T-Spline da un dato file scena T-Spline
file: File da cui eseguire il caricamento
inSmoothMode: Mostra superficie T-Spline nel riquadro o nella visualizzazione uniforme
Returns: Un gruppo di superfici T-spline appena caricato
tspline,import,load,tss,file