Autodesk.DesignScript.Geometry.Sphere.ToString
Ottiene una rappresentazione stringa della sfera

Autodesk.DesignScript.Geometry.Sphere.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Crea una sfera solida centrata nel punto di input, con il raggio dato.
Brep,brep