Autodesk.DesignScript.Geometry.Plane.ToString
Ottiene una rappresentazione stringa del piano

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crea un piano "orientato" posizionato nell'origine del punto con il vettore come normale, ma con un orientamento specifico dell'asse X. Ciò non ha effetto sulle operazioni di suddivisione, intersezione, proiezione e così via, ma semplicemente specifica l'orientamento del CoordinateSystem di input.
origin: Punto di origine del piano
normal: Vettore direzione normale
xAxis: Vettore direzione asse X
Returns: Piano da normale e asse X di origine

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Gli assi X e Y si trovano sul piano. L'asse Z è il prodotto vettoriale dei due vettori.
origin: Punto di origine del piano
xAxis: Vettore direzione asse X del piano
yAxis: Vettore direzione asse Y del piano
Returns: Piano creato dall'asse x e dall'asse y di origine

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Crea un piano contenente la linea di input e il punto esterno. Il punto non può trovarsi sulla linea o sull'asse della linea.
line: Linea utilizzata per determinare il piano
point: Punto utilizzato per determinare il piano
Returns: Piano creato da linea e punto
lines
0.4

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
Crea un nuovo CoordinateSystem che rappresenta questo piano. È basato sull'origine e sulla base costituita dagli assi X e Y.
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
Crea un nuovo piano di offset rispetto al piano corrente, nella direzione normale e con la distanza di offset specificata.
alongnormal,moveplane