Autodesk.DesignScript.Geometry.Edge.ToString
Ottiene una rappresentazione stringa del bordo

Autodesk.DesignScript.Geometry.Edge.CurveGeometry
Curva sottostante che definisce lo spigolo

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
Facce adiacenti a questo spigolo

Autodesk.DesignScript.Geometry.Edge.StartVertex
Vertice dal quale inizia questo spigolo

Autodesk.DesignScript.Geometry.Edge.EndVertex
Vertice nel quale termina questo spigolo