Autodesk.DesignScript.Geometry.Surface.ToString
Ottiene una rappresentazione stringa della superficie

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Unione di una raccolta di superfici in un'unica superficie. Questo metodo potrebbe restituire una PolySurface se l'unione risultante non è multiforme o a più facce.
surfaces: Raccolta di superfici.
Returns: Unione di superfici
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Crea una superficie mediante loft tra curve di sezione trasversale di input.
crossSections: Curve in cui eseguire il loft
Returns: Superficie creata mediante loft
loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
Crea una superficie mediante loft tra linee di sezione trasversale di input. Questo metodo è leggermente più veloce e produce un risultato meno uniforme rispetto a Surface.ByLoft.
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Esegue il loft di una superficie mediante le sezioni trasversali con una curva di guida data. La curva di guida deve intersecare tutte le curve di sezione trasversale.
loftbyrail

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Esegue il loft di una superficie mediante le sezioni trasversali con curve di guida date. Le curve di guida devono intersecare tutte le curve di sezione trasversale.
crossSections: Curve in cui eseguire il loft
guideCurves: Curve in cui guidare il loft
Returns: Superficie creata mediante loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Crea una superficie tramite estrusione su percorso di una curva di sezione trasversale lungo un percorso.
profile: Curva di cui eseguire l'estrusione su percorso
path: Curva del percorso utilizzata lungo cui eseguire l'estrusione
Returns: Superficie creata mediante estrusione del profilo lungo il percorso
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea una superficie poligonale connettendo punti di input in un poligono chiuso e aggiungendo una superficie chiusa.
points: Elenco di punti del perimetro
Returns: Superficie creata da punti del perimetro
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Crea una superficie eseguendo l'estrusione su percorso della curva di profilo attorno al raggio asse formato dal punto di origine nella direzione del vettore dell'asse, dall'angolo iniziale in gradi all'angolo di estrusione su percorso in gradi.
profile: Curva di profilo di cui eseguire la rivoluzione
axisOrigin: Origine asse di rivoluzione
axisDirection: Direzione asse di rivoluzione
startAngle: Angolo iniziale in gradi
sweepAngle: Angolo di estrusione su percorso in gradi
Returns: Superficie creata da profilo di rivoluzione
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Crea una superficie mediante il riempimento di un contorno chiuso definito da curve di input.
closedCurve: Curva chiusa utilizzata come contorno della superficie
Returns: Superficie creata da patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Differenza booleana di questa superficie e l'unione delle superfici di input. Questo metodo potrebbe restituire una PolySurface se il valore booleano risultante non è multiforme o a più facce.
others: Altre superfici da sottrarre
Returns: Superficie booleana o polySurface risultante
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Ritagliare la superficie con una raccolta di uno o più perimetri all'interno della superficie di input. Uno dei perimetri deve essere il perimetro di contorno della superficie di input. Inoltre, devono essere aggiunti uno o più perimetri interni per i fori.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
Ottiene una rappresentazione NURBS della superficie. In determinate circostanze, questo metodo può restituire un valore di superficie approssimato.

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Ottiene una rappresentazione NURBS della superficie, entro una tolleranza specifica. In determinate circostanze, questo metodo può restituire un valore di superficie approssimato.
tolerance: Tolleranza specificata
Returns: Rappresentazione della superficie NURBS
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Ispessisce una superficie e crea un solido. L'estrusione avviene nella direzione delle normali su entrambi i lati della superficie.
thickness: Valore di ispessimento
Returns: Superficie ispessita come solido
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Ispessisce una superficie e crea un solido. L'estrusione avviene nella direzione delle normali su entrambi i lati della superficie. Se il parametro both_sides è true, la superficie viene ispessita su entrambi i lati.
thickness: Valore di ispessimento
both_sides: True per ispessire su entrambi i lati, false per ispessire su un lato
Returns: Superficie ispessita come solido
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
Il sistema di coordinate restituito utilizza xAxis, yAxis e zAxis per rappresentare uDir, vDir e la normale. La lunghezza di xAxis, yAxis rappresenta le curvature.
u: Componente U del parametro
v: Componente V del parametro
Returns: Sistema di coordinate basato su normale, direzione U e direzione V nella posizione UV sulla superficie

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
Crea una curva da una linea di parametro sulla superficie data. La curva rappresenta una linea di parametro U o V sulla superficie. Una linea di parametro procede nella direzione di incremento di un parametro U o V in corrispondenza di una costante opposta al parametro U o V. La curva risultante corrisponderà alla parametrizzazione della superficie e il suo intervallo sarà delimitato dall'intervallo del parametro Surface. Il tipo di curva restituito dipenderà dal tipo di superficie.
isoDirection: Se direzione == 0, crea una linea di parametro U, se direzione == 1, crea una linea di parametro V.
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Restituisce una nuova superficie con la normale invertita. La superficie resta invariata.
Returns: Superficie, che è uguale alla superficie di input ma con normali invertite

Autodesk.DesignScript.Geometry.Surface.Join(Autodesk.DesignScript.Geometry.Surface)
Combina la superficie corrente e la superficie di input in una PolySurface
topolysurface

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Combina la superficie corrente e le superfici di input in una PolySurface
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Proietta la geometria di input su questa superficie nella direzione del vettore di input. Attualmente questo metodo di proiezione supporta solo punti o curve.
projecttosurface,projectonto