Autodesk.DesignScript.Geometry.Arc.ToString
Ottiene una rappresentazione stringa dell'arco

Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Crea un arco o una tangente da arco mediante punti iniziale e finale e tangenze all'inizio e alla fine
point1: Punto di inizio del doppio arco
vector1: Vettore tangente per il punto iniziale del doppio arco
point2: Punto di fine del doppio arco
vector2: Vettore tangente per la fine del doppio arco
arc,tangent

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Crea un arco dal punto iniziale al punto finale con tangente iniziale al vettore
startPoint: Punto iniziale dell'arco
endPoint: Ultimo punto dell'arco
startTangent: Vettore direzione tangente iniziale
arc,tangent,arcs