Autodesk.DesignScript.Geometry.Line.ToString
Ottiene una rappresentazione stringa della linea

Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Crea una linea tangente alla curva di input, posizionata nel punto della curva corrispondente al parametro.
curve: Curva di base per la linea tangente
parameter: Valore parametro
Returns: Linea tangente
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Crea una linea retta a partire dal punto iniziale, che si estende nella direzione del vettore per la lunghezza specificata.
startPoint: Punto iniziale linea
direction: Vettore direzione
length: Lunghezza della linea
Returns: Linea da direzione iniziale e lunghezza
linebyvector,lines