Autodesk.DesignScript.Geometry.Polygon.ToString
Ottiene una rappresentazione stringa del poligono

Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Verifica se il punto è interno al poligono piano senza autointersezioni.