Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
Ottiene una rappresentazione stringa di TSplineTopology

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
Restituisce il vertice ad un dato indice
index: Indice in corrispondenza del quale ottenere il vertice
Returns: Vertici T-Spline
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
Restituisce il bordo all'indice specificato
index: Indice in corrispondenza del quale ottenere il bordo
Returns: Bordo T-Spline
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
Restituisce la faccia all'indice specificato
index: Indice in corrispondenza del quale ottenere la faccia
Returns: Faccia T-Spline
tspline,face,byindex