Autodesk.DesignScript.Geometry.Cuboid.ToString
Ottiene una rappresentazione stringa del cuboide

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Crea un cuboide con centro nel punto di input e con la larghezza, lunghezza e altezza specificate.
origin: Punto di origine
width: Larghezza del cuboide
length: Lunghezza del cuboide
height: Altezza del cuboide
Returns: Cuboide creato da lunghezze
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.Length
Restituisce la distanza della lunghezza. Nota: restituisce le dimensioni di input del cuboide e NON le dimensioni nello spazio comune. In altri termini se si crea una larghezza del cuboide (asse X) pari a 10 e la si trasforma in un CoordinateSystem con scalatura 2x per l'asse X, il valore della larghezza resterà 10. ASM non consente l'estrazione dei vertici di un corpo in un ordine prevedibile, pertanto non è possibile determinare le dimensioni dopo una trasformazione.

Autodesk.DesignScript.Geometry.Cuboid.Width
Restituisce la distanza della larghezza. Nota: restituisce le dimensioni di input del cuboide e NON le dimensioni nello spazio comune. In altri termini, se si crea una larghezza del cuboide (asse X) pari a 10 e la si trasforma in un CoordinateSystem con scalatura 2x per l'asse X, il valore della larghezza resterà 10. ASM non consente l'estrazione dei vertici di un corpo in un ordine prevedibile, pertanto non è possibile determinare le dimensioni dopo una trasformazione.

Autodesk.DesignScript.Geometry.Cuboid.Height
Restituisce la distanza dell'altezza. Nota: restituisce le dimensioni di input del cuboide e NON le dimensioni nello spazio comune. In altri termini, se si crea una larghezza del cuboide (asse X) pari a 10 e la si trasforma in un CoordinateSystem con scalatura 2x per l'asse X, il valore della larghezza resterà 10. ASM non consente l'estrazione dei vertici di un corpo in un ordine prevedibile, pertanto non è possibile determinare le dimensioni dopo una trasformazione.