Autodesk.DesignScript.Geometry.Circle.ToString
Ottiene una rappresentazione stringa del cerchio

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Crea un cerchio con un centro e un raggio dati nel piano XY globale, con l'asse Z globale come normale.
centerPoint: Punto centrale del cerchio
radius: Raggio
Returns: Cerchio creato con punto centrale e raggio
circle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
Crea un cerchio con centro nell'origine del piano di input (radice), posto sul piano di input, con il raggio specificato.
plane: Radice del piano utilizzato per centrare il cerchio
radius: Raggio
Returns: Cerchio creato con piano e raggio
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Crea un cerchio che passa attraverso tre punti di input.
p1: Primo punto del cerchio
p2: Secondo punto del cerchio
p3: Terzo punto del cerchio
circle