Autodesk.DesignScript.Geometry.PolyCurve.ToString
Ottiene una rappresentazione stringa di PolyCurve

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Crea una PolyCurve mediante l'unione di curve. Inverte le curve in base alle esigenze di connettività. Scegliere la tolleranza di unione preferita compresa tra le unità 1e-6 e 1e-3.
curves: Le curve da unire in PolyCurve
joinTolerance: La tolleranza per determinare la dimensione di spaziatura consentita tra curve da unire
Returns: PolyCurve create da curve unite
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Crea una o più PolyCurve raggruppando le curve connesse. Scegliere una tolleranza di unione preferita tra le unità 1e-6 e 1e-3.
curves: Curve da raggruppare per creare una o più PolyCurve
joinTolerance: La tolleranza per determinare la dimensione di spaziatura consentita tra curve da unire

Autodesk.DesignScript.Geometry.PolyCurve.Curves
Restituisce le curve della PolyCurve
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
Estende la PolyCurve in base all'arco tangente
length: Lunghezza dell'arco di estensione
radius: Raggio dell'arco
endOrStart: estensione estremità finale o iniziale di PolyCurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Applica un raccordo alla PolyCurve nel piano di appartenenza.
radius: Raggio di raccordo
rightSide: True per raccordare sul lato destro rispetto all'inizio della PolyCurve, false per raccordare sul lato sinistro
Returns: PolyCurve raccordata
round,smooth,radius