Autodesk.DesignScript.Geometry.BoundingBox.ToString
Ottiene una rappresentazione stringa di BoundingBox

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Confronta due elementi BoundingBox
other: Altro elemento BoundingBox
Returns: Indica se i due oggetti sono uguali

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
Ottiene un hashcode per il tipo
Returns: Hashcode univoco per l'oggetto corrente

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
Crea un BoundingBox allineato all'asse intorno alla geometria di input.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
Crea un BoundingBox non allineato all'asse intorno alla geometria di input, orientato lungo gli assi X, Y e Z del CoordinateSystem.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
Crea un BoundingBox non allineato all'asse intorno alle geometrie di input, orientato lungo gli assi X, Y e Z del CoordinateSystem.
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
Crea un BoundingBox dalle coordinate minime (angolo sinistro inferiore posteriore del riquadro) alle coordinate massime (angolo destro superiore anteriore del riquadro). Il CoordinateSystem è la trasformazione dallo spazio delle coordinate del riquadro allo spazio modello. Questo metodo consente l'adattamento all'API di Revit e permette l'estrazione dei parametri di un BoundingBox di Revit senza alcuna conversione.
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
CoordinateSystem nel quale è definito il BoundingBox corrente

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Ottiene l'intersezione di due BoundingBox
other: Altro riquadro di delimitazione da intersecare
Returns: Riquadro di delimitazione ottenuto dall'intersezione di riquadri di delimitazione

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Determina se due BoundingBox si intersecano
other: Altro riquadro di delimitazione
Returns: Lascia intersecare i riquadri di delimitazione
get overlap