Autodesk.DesignScript.Geometry.NurbsSurface.ToString
Ottiene una rappresentazione stringa di NurbsSurface

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Crea una superficie NURBS con i punti interpolati e i gradi U e V specificati. La superficie risultante passa attraverso tutti i punti.
points: Griglia di punti per la superficie NURBS
uDegree: Grado nella direzione u
vDegree: Grado nella direzione v
Returns: Superficie NURBS creata da punti
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Crea una NurbsSurface con i punti interpolati e i gradi U e V specificati. La superficie risultante passa attraverso tutti i punti. Il numero di tangenti deve essere uguale al numero di punti nella direzione corrispondente. La superficie risultante sarà di grado 3 in entrambe le direzioni U e V.
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Crea una NurbsSurface che soddisfa una raccolta di caratteristiche di superficie diverse. È il metodo più avanzato per l'adattamento di superfici. La superficie risultante passa attraverso tutti i punti. Il numero di tangenti deve essere uguale al numero di punti nella direzione corrispondente. La superficie risultante è di grado 3 in entrambe le direzioni U e V. Le derivate degli angoli devono essere di secondo ordine (dP/dUdV) e devono essere fornite nel seguente ordine [ lowU, lowV ], [ highU, lowV ], [ lowU, highV ], [ highU, highV ].
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
Crea una NurbsSurface con vertici di controllo, nodi, pesi e gradi U e V specificati. Sono presenti varie restrizioni dei dati che, in caso di violazione, restituiscono un errore e generano un'eccezione. Grado: i gradi U- e V- devono essere >= 1 (spline lineare a tratti) e inferiori a 26 (il grado massimo di base di B-spline supportato da ASM). Pesi: tutti i valori di peso (se forniti) dovranno essere positivi. I pesi inferiori a 1e-11 verranno respinti e la funzione produrrà un errore. Nodi: entrambi i vettori nodo dovranno essere sequenze non decrescenti. La molteplicità dei nodi interna non deve essere superiore a grado + 1 in corrispondenza del nodo iniziale/finale e a grado in corrispondenza di un nodo interno (ciò consente la rappresentazione di superfici con discontinuità G1). Si osservi che i vettori nodo non bloccati sono supportati ma verranno convertiti in bloccati e le modifiche corrispondenti verranno applicate ai dati del punto di controllo/peso.
lines
0.4