Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
Ottiene una rappresentazione stringa di TSplineReflection

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
Creare un riflesso radiale della simmetria della T-Spline in base al piano specificato, con numero di segmenti e angolo (in gradi) specifici tra ogni coppia di segmenti.
plane: Piano la cui normale è l'asse del riflesso radiale della T-Spline, espresso in coordinate reali
segmentsCount: Numero di segmenti di riflesso radiale
segmentAngle: Angolo tra ciascuna coppia di segmenti di simmetria radiale (in gradi). Se è impostato su 0 è definito da (360/n. segmenti)
Returns: Riflesso radiale T-Spline
tspline,symmetry,reflection,radial