Autodesk.DesignScript.Geometry.Cone.ToString
Ottiene una rappresentazione stringa del cono

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Crea un cono con raggio base dato centrato nel punto iniziale e vertice nel punto finale.
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Crea un cono il cui asse va dal punto iniziale al punto finale, provvisto di un raggio iniziale e un raggio finale. Questo oggetto non dispone di un vertice e può essere considerato come un tronco di cono.
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crea un cono con il punto base in corrispondenza dell'origine del CoordinateSystem. Il cono si estende per la lunghezza specificata nella direzione dell'asse Z del sistema, mentre la base circolare si trova nel piano XY del sistema stesso.

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Crea un cono con il punto base in corrispondenza dell'origine del CoordinateSystem. Il cono si estende per la lunghezza specificata nella direzione dell'asse Z del sistema, mentre la base circolare si trova nel piano XY del sistema stesso.
cone,cone by height,cones