Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
Cerca una stringa localizzata simile a Sono state superate le estensioni di modellazione consentite; prendere in considerazione la scelta di valori inferiori.

Autodesk.DesignScript.Geometry.Properties.Resources.OutsideAllowableModelingRange
Cerca una stringa localizzata simile a Gli input non rientrano nell'intervallo di modellazione consentito. È consigliabile scegliere l'impostazione {0} con un intervallo di modellazione compreso tra {1} e {2} dalla finestra di dialogo "Preferenze => Generale => Scala della geometria".