Autodesk.DesignScript.Geometry.Point.ToString
Ottiene una rappresentazione stringa del punto

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Confronta due punti
other: L'altro punto
Returns: Indica se i due oggetti sono uguali

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
Ottiene un hashcode per il tipo
Returns: Hashcode univoco per l'oggetto corrente

Autodesk.DesignScript.Geometry.Point.Origin
Ottiene il punto di origine (0,0,0)
Returns: Punto di origine
zero,origin