Autodesk.DesignScript.Geometry.Helix.ToString
Ottiene una rappresentazione stringa dell'elica

Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Crea un'elica. L'elica ruota sempre in senso orario intorno alla direzione dell'asse fornito. Se si guarda lungo la direzione dell'asse, si vedrà il punto che ruota in senso orario intorno all'asse, mentre si sposta lungo la curva nella direzione specificata dal parametro di incremento. Il passo è la distanza di spostamento dell'elica nella direzione dell'asse ad ogni rotazione. Questo valore può essere positivo o negativo.
axisPoint: Punto asse
axisDirection: Vettore direzione asse
startPoint: Punto iniziale elica
pitch: Distanza dell'elica per ogni 360 gradi nella direzione dell'asse
angleTurns: Numero di rotazioni in gradi
Returns: Elica creata dall'asse
helix,screw,corkscrew,thread