Autodesk.DesignScript.Geometry.Curve.ToString
Ottiene una rappresentazione stringa della curva

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Crea una curva che si unisce tra due curve
curve1: Prima curva da unire
curve2: Seconda curva da unire
endOrStart1: flag per indicare quale estremità della curva1 unire
endOrStart2: flag per indicare quale estremità della curva1 unire
isG2Continuous: flag che indica se la curva risultante è di continuità G1 o G2
Returns: Curva risultante dall'unione di due curve
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
Ottieni un CoordinateSystem con origine nel punto corrispondente al parametro specificato. L'asse X viene allineato con la normale della curva, l'asse Y con la curva tangente in corrispondenza di tale punto e l'asse Z sul vettore di orientamento o binormale su tale punto
param: Il parametro in base al quale valutare
Returns: CoordinateSystem in corrispondenza del parametro della curva
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
Restituisce un piano la cui normale è allineata con la tangente della curva. I parametri vengono regolati in modo che 0 sia sempre il punto iniziale e 1 sia sempre il punto finale.
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtDistance(System.Double)
Ottenere un punto in corrispondenza di una determinata lunghezza dell'arco lungo la curva
segmentLength: La distanza lungo la curva in corrispondenza della quale si desidera valutare
Returns: Il punto in corrispondenza di una determinata lunghezza dell'arco
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
Restituisce i punti distanziati in modo uniforme lungo la lunghezza della curva in base al numero di divisioni immesso
divisions: Numero di divisioni
Returns: Punti distanziati in modo uniforme lungo la curva

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
Restituisce i punti equidistanti lungo la curva in corrispondenza dell'uguale lunghezza dell'asta in base al numero di divisioni immesso
divisions: Numero di divisioni
Returns: Elenco di punti sulla curva

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Restituisce i punti con spaziatura uniforme lungo la curva in corrispondenza della lunghezza del segmento fornita e a partire dal punto specificato
point: Il punto di riferimento da cui eseguire la misurazione
segmentLength: La distanza lungo la curva in corrispondenza della quale eseguire la valutazione
Returns: Elenco di punti sulla curva

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Restituisce i punti distanziati sulla curva in corrispondenza della lunghezza dell'asta fornita a partire dal punto specificato
point: Il punto di riferimento da cui eseguire la misurazione
chordLength: Lunghezza corda
Returns: Elenco di punti sulla curva

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
Restituisce un CoordinateSystem alla distanza specificata dal punto iniziale della curva. L'asse Y risulta tangente alla curva, l'asse X è la curvatura.
segmentLength: La distanza lungo la curva in corrispondenza della quale eseguire la valutazione
Returns: CoordinateSystem sulla curva
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtDistance(System.Double)
Restituisce un CoordinateSystem alla distanza specificata dal punto iniziale della curva. L'asse Y è tangente alla curva, l'asse X è la curvatura.
segmentLength: La distanza lungo la curva in corrispondenza della quale si desidera valutare
Returns: CoordinateSystem sulla curva
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
Restituisce un piano alla distanza specificata dal punto iniziale della curva. La perpendicolare al piano è allineata alla tangente della curva.
segmentLength: La distanza lungo la curva in corrispondenza della quale eseguire la valutazione
Returns: Piano sulla curva
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PlaneAtDistance(System.Double)
Restituisce un piano alla distanza specificata lungo la curva rispetto al punto iniziale. La perpendicolare al piano si allinea con la tangente della curva.
segmentLength: La distanza lungo la curva in corrispondenza della quale si desidera valutare
Returns: Piano sulla curva
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
Ottiene la lunghezza del segmento misurata dal punto iniziale della curva al parametro specificato.
param: Valore compreso tra 0 e 1
Returns: Lunghezza segmento
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtDistance(System.Double)
Ottenere il parametro ad una determinata lunghezza dell'arco lungo la curva.
segmentLength: La distanza lungo la curva in corrispondenza della quale si desidera valutare
Returns: Il parametro
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.LengthBetweenParameters(System.Double,System.Double)
Ottenere la lunghezza dell'arco tra due punti parametrici sulla curva
startParam: L'inizio del dominio
endParam: La fine del dominio
Returns: La lunghezza dell'arco tra i due parametri
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Ottiene il parametro in un determinato punto lungo la curva. Se il punto non è sulla curva, ottiene il parametro più vicino. Se la curva di input è una PolyCurve, questa funzione restituirà un parametro valido solo se il punto si trova sulla PolyCurve. Per altri tipi di curva questa funzione restituirà il parametro lungo la curva che si trova nel punto più vicino al punto di input.
point: Un punto su o in prossimità della curva
Returns: Parametro sulla curva per PolyCurve o il parametro più vicino lungo la curva per altri tipi di curva.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.DivideEqually(System.Int32)
Suddivide una curva in un numero dato di curve della stessa lunghezza
divisions: Numero di divisioni
Returns: Una serie di curve dopo la divisione
chopcurve,segment,slices

Autodesk.DesignScript.Geometry.Curve.DivideByDistance(System.Int32)
Suddivide una curva in un numero dato di curve con distanze uguali tra l'inizio e la fine di ciascuna curva (corde uguali).
divisions: Numero di divisioni
Returns: Una serie di curve dopo la divisione
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByLengthFromParameter(System.Double,System.Double)
Suddivide una curva in curve di una data lunghezza misurata dalla pozione specificata del parametro
length: Lunghezza di curve dopo la divisione
parameter: Posizione parametro per la misurazione da
Returns: Serie di curve dopo la divisione
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByDistanceFromParameter(System.Double,System.Double)
Suddivide una curva in curve di una data lunghezza asta misurata dalla posizione specificata del parametro
distance: Lunghezza dell'asta di ogni curva ottenuta dalla divisione
parameter: Posizione parametro per la misurazione da
Returns: Una serie di curve dopo la divisione
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimStart(System.Double)
Rimuove l'inizio della curva in corrispondenza del parametro specificato
startParameter: Il parametro in corrispondenza del quale iniziare il taglio
Returns: Una nuova curva il cui punto iniziale è stato rimosso
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimEnd(System.Double)
Rimuove la fine della curva in corrispondenza del parametro specificato
endParameter: Il parametro in corrispondenza del quale iniziare il taglio
Returns: Una nuova curva il cui punto finale è stato rimosso
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrim(System.Double,System.Double)
Rimuove l'inizio e la fine della curva in corrispondenza dei parametri specificati.
startParameter: Il parametro in corrispondenza del quale iniziare il taglio
endParameter: Il parametro in corrispondenza del quale iniziare il taglio
Returns: Una nuova curva i cui segmenti esterni sono stati rimossi
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.ParameterTrimInterior(System.Double,System.Double)
Rimuove la parte interna di una curva in corrispondenza dei parametri specificati
startParameter: Il parametro in corrispondenza del quale iniziare il taglio
endParameter: Il parametro in corrispondenza del quale iniziare il taglio
Returns: Una nuova curva il cui segmento interno è stato rimosso
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimSegments(System.Double[])
Rimuove più segmenti della curva, eliminando il primo, terzo, quinto... segmento
parameters: Un elenco di parametri in corrispondenza dei quali dividere la curva
Returns: Una serie di curve in cui sono stati eliminati il primo, terzo, quinto... segmento
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
Rimuove più segmenti della curva, eliminando il secondo, il quarto, il sesto segmento e così via se il valore booleano è true
parameters: Un elenco di parametri in base al quale dividere la curva
discardEvenSegments: Attivare/Disattivare per eliminare anche i segmenti
Returns: Una serie di curve che eliminano il secondo, il quarto, il sesto ... segmento se il valore booleano è true
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double)
Divide una curva in due parti in corrispondenza del parametro specificato
parameter: Il parametro in corrispondenza del quale eseguire la divisione
Returns: Due curve rimanenti dopo la divisione
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double)
Dividere una curva in due parti in corrispondenza del parametro specificato
parameter: Il parametro in corrispondenza del quale eseguire la divisione
Returns: Due curve rimanenti dopo la divisione
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double[])
Dividere una curva in più parti in corrispondenza dei parametri specificati
parameters: Un elenco di parametri in corrispondenza dei quali dividere la curva
Returns: Curve create dalla divisione
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(Autodesk.DesignScript.Geometry.Curve)
Unisce la curva corrente e la curva di input in una nuova PolyCurve, mantenendo invariate le curve originali.
curve: La curva da unire a
Returns: PolyCurve costituita da due curve
convertcurve,curve2polycurve,joincurve,concat

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
Estende una curva per una distanza data fino ad un'estremità specifica determinata da un punto di selezione. Il lato selezionato viene esteso. Le curve chiuse quali cerchi ed ellissi non possono essere estese.
distance: Distanza da estendere
pickSide: Un punto sull'estremità da estendere
Returns: La curva estesa
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
Estende la parte iniziale di una curva per la distanza data. Le curve chiuse quali cerchi ed ellissi non possono essere estese.
distance: Distanza da estendere
Returns: La curva estesa
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
Estende la parte finale di una curva per la distanza data. Le curve chiuse quali cerchi ed ellissi non possono essere estese.
distance: Distanza da estendere
Returns: La curva estesa
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Proietta una curva di input lungo una direzione di proiezione data su una geometria di base specificata. Geometria per proiettare ontoVectorList di geometrie proiettate sulla geometria di base