Autodesk.DesignScript.Geometry.PolySurface.ToString
Ottiene una rappresentazione stringa di PolySurface

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Crea una PolySurface mediante l'estrusione su percorso di una curva lungo una guida.
rail: Curva lungo cui eseguire lo sweep
profile: Profilo di sweep
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Individua superfici mediante un punto. Assume la prima intersezione in avanti. Restituisce una superficie se incontra l'interno di una superficie, due superfici se incontra l'interno di uno spigolo e molte superfici se incontra un vertice
surfacesatpoint,findsurfaces,extractsurfaces