Autodesk.DesignScript.Geometry.UV.ToString
Ottiene una rappresentazione stringa di UV

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
Confronta due elementi UV
other: L'altro elemento UV
Returns: Indica se i due oggetti sono uguali

Autodesk.DesignScript.Geometry.UV.GetHashCode
Ottiene un hashcode per il tipo
Returns: Hashcode univoco per l'oggetto corrente