Autodesk.DesignScript.Geometry.Rectangle.ToString
Ottiene una rappresentazione stringa del rettangolo

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Crea un rettangolo centrato nell'origine WCS nel piano XY WCS specificato, con larghezza (lunghezza asse X) e lunghezza (lunghezza asse Y) specificate.
width: Larghezza del rettangolo
length: Lunghezza del rettangolo
Returns: Rettangolo creato da larghezza e lunghezza
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Crea un rettangolo centrato nel punto di origine del piano di input, con larghezza (lunghezza asse X del piano) e lunghezza (lunghezza asse Y del piano) di input.
plane: Piano utilizzato per centrare il rettangolo
width: Larghezza del rettangolo
length: Lunghezza del rettangolo
Returns: Rettangolo creato da larghezza e lunghezza
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crea un rettangolo centrato nell'origine di input del piano XY del sistema di coordinate, con larghezza (lunghezza asse X) e lunghezza (lunghezza asse Y) specificate.
coordinateSystem: Sistema di coordinate del rettangolo (centro del rettangolo)
width: Larghezza del rettangolo
length: Lunghezza del rettangolo
Returns: Rettangolo creato da larghezza e lunghezza
rectbylengths