Autodesk.DesignScript.Geometry.EllipseArc.ToString
Ottiene una rappresentazione stringa di EllipseArc

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiStartAngleSweepAngle(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Creare un EllipseArc in un piano con i raggi dati lungo gli assi X e Y e gli angoli per l'estrusione su percorso
plane: Il piano in cui è contenuto EllipseArc
xRadius: Il raggio di EllipseArc nella direzione X del piano
yRadius: Il raggio di EllipseArc nella direzione Y del piano
startAngle: L'angolo iniziale dell'arco misurato dall'asse x positivo del piano di input
sweepAngle: L'angolo da cui eseguire lo sweep dall'angolo iniziale in gradi
ellipsearc,arcs