Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
Meccanismo di registrazione del tipo di geometria.
hostType: Tipo di interfacce derivate da IGeometryEntity.
contructor: Elemento delegato per la costruzione della geometria.

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
Applica la traslazione alla geometria nella direzione indicata, in base alla lunghezza del vettore
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Applica la traslazione a qualsiasi tipo di geometria, con la distanza e la direzione specificate.
direction: Direzione di spostamento.
distance: Distanza di spostamento lungo la direzione data.
Returns: Geometria trasformata.
move,along vector,distance

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Trasforma la geometria in base alla trasformazione specificata del CoordinateSystem
Returns: Geometria trasformata

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Trasforma la geometria da un CoordinateSystem di origine a un nuovo CoordinateSystem contestuale.
Returns: Geometria trasformata.
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Ruota un oggetto di un numero di gradi specificato intorno ad un'origine e ad un asse
around,axis,degrees

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Ruota un oggetto di un numero di gradi specificato intorno all'origine del piano e alla normale
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
Adatta in scala intorno all'origine in modo non uniforme
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Adatta in scala intorno ad un determinato piano in modo non uniforme
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Applica la scala in modo uniforme intorno ad un punto dato, utilizzando come valori scalari due punti di selezione
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Applica la scala in una quota, tramite una base e 2 punti di selezione. L'asse di scalatura è definito dalla linea tra la base e tale punto.
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Applica la scala in due dimensioni, tramite una base e due punti di selezione. I due punti di selezione vengono proiettati sul piano della base, al fine di determinare i fattori della seconda scala
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
Restituisce la distanza tra la geometria corrente e un'altra geometria
other: Altra geometria
Returns: Distanza
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
Restituisce il punto della geometria corrente più vicino all'altra geometria
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
Determina se un altro oggetto di geometria interseca l'oggetto corrente
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
Ottiene la geometria di intersezione per l'oggetto corrente e un altro oggetto
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Ottiene la geometria di intersezione per l'oggetto corrente e una raccolta di altre geometrie. Rileva la geometria comune a tutti i membri.
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
Divide la geometria corrente utilizzando un'altra geometria come strumento di taglio
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
Verifica se i due oggetti dispongono della stessa geometria di rappresentazione o degli stessi valori numerici
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
Ottiene il BoundingBox contenente l'elemento di geometria dato
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
Converti geometria in JSON def solida
Returns: Stringa formatatta JSON

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
Esporta la geometria specificata nel file SAT presente nel percorso dato
filePath: Nome del file nel quale esportare la geometria

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
Esporta la geometria specificata nel file SAT presente nel percorso dato
filePath: Nome del file nel quale esportare la geometria
unitsMM: Le unità di misura da utilizzare

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String,System.Double)
Esporta un elenco di geometria specificata nel percorso del file SAT dato

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
Serializza la geometria specificata in formato Standard ACIS Binary (SAB) e restituisce dati di flusso binari serializzati

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
Ottiene il sistema di coordinate di contesto/riferimento utilizzato per creare la geometria corrente.