Autodesk.DesignScript.Geometry.IndexGroup.ToString
Ottiene una rappresentazione stringa di IndexGroup

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
Confronta due IndexGroup
other: L'altro IndexGroup
Returns: Indica se i due oggetti sono uguali

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
Ottiene un hashcode per il tipo
Returns: Hashcode univoco per l'oggetto corrente

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Crea un IndexGroup che memorizza tre indici
a: Indice a
b: Indice b
c: Indice c
Returns: IndexGroup
tri,polygon,mesh,meshes