Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
Ottiene una rappresentazione stringa di CoordinateSystem

Autodesk.DesignScript.Geometry.CoordinateSystem.Identity
Crea un CoordinateSystem come sistema di coordinate globali (WCS): origine 0, 0, 0; asse X 1, 0, 0; asse Y 0, 1, 0; asse Z 0, 0, 1
zero,wcs

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
Crea un CoordinateSystem con origine nel punto di input. Gli assi X e Y sono impostati come assi WCS X e Y.
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByPlane(Autodesk.DesignScript.Geometry.Plane)
Crea un CoordinateSystem con origine coincidente con quella del piano di input. Gli assi X e Y si trovano sul piano e sono allineati con gli assi X e Y del piano stesso.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crea un CoordinateSystem in corrispondenza dell'origine con gli assi X e Y. I vettori di input vengono normalizzati prima della creazione del CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crea un CoordinateSystem in corrispondenza dell'origine con gli assi X e Y. L'asse Z viene ignorato completamente. I vettori di input vengono normalizzati prima della creazione del CoordinateSystem.
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Crea un CoordinateSystem in corrispondenza dei parametri di coordinata cilindrica, rispetto al sistema di coordinate specificato

Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Crea un CoordinateSystem in corrispondenza dei parametri di coordinata sferica, rispetto al sistema di coordinate specificato

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
Determina se è possibile ottenere l'inverso del CoordinateSystem corrente
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
Verifica se la scalatura è ortogonale, ovvero se dispone di un componente di taglio.
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
Verifica se la scalatura è ortogonale e se tutti i vettori sono normalizzati.
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
Crea un punto che rappresenta l'origine del CoordinateSystem.
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
Restituisce l'asse X del CoordinateSystem.
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
Restituisce l'asse Y del CoordinateSystem.
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
Restituisce l'asse Z del CoordinateSystem.
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
Restituisce la scala dell'asse X del CoordinateSystem: la lunghezza del vettore dell'asse X.

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
Restituisce la scala dell'asse Y del CoordinateSystem: la lunghezza del vettore dell'asse Y.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
Restituisce la scala dell'asse Z del CoordinateSystem: la lunghezza del vettore dell'asse Z.

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
Ottiene l'inverso del CoordinateSystem corrente. Se si applica questo CoordinateSystem ad un elemento di geometria, l'originale viene invertito.

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Applica l'argomento CoordinateSystem dopo l'argomento corrente - Risultato = argomento corrente * altro argomento

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Applica l'argomento CoordinateSystem prima dell'argomento corrente - Risultato = altro argomento * argomento corrente

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
Restituisce un vettore contenente i fattori di scala X, Y e Z
Returns: Vettore in scala
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
Determina se due sistemi di coordinate sono uguali
other: Altro sistema di coordinate
Returns: Restituisce true se i sistemi di coordinate sono uguali

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
Applica la traslazione al CoordinateSystem dato, in base ai valori di spostamento nelle direzioni X, Y e Z definiti nel sistema di coordinate globali (WCS).
xTranslation: Spostamento lungo l'asse X.
yTranslation: Spostamento lungo l'asse Y.
zTranslation: Spostamento lungo l'asse Z.
Returns: CoordinateSystem trasformato.
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
Applica la traslazione all'oggetto in base alla direzione e all'intensità del vettore di input.
direction: Vettore per direzione di traslazione
Returns: Sistema di coordinate traslato
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Applica la traslazione a qualsiasi tipo di CoordinateSystem, con la distanza e la direzione specificate.
direction: Vettore della direzione di spostamento
distance: Distanza di spostamento lungo la direzione specificata
Returns: Sistema di coordinate traslato
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Trasforma il CoordinateSystem corrente da un CoordinateSystem di origine ad un nuovo CoordinateSystem contestuale.
Returns: CoordinateSystem trasformato.

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Ruota un oggetto di un numero di gradi specificato attorno ad un'origine e ad un asse
origin: Punto di origine
axis: Asse vettoriale per la rotazione
degrees: Gradi da ruotare
Returns: Sistema di coordinate ruotato
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Consente di ruotare un oggetto intorno all'origine e alla perpendicolare di un dato piano di un
grado specificato
plane: Piano da cui ottenere la normale
degrees: Valore di rotazione in gradi
Returns: Sistema di coordinate ruotato
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
Adatta in scala intorno all'origine in modo uniforme
amount: Valore di scala
Returns: Sistema di coordinate in scala
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
Adatta in scala intorno all'origine in modo non uniforme
xamount: Valore di scala nell'asse X
yamount: Valore di scala nell'asse Y
zamount: Valore di scala nell'asse Z
Returns: Sistema di coordinate in scala
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Adatta in scala intorno ad un determinato piano in modo non uniforme
plane: Piano attorno a cui adattare in scala
xamount: Valore di scala nell'asse X
yamount: Valore di scala nell'asse Y
zamount: Valore di scala nell'asse Z
Returns: Sistema di coordinate in scala
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Adatta in scala intorno ad un determinato punto in modo uniforme
basePoint: Punto base di scala
from: Punto iniziale da cui adattare in scala
to: Punto finale fino a cui adattare in scala
Returns: Sistema di coordinate in scala
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Applica la scala in una dimensione utilizzando un punto base, un punto iniziale (di partenza) e un punto finale (di arrivo). L'asse di scala è definito dalla linea tra il punto base e il punto iniziale.
basePoint: Punto base di scala
from: Punto iniziale da cui adattare in scala
to: Punto finale fino a cui adattare in scala
Returns: Sistema di coordinate in scala
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Applica la scala in due dimensioni, tramite una base e due punti di selezione. I due punti di selezione vengono proiettati sul piano della base, al fine di determinare i fattori della seconda scala
basePlane: Punto base di scala
from: Punto iniziale da cui adattare in scala
to: Punto finale fino a cui adattare in scala
Returns: Sistema di coordinate in scala
resize,size,from,to,scale2d,2d