DSCore.DummyPythonEvaluator
評価時のエラーのみをスローする Python エバリュエータです。
主に実際の Python エバリュエータが見つからなかったことを示すために使用されます。

DSCore.DummyPythonEvaluator.Evaluate(System.String,System.Collections.IList,System.Collections.IList)
割り当てられたメッセージを含む例外をスローします