DSCore.List.IndexOf(System.Collections.IList,System.Object)
指定されたリスト内の要素のインデックスを返します。指定されたリストとターゲット要素は正確に一致している必要があります(すなわち、整数と整数、倍精度浮動小数点数と倍精度浮動小数点数、文字列と文字列、オブジェクトとオブジェクトなど)
list: 検索対象の要素が含まれているリスト。
element: 返されるインデックスを持つ要素。
リスト内の要素のインデックス。正確な一致が見つからない場合は、無効なインデックス -1 を返します。
index,indexof