Autodesk.DesignScript.Geometry.Plane.ToString
平面の文字列表現を取得します

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
指定された基準点に配置され、指定されたベクトル法線を持ち、指定された X 軸で方向付けられた平面を作成します。この X 軸によって分割、交差、投影などの操作に影響が生じることはなく、単に入力座標系の方向が指定されます。
origin: 平面の原点
normal: 法線方向ベクトル
xAxis: X 軸方向ベクトル
Returns: 原点法線と X 軸による平面

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
入力された線分と外部の点を含む平面を作成します。点を線分上または線分軸内に配置することはできません。
line: 平面の決定に使用する線分
point: 平面の決定に使用する点
Returns: 線分と点から作成した平面
lines
0.4

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
この平面を表す新しい座標系を作成します。基準点、X 軸、Y 軸を基準にします。
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
法線方向のこの平面を使用し、距離を指定して新しい平面オフセットを作成します。
alongnormal,moveplane