Autodesk.DesignScript.Geometry.Vector.ToString
ベクトルの文字列表現を取得します

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
2 つのベクトルを比較
other: 他のベクトル
Returns: 2 つのオブジェクトが等しいかどうか

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
このタイプのハッシュ値を取得します
Returns: このオブジェクトのユニークなハッシュ値

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
3 つのユークリッド座標でベクトルを形成します。
x: X 座標
y: Y 座標
z: Z 座標
Returns: 座標で作成したベクトル
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
3 つのユークリッド座標でベクトルを形成し、ベクトルを正規化します。
x: X 座標
y: Y 座標
z: Z 座標
normalized: ベクトルを正規化する場合は true、正規化しない場合は false
Returns: 座標で作成したベクトル
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
2 つの端点からベクトルを作成します。結果は始点から終点までのベクトルになります。
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
基底 X 軸ベクトル(1,0,0)を取得します
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
基底 Y 軸ベクトル(0,1,0)を取得します
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
基底 Z 軸ベクトル(0,0,1)を取得します
z,basis,up

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
2 つのベクトルの内積を形成します
vec: 2 番目のベクトル
Returns: 結果の内積
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
2 つのベクトルが平行かどうかを判断します。
otherVector: もう一方のベクトル
Returns: ベクトルが平行の場合は True を返し、平行ではない場合は False を返します。

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
2 つのベクトルがほぼ等しいかどうかを判断します。精度の問題を処理するために、許容差の値 1e-5 が指定されています。
otherVector: もう一方のベクトル
Returns: ベクトルがほぼ等しい場合は True を返し、それ以外の場合は False を返します。
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
このベクトルを入力された座標系マトリックスによって変換します。
coordinateSystem: ベクトルの変換に使用する座標系
Returns: 変換されたベクトル

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
角度を指定し、軸を中心にベクトルを回転します
axis: 回転軸ベクトル
degrees: 回転する角度の数値
Returns: 回転ベクトル
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
角度を指定し、平面の基準点と法線を中心にベクトルを回転します
plane: 回転平面
degrees: 回転する角度の数値
Returns: 回転ベクトル
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
基準点を中心にベクトルを均等に調整します
scale_factor: スケール係数
Returns: スケール変更後のベクトル
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
0 ～ 180 度の範囲で、2 つのベクトル間の角度を返します。
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
0 ～ 360 度の範囲で、2 つのベクトル間の角度を返します。角度の方向の決定には回転軸が使用されます。
otherVector: もう一方のベクトル
rotationAxis: 回転軸
Returns: 指定されたベクトル間の角度を 0 ~ 360 度の範囲で返します
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
0 ～ 360 度の範囲で、2 つのベクトル間の角度を返します。角度の方向の決定には回転軸が使用されます。
rotation angle