Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
Geometry Type の登録メカニズム。
hostType: IGeometryEntity 派生インタフェースのタイプ。
contructor: Geometry を作成するための代理。

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
ベクトルの長さによって方向を指定して、ジオメトリを変換します
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
指定した方向に距離を指定して、ジオメトリのタイプを変換
します。
direction: 変位の向き。
distance: 指定した向きに沿った変位距離。
Returns: 変換後の Geometry。
move,along vector,distance

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
CoordinateSystem の変換を指定して、ジオメトリを変換します
Returns: 変換後のジオメトリ

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
このジオメトリをソースの CoordinateSystem から新しいコンテキストの
CoordinateSystem に変換します。
Returns: 変換後の Geometry。
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
角度を指定し、基準点と軸を中心にオブジェクトを回転します
around,axis,degrees

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
平面の基準点と法線を中心にオブジェクトを指定された角度だけ回転させます。
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
基準点を中心に不均等にスケール
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
指定した Plane を中心に不均等にスケール
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
2 つの選択点をスカラーとして使用し、指定した点を中心に均等にスケール
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
基準点と 2 つの選択点によって 1 次元にスケールします。スケーリング軸は基準点と始点間の線分によって設定されます。
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
基準点と 2 つの選択点によって 2 次元にスケールします。2 次元のスケール係数を判断するために、2 つの選択点が基本平面に投影されます
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
このジオメトリから別のジオメトリへの距離を取得します。
other: 他のジオメトリ
Returns: 距離
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
この Geometry 上の Point で、他の Geometry の Point に最も近いものを取得
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
別の Geometry オブジェクトがこのオブジェクトと交差するかどうかを判断します
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
このオブジェクトと別のオブジェクトの交点 Geometry を取得
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
このオブジェクトの Geometry の交点と別の Geometry の集合の交点を取得します。その中から共通のジオメトリを求めます。
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
別の Geometry を切り取り「ツール」として使用してこの Geometry を分割
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
2 つのオブジェクトが同じ表現ジオメトリまたは数値を持っているかどうかを確認します
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
指定した Geometry の一部を含む BoundingBox を取得
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
ジオメトリを Solid Def JSON 形式に変換
Returns: JSON 形式の文字列

Autodesk.DesignScript.Geometry.Geometry.FromSolidDef(System.String)
JSON 文字列を読み込み、読み込んだジオ メトリの配列を返します。
solidDefJson: Solid Def を含む JSON 文字列形式のジオ メトリ
Returns: 変換されたジオメトリのリスト

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
指定したジオメトリを指定した SAT ファイル パスに書き出します
filePath: ジオメトリの書き出し先のファイル名

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
指定したジオメトリを指定した SAT ファイル パスに書き出します
filePath: ジオメトリの書き出し先のファイル名
unitsMM: 使用する単位

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String,System.Double)
指定したジオメトリのリストを指定した SAT ファイル パスに書き出します

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
指定したジオメトリを標準 ACIS バイナリ(SAB)形式にシリアル化し、シリアル化されたバイナリ ストリーム データを返します

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
このジオメトリを作成するために使用したコンテキスト/参照座標系を取得します。