Autodesk.DesignScript.Geometry.UV.ToString
UV の文字列表現を取得します

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
2 つの UV を比較します
other: 他の UV
Returns: 2 つのオブジェクトが等しいかどうか

Autodesk.DesignScript.Geometry.UV.GetHashCode
このタイプのハッシュ値を取得します
Returns: このオブジェクトのユニークなハッシュ値