Autodesk.DesignScript.Geometry.Edge.ToString
エッジの文字列表現を取得します

Autodesk.DesignScript.Geometry.Edge.CurveGeometry
エッジ作成の基準とする曲線

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
このエッジに接する面

Autodesk.DesignScript.Geometry.Edge.StartVertex
このエッジの始端の頂点

Autodesk.DesignScript.Geometry.Edge.EndVertex
このエッジの終端の頂点