Autodesk.DesignScript.Geometry.Surface.ToString
サーフェスの文字列表現を取得します

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
サーフェスの集合を 1 つのサーフェスにまとめます。まとめた結果が非多様体または複数の面を持つ場合、この方法はポリサーフェスを返します。
surfaces: サーフェスの集合です。
Returns: サーフェスの和
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
入力された断面曲線間をロフトしてサーフェスを作成します。
crossSections: ロフトで通過する曲線
Returns: ロフトで作成したサーフェス
loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
入力された断面線分間のロフトによりサーフェスを作成します。これにより、Surface.ByLoft よりも短時間で、若干粗い結果が生成されます。
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
ガイド曲線(レール)を指定し、断面にサーフェスをロフトします。ガイド曲線は、断面のすべての曲線と交差する必要があります。
loftbyrail

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
ガイド曲線(レール)を指定し、断面にサーフェスをロフトします。ガイド曲線は、断面のすべての曲線と交差する必要があります。
crossSections: ロフトで通過する曲線
guideCurves: ロフトの通過をガイドする曲線
Returns: ロフトで作成したサーフェス
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
断面曲線をパスに沿ってスイープすることにより、サーフェスを作成します。
profile: スイープする曲線
path: スイープに使用するパス曲線
Returns: パスに沿ってプロファイルをスイープして作成したサーフェス
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
閉じた ポリゴン内の入力された点群をつなぐポリゴン サーフェスを作成します。
points: ペリメータ点群のリスト
Returns: ペリメータ点群から作成したサーフェス
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
基準点によって形成される軸の配列要素を中心に、プロファイル曲線を軸ベクトルの向きにスイープすることにより、サーフェスを作成します。開始角度 startAngle から開始し、スイープ角度 sweepAngle までスイープします。
profile: 回転するプロファイル曲線
axisOrigin: 回転軸原点
axisDirection: 回転軸方向
startAngle: 開始角(度単位)
sweepAngle: スイープ角度(度単位)
Returns: プロファイルを回転して作成したサーフェス
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
入力された曲線で設定される閉じた境界の内部を塗り潰してサーフェスを作成します。
closedCurve: サーフェス境界として使用する閉じた曲線
Returns: パッチで作成したサーフェス
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
このサーフェスと、入力されたサーフェスの和のブール演算差です。ブール演算の結果が非多様体または複数の面を持つ場合、この方法はポリサーフェスを返します。
others: 減算するもう一方のサーフェス
Returns: ブール演算後のサーフェスまたはポリサーフェス
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
サーフェスを、入力サーフェス内の 1 つまたは複数のループの集合でトリムします。その中の 1 つのループを入力サーフェスの境界ループにする必要があります。また、穴には 1 つまたは複数の内側のループを追加する必要があります。
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
サーフェスの Nurbs 表現を取得します。特定の状況では、このメソッドは近似のサーフェスを取得します。

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
指定した許容値内でサーフェスの Nurbs 表現を取得します。特定の状況では、このメソッドは近似のサーフェスを取得します。
tolerance: 指定公差
Returns: サーフェスの NURBS サーフェス表示
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
サーフェスに厚みを持たせてソリッドを作成します。サーフェスを法線の方向に両側に押し出します。
thickness: 厚み付け量
Returns: ソリッドとして厚みを付けたサーフェス
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
サーフェスに厚みを持たせてソリッドを作成します。サーフェスを法線の方向に押し出します。both_sides パラメータが true の場合は、サーフェスの厚さが両側に設定されます。
thickness: 厚み付け量
both_sides: True の場合は両側に、False の場合は片側に厚み付けします
Returns: ソリッドとして厚みを付けたサーフェス
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
返される座標系では、uDir、vDir、法線を表すのに xAxis、yAxis、zAxis を使用します。xAxis、yAxis の長さが曲率を表します。
u: パラメータの U コンポーネント
v: パラメータの V コンポーネント
Returns: サーフェス上の UV 位置の法線、U 方向、V 方向に基づく座標系

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
指定したサーフェスにパラメータ線分の曲線を作成します。サーフェスに U および V パラメータ線分を表す曲線を作成します。パラメータ線分は U または V パラメータが増加する方向に向き、U または V パラメータと逆の割合で増加していきます。作成される曲線は、サーフェスのパラメータ設定に一致し、その範囲はサーフェス パラメータの範囲に限定されます。返される曲線のタイプはサーフェスのタイプによって異なります。
isoDirection: direction == 0 の場合は U パラメータ線分が作成され、direction == 1 の場合は V パラメータ線分が作成されます。
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
法線を反転させた新しいサーフェスを返します。このサーフェスは変更されません。
Returns: サーフェス。入力サーフェスと同じですが、法線が反転されます

Autodesk.DesignScript.Geometry.Surface.Join(Autodesk.DesignScript.Geometry.Surface)
このサーフェスと入力されたサーフェスを組み合わせてポリサーフェスを作成します
topolysurface

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
このサーフェスと入力されたサーフェスをポリサーフェスに組み合わせます
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
入力されたジオメトリを、入力されたベクトルの方向で、このサーフェス上に投影します。!!現在この投影方法では、点または曲線のみがサポートされています!!
projecttosurface,projectonto