Autodesk.DesignScript.Geometry.Point.ToString
点の文字列表現を取得します

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
2 つの点を比較します
other: 他の点
Returns: 2 つのオブジェクトが等しいかどうか

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
このタイプのハッシュ値を取得します
Returns: このオブジェクトのユニークなハッシュ値

Autodesk.DesignScript.Geometry.Point.Origin
基準点(0,0,0)を取得
Returns: 原点
zero,origin