Autodesk.DesignScript.Geometry.Solid.ToString
ソリッドの文字列表現を取得します

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
曲線に補助的なガイドを付け、入力された断面の閉じた曲線間のロフトによってソリッドを作成します。ガイド曲線はすべての断面曲線と交差する必要があります。
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
曲線に補助的なガイドを付け、入力された断面の閉じた曲線間のロフトによってソリッドを作成します。ガイド曲線はすべての断面曲線と交差する必要があります。
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
閉じたポリカーブを含む入力断面間のロフトによりソリッドを作成します。この操作は、線分セグメントのみで頂点が同じ順序となるように構成されている断面に最適化されています。確認と修復のオプションを有効にすると、生成されるソリッドの有効性が保証され、無効にすると、パフォーマンスが向上します。
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
原点と軸ベクトルによって形成される軸放射線を中心に、開始角度からスイープ角度までプロファイル曲線をスイープして、回転ソリッドを作成します。
profile: 回転するプロファイル曲線
axisOrigin: 回転軸原点
axisDirection: 回転軸方向
startAngle: 開始角(度単位)
sweepAngle: スイープ角度(度単位)
Returns: 回転で作成したソリッド
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
ソリッドのリストとこのソリッドの和
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
このソリッドと別のソリッドのブール演算差

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
このソリッドの面からソリッド シェルを取得します
internalFaceThickness: シェルの内側を延長する距離
externalFaceThickness: シェルの外側を延長する距離
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
入力されたジオメトリを、入力されたベクトルの方向で、このソリッド上に投影します。!!現在この投影方法では、点または曲線のみがサポートされています!!
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
ソリッドが複数の未結合ソリッドで構成されている場合は、個々のソリッドに分割します。単一の隣接ソリッドの場合は、同じソリッドを返します。
Returns: 分割された未結合ソリッド
split,disjoint