Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
座標系の文字列表現を取得します

Autodesk.DesignScript.Geometry.CoordinateSystem.Identity
座標系をワールド座標系として作成します。基準点は
0, 0, 0、x 軸は 1, 0, 0、y 軸は 0, 1, 0、z 軸は 0, 0, 1 です
zero,wcs

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
入力点に基準点を持ち、X 軸と Y 軸を WCS(ワールド座標系)の
X 軸および Y 軸に設定した座標系を作成します。
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByPlane(Autodesk.DesignScript.Geometry.Plane)
基準点が入力平面の基準点と同じで、X 軸と Y 軸が平面上に存在し、
平面 X と Y 軸が位置合わせされた座標系を作成します。

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
X 軸と Y 軸に基準点を持つ座標系を作成します。
入力ベクトルは座標系を作成する前に正規化されます。

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
X 軸、Y 軸、Z 軸を完全に無視した基準点に座標系を
作成します。入力ベクトルは座標系を作成する前に
正規化されます。
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
指定された座標系に対して、指定された円柱座標パラメータに基づいて座標系を作成します。

Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
指定した座標系に対して球座標パラメータを指定して 座標系を作成します

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
この座標系の反転を取得することができるかどうかを判断します
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
スケーリングが直行しているかどうか、つまり、剪断コンポーネントを持っているかどうかをテストします。
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
スケーリングが直行しているかどうか、すべてのベクトルが正規化されているかどうかをテストします。
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
座標系の基準点を表す点を作成します。
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
座標系の X 軸を返します。
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
座標系の Y 軸を返します。
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
座標系の Z 軸を返します。
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
座標系の X 軸のスケーリングを返します。X 軸ベクトルの長さになります。

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
座標系の Y 軸のスケーリングを返します。Y 軸ベクトルの長さになります。

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
座標系の Z 軸のスケーリングを返します。Z 軸ベクトルの長さになります。

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
この座標系の反転を取得します。基準点を反転するジオメトリの一部にこの座標系を適用します。

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
この引数の後に引数 CoordinateSystem を適用します。結果 = この引数 * 他の引数

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
この引数の前に引数 CoordinateSystem を適用します。結果 = 他の引数 * この引数

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
X、Y、Z スケール係数を含む Vector を返します。
Returns: スケール変更後のベクトル
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
2 つの CoordinateSystem が等しいかどうかを判断
other: もう一方の座標系
Returns: 座標系が等しい場合は true を返します

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
WCS でそれぞれ設定したX、Y、Z 方向の変位を指定して、指定した座標系
を変換します。
xTranslation: X 軸に沿った変位。
yTranslation: Y 軸に沿った変位。
zTranslation: Z 軸に沿った変位。
Returns: 変換後の座標系。
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
入力 Vector の方向と大きさでオブジェクトを変換します。
direction: 変換の方向を示すベクトル
Returns: 変換後の座標系
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
指定した方向に距離を指定して、CoordinateSystem のタイプを変換
します。
direction: 変位の向きを示すベクトル
distance: 指定した向きに沿った変位距離
Returns: 変換後の座標系
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
この座標系をソースの座標系から新しいコンテキストの
座標系に変換します。
Returns: 変換後の座標系。

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
角度を指定し、原点と軸を中心にオブジェクトを回転します
origin: 原点
axis: 回転のベクトル軸
degrees: 回転角度
Returns: 回転後の座標系
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
指定された平面の基準点と法線を中心として、指定された角度でオブジェクトを回転します。
plane: 法線の取得元となる平面
degrees: 回転の値(度単位)
Returns: 回転後の座標系
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
基準点を中心に均等にスケール
amount: スケールを変更する量
Returns: スケール変更後の座標系
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
基準点を中心に不均等にスケール
xamount: X 軸方向のスケールを変更する量
yamount: Y 軸方向のスケールを変更する量
zamount: Z 軸方向のスケールを変更する量
Returns: スケール変更後の座標系
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
指定した Plane を中心に不均等にスケール
plane: スケール変更の中心となる平面
xamount: X 軸方向のスケールを変更する量
yamount: Y 軸方向のスケールを変更する量
zamount: Z 軸方向のスケールを変更する量
Returns: スケール変更後の座標系
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
次の項目を使用し、指定した点を中心に均等にスケール
basePoint: スケール変更の基準点
from: スケール変更元の点
to: スケール変更先の点
Returns: スケール変更後の座標系
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
基準点、開始点(変更元)、終了点(変更先)を使用して 1 次元にスケールします。スケーリング軸は基準点と開始点間の線分によって設定されます。
basePoint: スケール変更の基準点
from: スケール変更元の点
to: スケール変更先の点
Returns: スケール変更後の座標系
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
基準点と 2 つの選択点によって 2 次元にスケールします。2 次元のスケール係数を判断するために、2 つの選択点が基本平面に投影されます
basePlane: スケール変更の基準点
from: スケール変更元の点
to: スケール変更先の点
Returns: スケール変更後の座標系
resize,size,from,to,scale2d,2d