Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
TSplineReflection の文字列表現を取得します

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
入力されたセグメント数と各セグメントのペア間の角度を持つ指定された平面により、放射状の反射を作成します。
plane: 法線が T スプラインの放射状の反射の軸になる平面。ワールド座標系で指定します。
segmentsCount: 放射状の反射のセグメントの数
segmentAngle: 放射相称の各ペア間の角度。この角度を 0 に設定すると、(360 / segmentsCount)という計算式によって角度が計算されます。
Returns: T スプラインの放射状の反射
tspline,symmetry,reflection,radial