Autodesk.DesignScript.Geometry.BoundingBox.ToString
BoundingBox の文字列表現を取得します

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
2 つの BoundingBox を比較します
other: その他の BoundingBox
Returns: 2 つのオブジェクトが等しいかどうか

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
このタイプのハッシュ値を取得します
Returns: このオブジェクトのユニークなハッシュ値

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
入力されたジオメトリの周囲に、軸に位置合わせされ境界ボックスを作成します。
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
入力されたジオメトリの周囲に、軸に位置合わせされていない BoundingBox を作成します。その向きは入力された座標系の X 軸、Y 軸、Z 軸に設定されます。
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
入力されたジオメトリの周囲に、軸に位置合わせされていない BoundingBox を作成します。その向きは入力された座標系の X 軸、Y 軸、Z 軸に設定されます。
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
最小の座標(ボックスの左下後ろコーナー)から最大座標(ボックスの右上前コーナー)までの BoundingBox を作成します。CoordinateSystem は、ボックスの座標スペースからモデル スペースに変換されます。このメソッドは Revit の API に一致するように設計されており、変換することなく、Revit BoundingBox からパラメータを抽出できます。
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
この BoundingBox を定義する座標系

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
2 つの BoundingBox の交点を取得します
other: 交差するその他の境界ボックス
Returns: 境界ボックスの交差から取得された境界ボックス

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
2 つの BoundingBox が交差しているかどうかを判断します
other: その他の境界ボックス
Returns: 境界ボックスの交差を実行する
get overlap