Autodesk.DesignScript.Geometry.Line.ToString
線分の文字列表現を取得します

Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
入力された曲線に接し、曲線のパラメータで指定された点に位置する直線を作成します。
curve: 接線のベース曲線
parameter: パラメータ値
Returns: 接線
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
開始点から始まり、ベクトルの向きに指定された長さだけ延長する線分を作成します。
startPoint: 線分の始点
direction: 方向ベクトル
length: 線分の長さ
Returns: 開始方向と長さによる線分
linebyvector,lines