Autodesk.DesignScript.Geometry.Cone.ToString
円錐の文字列表現を取得します

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
始点の基本半径を指定し、終点の頂点まで延長した円錐を作成します。
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
始点と終点に軸を持ち、始点と終点の半径を指定した円錐を作成します。このオブジェクトは頂点を持たず、トリミングされた円錐と考えることができます。
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
入力された座標系の原点を基準点として、その座標系の Z 軸方向に指定された高さを持ち、その座標系の XY 平面を底面とする円錐を作成します。

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
入力された座標系の原点を基準点として、その座標系の Z 軸方向に指定された高さを持ち、その座標系の XY 平面を底面とする円錐を作成します。
cone,cone by height,cones