Autodesk.DesignScript.Geometry.PolySurface.ToString
ポリサーフェスの文字列表現を取得します

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
レールに沿って曲線をスイープしてポリサーフェスを作成します。
rail: スイープの基準とする曲線
profile: スイープ プロファイル
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
サーフェスの位置を点で探します。前方向の最初の交点を取得します。サーフェスの内部にヒットした場合は 1 つのサーフェスを、エッジの内部にヒットした場合は 2 つのサーフェスを、頂点にヒットした場合は多数のサーフェスを返します
surfacesatpoint,findsurfaces,extractsurfaces