Autodesk.DesignScript.Geometry.Circle.ToString
円の文字列表現を取得します

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
入力された中心点と半径をワールド座標系の XY 平面に持ち、ワールド座標系の Z 軸を法線とする円を作成します。
centerPoint: 円の中心点
radius: 半径
Returns: 中心点と半径を指定して作成した円
circle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
入力された平面の基準点(ルート)を中心として、指定された半径を持つ円を平面上に作成します。
plane: 円の中心に使用する平面のルート
radius: 半径
Returns: 平面と半径で作成した円
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
3 つの入力点を通過する円を作成します。
p1: 円の 1 番目の点
p2: 円の 2 番目の点
p3: 円の 3 番目の点
circle