Autodesk.DesignScript.Geometry.Cuboid.ToString
直方体の文字列表現を取得します

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
入力された点を中心点として、指定された幅、長さ、高さを持つ直方体を作成します。
origin: 原点
width: 直方体の幅
length: 直方体の長さ
height: 直方体の高さ
Returns: 長さで作成した直方体
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.Length
長さの距離を返します。                         注: これは直方体の入力寸法を返すものです。実際のワールド空間の                   寸法を返すわけではありません。たとえば幅(X 軸)が 10 の直方体を作成後、                   X 軸が 2 倍に拡張された座標系にその直方体を移し替えたとしても、                   幅は 10 のままになります。ASM ではボディの頂点を予測可能な順番で                   抽出することができないため、 変換後の寸法を判断することはできません。

Autodesk.DesignScript.Geometry.Cuboid.Width
幅の距離を返します。                         注: これは直方体の入力寸法を返すものです。実際のワールド空間の                   寸法を返すわけではありません。たとえば幅(X 軸)が 10 の直方体を作成後、                   X 軸が 2 倍に拡張された座標系にその直方体を移し替えたとしても、                   幅は 10 のままになります。ASM ではボディの頂点を予測可能な順番で                   抽出することができないため、 変換後の寸法を判断することはできません。

Autodesk.DesignScript.Geometry.Cuboid.Height
高さの距離を返します。                         注: これは直方体の入力寸法を返すものです。実際のワールド空間の                   寸法を返すわけではありません。たとえば幅(X 軸)が 10 の直方体を作成後、                   X 軸が 2 倍に拡張された座標系にその直方体を移し替えたとしても、                   幅は 10 のままになります。ASM ではボディの頂点を予測可能な順番で                   抽出することができないため、 変換後の寸法を判断することはできません。