Autodesk.DesignScript.Geometry.PolyCurve.ToString
ポリカーブの文字列表現を取得します

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
曲線を結合してポリカーブを作成します。接続性の必要に応じて曲線を反転します。優先される結合の許容値を 1e-6 から 1e-3 までの単位で選択します。
curves: ポリカーブに結合する曲線
joinTolerance: 結合する曲線間で使用できるギャップのサイズを判断するための許容値
Returns: 結合された曲線によって作成されたポリカーブ
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
接続された曲線をグループ化して、1 つまたは複数のポリカーブを作成します。優先される結合の許容値を 1e-6 から 1e-3 までの単位で選択します。
curves: グループ化して 1 つまたは複数のポリカーブを作成する曲線
joinTolerance: 結合する曲線間で使用できるギャップのサイズを判断するための許容値

Autodesk.DesignScript.Geometry.PolyCurve.Curves
ポリカーブの曲線を返します
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
接線円弧でポリカーブを延長します
length: 延長する弧長
radius: 円弧の半径
endOrStart: ポリカーブの終点または始点を延長しています

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
平面内のポリカーブにフィレット。
radius: フィレットの半径
rightSide: ポリカーブの始点に対して右側でフィレットする場合は true、左側でフィレットする場合は false
Returns: フィレットされたポリカーブ
round,smooth,radius