Autodesk.DesignScript.Geometry.IndexGroup.ToString
IndexGroup の文字列表現を取得します

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
2 つの IndexGroup を比較します
other: その他の IndexGroup
Returns: 2 つのオブジェクトが等しいかどうか

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
このタイプのハッシュ値を取得します
Returns: このオブジェクトのユニークなハッシュ値

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
3 つのインデックスを格納する IndexGroup を作成します
a: インデックス a
b: インデックス b
c: インデックス c
Returns: IndexGroup
tri,polygon,mesh,meshes