Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
T スプライン トポロジの文字列表現を取得します

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
入力されたインデックスの位置の頂点を返します。
index: 頂点を取得するためのインデックス
Returns: T スプラインの頂点
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
入力されたインデックスの位置のエッジを返します。
index: エッジを取得するためのインデックス
Returns: T スプライン エッジ
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
入力されたインデックスの位置のの面を返します。
index: 面を取得するためのインデックス
Returns: T スプライン面
tspline,face,byindex