Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
「使用可能なモデリング範囲を超えました。もっと小さな値を選択してください」に類似するローカライズされた文字列を検索します。

Autodesk.DesignScript.Geometry.Properties.Resources.OutsideAllowableModelingRange
「入力が許容モデリング範囲外です。{0} の設定は[基本設定] => [一般] => [ジオメトリのスケーリング]ダイアログで {1} ～ {2} の間のモデリング範囲で選択してください」に類似するローカライズされた文字列を検索します。