Autodesk.DesignScript.Geometry.Rectangle.ToString
長方形の文字列表現を取得します

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
入力された幅(平面の X 軸の長さ)と高さ(平面の Y 軸の長さ)を持ち、ワールド座標系の基準点を中心とする長方形を、ワールド座標系の XY 平面に作成します。
width: 長方形の幅
length: 長方形の長さ
Returns: 幅と長さで作成した長方形
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
入力された幅(平面の X 軸の長さ)と高さ(平面の Y 軸の長さ)を持ち、平面のルートを中心とする長方形を作成します。
plane: 長方形の中心に使用する平面
width: 長方形の幅
length: 長方形の長さ
Returns: 幅と長さで作成した長方形
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
指定した幅(X 軸の長さ)と長さ(Y 軸の長さ)を持ち、座標系内の入力された原点を中心とする長方形を作成します。
coordinateSystem: 長方形の座標系(長方形の中心)
width: 長方形の幅
length: 長方形の長さ
Returns: 幅と長さから作成した長方形
rectbylengths