Autodesk.DesignScript.Geometry.Curve.ToString
曲線の文字列表現を取得します

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
指定されたパラメータの位置に基準点を持つ座標系を取得します。 X 軸は曲線の法線に、Y 軸はこの点における曲線の接線に、Z 軸はこの点におけるアップ ベクトルまたは従法線に、それぞれ位置合わせされます。
param: 評価するパラメータ
Returns: 曲線のパラメータを基準とする座標系
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
曲線の接点で法線を位置合わせした平面を返します。開始点は常に 0 になり、また終了点は常に 1 になるように、パラメータが調整されます。
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtDistance(System.Double)
曲線上で指定された弧長の端点を取得します。
segmentLength: 評価する曲線上の距離
Returns: 指定された弧長の端点
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
分割の入力数値に基づいて曲線の長さに沿って等間隔に配置された点を返します
divisions: 分割数
Returns: 曲線の長さに沿って等間隔に配置された点

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
入力された分割数に基づいて、曲線上に等しい弦長で配置された点を返します
divisions: 分割数
Returns: 曲線上の点のリスト

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
指定された点を基準として、曲線上に指定された線分の長さで等間隔に配置された点群を返します
point: 計測元となる参照点
segmentLength: 評価する曲線上の距離
Returns: 曲線上の点のリスト

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
指定された点から開始する指定された弦長の先にある曲線上の点を返します
point: 計測元となる参照点
chordLength: 弦長
Returns: 曲線上の点のリスト

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
曲線の開始点から指定された距離にある座標系を返します。Y 軸は曲線の接線、X 軸は曲率になります。
segmentLength: 評価する曲線上の距離
Returns: 曲線上の座標系
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtDistance(System.Double)
曲線の開始点から指定された距離にある座標系を返します。Y 軸は曲線の接線、X 軸は曲率になります。
segmentLength: 評価する曲線上の距離
Returns: 曲線上の座標系
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
開始点から曲線に沿って指定された距離にある平面を返します。平面の法線は曲線の接線に位置合わせされます。
segmentLength: 評価する曲線上の距離
Returns: 曲線に基づく平面
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PlaneAtDistance(System.Double)
開始点から曲線に沿って指定された距離にある平面を返します。平面の法線は曲線の接線に位置合わせされます。
segmentLength: 評価する曲線上の距離
Returns: 曲線に基づく平面
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
曲線の開始点から指定されたパラメータまで計測したセグメントの長さを取得します。
param: 0 と 1 の間の値
Returns: セグメントの長さ
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtDistance(System.Double)
曲線上の指定された弧長でパラメータを取得します。
segmentLength: 評価する曲線上の距離
Returns: パラメータ
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.LengthBetweenParameters(System.Double,System.Double)
曲線上の 2 つのパラメータ点間の弧長を取得します。
startParam: ドメインの開始
endParam: ドメインの終了
Returns: 2 つのパラメータ間の弧長
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
曲線に沿った指定された点でパラメータを取得します。点が曲線上にない場合は、最も近いパラメータを取得します。入力曲線が PolyCurve の場合、この関数は、点が PolyCurve の上にある場合にのみ有効なパラメータを返します。他の曲線タイプの場合、この関数は、入力点に最も近い点にある曲線に沿ってパラメータを返します。
point: 曲線に沿っているか近くにある点
Returns: PolyCurve の曲線上のパラメータ、または、その他の曲線タイプの曲線に沿った最も近いパラメータです。
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.DivideEqually(System.Int32)
曲線を指定した数の長さの等しい曲線に分割します
divisions: 分割数
Returns: 分割後の Curve の Array
chopcurve,segment,slices

Autodesk.DesignScript.Geometry.Curve.DivideByDistance(System.Int32)
各曲線の始点と終点の距離を等しくして(等しい弦)、曲線を指定した数の曲線に分割します。
divisions: 分割数
Returns: 分割後の Curve の Array
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByLengthFromParameter(System.Double,System.Double)
指定したパラメータの位置から計測した、指定した長さの曲線に、曲線を分割します
length: 分割後の曲線の長さ
parameter: 計測元のパラメータの位置
Returns: 分割後の Curve の配列
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByDistanceFromParameter(System.Double,System.Double)
指定したパラメータの位置から計測した、指定した弦長の曲線に、曲線を分割します
distance: 分割によって取得した各曲線の弦長
parameter: 計測元のパラメータの位置
Returns: 分割後の Curve の Array
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimStart(System.Double)
入力されたパラメータで、曲線の先頭を削除します
startParameter: トリムを開始するパラメータ
Returns: 先頭を削除した後に残る新しい曲線
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimEnd(System.Double)
入力されたパラメータで、曲線の末尾を削除します
endParameter: トリムを開始するパラメータ
Returns: 末尾を削除した後に残る新しい曲線
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrim(System.Double,System.Double)
入力されたパラメータで曲線の先頭と末尾を削除します。
startParameter: トリムを開始するパラメータ
endParameter: トリムを開始するパラメータ
Returns: 外側部分を削除した後に残る新しい曲線
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.ParameterTrimInterior(System.Double,System.Double)
入力されたパラメータで、曲線の内側部分を削除します。
startParameter: トリムを開始するパラメータ
endParameter: トリムを開始するパラメータ
Returns: 内側部分を削除した後に残る新しい曲線
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimSegments(System.Double[])
曲線のいくつかのセグメントを削除し、1 番目、3 番目、5 番目... のセグメントを破棄します。
parameters: 曲線を分割するパラメータのリスト
Returns: 1 番目、3 番目、5 番目... のセグメントを破棄する曲線の配列
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
曲線のいくつかのセグメントを削除し、ブール値が true の場合に 2 番目、4 番目、6 番目 ... のセグメントを破棄します
parameters: 曲線を分割するパラメータのリスト
discardEvenSegments: 偶数番のセグメントを破棄するかどうかを切り替え
Returns: ブール値が true の場合に 2 番目、4 番目、6 番目... のセグメントを破棄する曲線の Array
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double)
入力されたパラメータで、2 つの部分に曲線を分割します。
parameter: 分割を実行するパラメータ
Returns: 分割後に残る 2 本の曲線
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double)
入力されたパラメータで、2 つの部分に曲線を分割します。
parameter: 分割を実行するパラメータ
Returns: 分割後に残る 2 本の曲線
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double[])
入力されたパラメータで、曲線を複数の部分に分割します。
parameters: 曲線を分割するパラメータのリスト
Returns: 分割によって作成される曲線
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(Autodesk.DesignScript.Geometry.Curve)
この曲線と入力曲線を新しいポリカーブに結合し、元の曲線をそのまま保持します。
curve: 結合先の曲線
Returns: 2 本の曲線から構成されたポリカーブ
convertcurve,curve2polycurve,joincurve,concat

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
選択 Point によって決まる特定の終端で距離を指定して Curve を延長します。選択した側が延長されます。Circle や Ellipse などの閉じられた曲線は延長されません。
distance: 延長する距離
pickSide: 延長する終端の点
Returns: 延長された曲線
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
曲線の始端から、指定された距離で曲線を延長します。円や楕円 などの閉じられた曲線は延長されません。
distance: 延長する距離
Returns: 延長された曲線
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
曲線の終端から、指定された距離で曲線を延長します。円や楕円などの閉じられた曲線は延長されません。
distance: 延長する距離
Returns: 延長された曲線
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
指定された下部ジオメトリに、指定された投影方向に沿って入力曲線を投影します。ジオメトリの ontoVectorList を投影するジオメトリが、下部ジオメトリに投影されます