Autodesk.DesignScript.Geometry.Ellipse.ToString
楕円の文字列表現を取得します

Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
入力された点を中心とする楕円を作成します。作成される楕円はワールド座標系 XY Pl平面に位置合わせされ、指定された X 軸半径と Y 軸半径を持ちます。
origin: 楕円の原点
xAxisRadius: X 軸半径
yAxisRadius: Y 軸半径
Returns: 原点と半径で作成した楕円
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
入力された点を中心とする楕円を作成します。2 つの軸を指定します。軸は互いに直交する必要があります。
origin: 楕円の原点
xAxisRadius: X 軸半径
yAxisRadius: Y 軸半径
Returns: 原点ベクトルから作成した楕円
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
入力された座標系に中心点を持ち、位置合わせされた楕円を作成します。x_radius 半径を X 軸方向に、y_radius 半径を Y 軸方向に指定します。
origin: 楕円の原点座標系
xAxisRadius: X 軸半径
yAxisRadius: Y 軸半径
Returns: 座標系と半径で作成した楕円
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
入力された平面に中心点を持ち、位置合わせされた楕円を作成します。x_radius 半径を平面 X 軸方向に、y_radius 半径を平面 Y 軸方向に指定します。
plane: 楕円弧が描画される平面
xAxisRadius: X 軸半径
yAxisRadius: Y 軸半径
Returns: 平面と半径から作成した楕円
ellipse,aligned ellipse,ellipsebylengths