Autodesk.DesignScript.Geometry.NurbsSurface.ToString
NURBS サーフェスの文字列表現を取得します

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
補間した点、U、V 次数を指定して NURBS サーフェスを作成します。作成されるサーフェスはすべての点を通過します。
points: NURBS サーフェスの点群のグリッド
uDegree: U 方向の次数
vDegree: V 方向の次数
Returns: 点群で作成した NURBS サーフェス
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
補間した点、U、V 次数を指定して NURBS サーフェスを作成します。作成されるサーフェスはすべての点を通過します。接線の数は対応する方向の点の数に一致する必要があります。作成されるサーフェスは U 方向と V 方向ともに次数 3 となります。
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
異なるサーフェス特性の集合を満たす NURBS サーフェスを作成します。これは、最も高度なサーフェス フィット法です。作成されるサーフェスはすべての点を通過します。接線の数は対応する向きにある点の数に一致する必要があります。作成されるサーフェスは U 方向と V 方向ともに次数 3 となります。コーナーの導関数は 2 次(dP/dUdV)とし、[ lowU, lowV ]、[ highU, lowV ]、[ lowU, highV ]、[ highU, highV ]の順に指定する必要があります。
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
制御点、ノット、重量、U V 次数を指定して NURBS サーフェスを作成します。データが破損していると関数が失敗し例外がスローされるという制限があります。次数: u- および v- の両方の次数を 1 以上(折れ線状スプライン)、26 未満(ASM がサポートする最大 B スプライン基準次数)とする必要があります。重み: すべての重み値(指定する場合)は、かならず正でなければなりません。1e-11 よりも軽い重みは却下され、動作しなくなります。ノット: 両方のノット ベクトルは非減少シーケンスにする必要があります。内部ノットの多重度は開始/終了ノットの度数 + 1 および内部ノットの次数よりも小さくする必要があります(これにより、G1 の不連続を持つ曲線を表現することができます)。未固定ノット ベクトルはサポートされていませんが、これらは固定ノット ベクトルに変換され、制御点/重みデータに対応する変更が適用されます。
lines
0.4