Autodesk.DesignScript.Geometry.Arc.ToString
円弧の文字列表現を取得します

Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
始点、終点とそれらの接線により円弧または双円弧を作成します
point1: 双円弧の始点
vector1: 双円弧の始点の接線ベクトル
point2: 双円弧の終点
vector2: 双円弧の終点の接線ベクトル
arc,tangent

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
開始接線を Vector にし、開始 Point から終了 Point までの Arc を作成
startPoint: 円弧の開始点
endPoint: 円弧の終了点
startTangent: 開始接線方向ベクトル
arc,tangent,arcs