Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
T スプライン サーフェスの文字列表現を取得します

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
指定された基準点に配置され、指定されたベクトル法線を持ち、指定された X 軸で方向付けられた T スプライン平面を作成します。
この X 軸によって分割、交差、投影などの操作に影響が生じることはなく、単に入力座標系の方向が指定されます。
origin: 平面のルート点
normal: 平面の法線
xAxis: 平面の X 軸
minCorner: 平面の座標内における最小コーナーの 2D 点
maxCorner: 平面の座標内における最大コーナーの 2D 点
xSpans: 幅方向のスパンの数
ySpans: 長さ方向のスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: 平面の T スプライン サーフェス
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
入力された原点、X 軸、Y 軸によって平面を作成します。
Z 軸は、2 つのベクトルの外積です。
origin: 平面のルート点
xAxis: 平面の X 軸
yAxis: 平面の Y 軸
minCorner: 平面の座標内における最小コーナーの 2D 点
maxCorner: 平面の座標内における最大コーナーの 2D 点
xSpans: 幅方向のスパンの数
ySpans: 長さ方向のスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: 平面の T スプライン サーフェス
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
入力された始点と底面半径を持ち、
入力された終点を頂点とする T スプライン円錐を作成します。
startPoint: 円錐の始点
endPoint: 円錐の終点
radius: 円錐の底面の半径
radiusSpans: 円周上のスパンの数
heightSpans: 高さ方向のスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: 円錐形の T スプライン サーフェス
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
入力された始点から終点までを軸として、始点と終点でそれぞれ入力された半径を持つ T スプライン円錐を作成します。
このオブジェクトは、頂点のない錐台形状になります。
startPoint: 円錐の始点
endPoint: 円錐の終点
startRadius: 円錐の始点の半径
endRadius: 円錐の終点の半径
radiusSpans: 円周上のスパンの数
heightSpans: 高さ方向のスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: 円錐形の T スプライン サーフェス
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
入力された座標系の原点を基準点として、その座標系の XY 平面に円形の底面を置き、
それを同じ座標系の Z 軸方向に延長することで、T スプライン円錐を作成します。
cs: 円錐の中心と底面は、この座標系の XY 平面に合わせて調整されます
height: 円錐の高さ
radius: 円錐の半径
radiusSpans: 円周上のスパンの数
heightSpans: 高さ方向のスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: 円錐形の T スプライン サーフェス
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
入力された座標系の基準点を中心として、その座標系の XY 平面に円形の底面を置き、
それを同じ座標系の Z 軸方向に延長することで、T スプライン円錐を作成します。
cs: 円錐の中心と底面は、この座標系の XY 平面に合わせて調整されます
height: 円錐の高さ
startRadius: 円錐の始点の半径
endRadius: 円錐の終点の半径
radiusSpans: 円周上のスパンの数
heightSpans: 高さ方向のスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: 円錐形の T スプライン サーフェス
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
入力された中心点から、指定された半径の範囲に広がる T スプライン球体を作成します。
centerPoint: 球体の中心点
radius: 球体の半径
radiusSpans: 放射状のスパンの数
heightSpans: 高さ方向のスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: 球体状の T スプライン サーフェス
tspline,sphere,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
入力された 4 つの点をサーフェス上に含む T スプライン球体を作成します。
points: 球体の作成に使用する 4 つの点のリストです。これらの点を同一平面上に配置することはできません。
radiusSpans: 放射状のスパンの数
heightSpans: 高さ方向のスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: 球体状の T スプライン サーフェス
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
既定のワールド XY 平面に合わせて、入力された中心点と半径を持つ T スプライン トーラスを作成します。
center: トーラスの中心点
innerRadius: トーラスの内径
outerRadius: トーラスの外径
innerRadiusSpans: 内側の放射状のスパンの数
outerRadiusSpans: 外側の放射状スパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: トーラスの T スプライン サーフェス
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
入力された点を中心として、入力された幅、長さ、高さを持つ T スプライン直方体を作成します。
origin: 直方体の中心点
width: 直方体の幅
length: 直方体の長さ
height: 直方体の高さ
xSpans: 幅方向のスパンの数
ySpans: 長さ方向のスパンの数
zSpans: 高さ方向のスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: T スプライン立方体
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
入力された座標系に基づいて中心点と方向を設定し、指定された幅、長さ、高さを持つ T スプライン直方体を作成します。
cs: 直方体の XY 平面は、座標系の X 軸に位置合わせされます
width: 直方体の幅
length: 直方体の長さ
height: 直方体の高さ
xSpans: 幅方向のスパンの数
ySpans: 長さ方向のスパンの数
zSpans: 高さ方向のスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: T スプライン立方体
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
入力された 2 つの点のうち、低い点から高い点にかけて T スプライン直方体を作成します。
lowPoint: 1 番目のコーナー点
highPoint: 2 番目のコーナー点
xSpans: 幅方向のスパンの数
ySpans: 長さ方向のスパンの数
zSpans: 高さ方向のスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: T スプライン立方体
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
入力された座標系の基準点を中心として、入力された半径を持つ T スプライン クワッドボールを作成します。
cs: ローカル座標系
radius: クワッドボールの半径
spans: クワッドボールの側面の 2 つの寸法におけるスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: T スプライン クワッドボール
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
既定のワールド XY 平面に合わせて、入力された中心点と半径を持つ T スプライン クワッドボールを作成します。
center: クワッドボールの中心点
radius: クワッドボールの半径
spans: クワッドボールの側面の 2 つの寸法におけるスパンの数
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: T スプライン クワッドボール
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
均一な配置方法を使用して、NURBS サーフェスから T スプライン サーフェスを作成します。
入力 NURBS サーフェスは、パラメータで指定された長さの間隔または弧長の間隔(どちらになるかは、
対応する useArcLen フラグによって異なります)で配置された均一なノットによって再作成され、
次数 3 の NURBS サーフェスによって近似値が算出されます。出力 T スプラインは、指定されたスパンの数により、
U 方向と V 方向に分割されます。
nurbsSurface: 入力 NURBS サーフェス
uSpans: U 方向で必要なスパンの数
vSpans: V 方向に必要なスパンの数
uUseArcLen: パラメータの U 方向で、弧長かパラメータによる再分割のどちらを使用するか
vUseArcLen: パラメータの V 方向で、弧長かパラメータによる再分割のどちらを使用するか
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
曲率による再分割の方法を使用して、NURBS サーフェスから T スプライン サーフェスを作成します。
入力 NURBS サーフェスは、次数 3 として再作成されます。出力 T スプラインには、
各方向におけるスパンの数と位置が格納されます。これらのスパンは、曲率によって自動的に検出されます。
nurbsSurface: 入力 NURBS サーフェス
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByExtrude(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
指定されたベクトルに沿って曲線を押し出して、T スプラインを作成します。
curve: プロファイル曲線
direction: ベクトル押し出し
frontDistance: ベクトル方向に沿って押し出す距離
backDistance: ベクトル方向の反対向きに押し出す距離
frontSpans: ベクトル方向のスパンの数。値 0 を指定すると、ベクトル方向に沿った押し出しは実行されません。
backSpans: ベクトル方向に対するスパンの数。値 0 を指定すると、ベクトル方向の反対向きの押し出しは実行されません。
profileSpans: プロファイル方向のスパンの数。0 以下の値を指定すると、自動的に設定されます。
uniform: プロファイル方向に沿ってスパンを配置する際に、均一な配置方法または曲率による配置方法を使用
inSmoothMode: ボックスの表示スタイルまたはスムーズな表示スタイルで T スプライン サーフェスを表示
tspline,extrude,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
断面の曲線をパスに沿ってスイープすることにより、T スプラインを作成します。
profile: プロファイル曲線
path: パス曲線
parallel: スパンはパスの方向に対して平行である必要があります
pathSpans: パス内のスパンの数
profileSpans: プロファイル内のスパンの数。0 以下の値を指定すると、スパンの数が自動的に設定されます。
pathUniform: パスに沿ってスパンを配置する際に、均一な配置方法と曲率による配置方法のどちらを使用するか
profileUniform: プロファイルに沿ってスパンを配置する際に、均一な配置方法と曲率による配置方法のどちらを使用するか
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
軸の基準点と軸の方向によって、軸の周囲に描画されたプロファイル曲線を
スイープして、T スプライン サーフェスを作成します。start_angle に入力された数値を開始角度とし、
sweep_angle に入力された数値をでスイープ角度とします。
profile: プロファイル曲線
axisOrigin: 回転の中心点
axisDirection: 回転軸
startAngle: 回転の開始角度
sweepAngle: 回転の終了角度
radialSpans: 半径内のスパンの数
axialSpans: 高さ方向のスパンの数。0 以下の値を指定すると、スパンの数が自動的に設定されます。
uniform: スパンを配置する際に、均一な配置方法と曲率による配置方法のどちらを使用するか
symmetry: T スプライン サーフェスの対称オプション
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
一連の曲線または直線からパイプ サーフェスを作成します。
曲線の各交差部は滑らかに接合されます。
1 本の曲線について 1 つの値またはリストを指定するパラーメータもあれば、2 つの値を指定するパラメータもあります。
curves: パイプの作成に使用する曲線のリスト
defaultRadius: 作成されるパイプの既定の半径
snappingTolerance: 曲線の交差部を検出するための許容値
segmentsCount: 各パイプのセグメントの数。1 つの値か、曲線数の 2 倍の長さのリストを指定することができます。
endRotations: 各パイプの端部の回転角度。1 つの値か、曲線数の 2 倍の長さのリストを指定することができます。
endRadii: 各パイプの端部の半径。1 つの値か、曲線数の 2 倍の長さのリストを指定することができます。
endPercentage: 各入力曲線の終点からパイプ メッシュの始点までの値(0 から 1 の範囲)。1 つの値か、曲線数の 2 倍の長さのリストを指定することができます。
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
一連の曲線または直線からパイプ サーフェスを作成します。
曲線の各交差部は滑らかに接合されます。
1 本の曲線について 1 つの値またはリストを指定するパラメータもあれば、1 つの値のみを指定するパラメータもあります。
curves: パイプの作成に使用する曲線のリスト
defaultRadius: 作成されるパイプの既定の半径
snappingTolerance: 曲線の交差部を検出するための許容値
segmentsCount: 各曲線のセグメントの数。リストのサイズは、曲線数、1 (複製の場合)、または 0 (自動決定の場合)にすることができます。
autoHandleStart: true を指定すると、各曲線の始点におけるハンドルのパラメータが自動的に生成され、カスタム パラメータ rotationsAtStart、radiiAtStart、positionsAtStart は無視されます。
autoHandleEnd: true を指定すると、各曲線の終点におけるハンドルのパラメータが自動的に生成され、カスタム パラメータ rotationsAtEnd、radiiAtEnd、positionsAtEnd は無視されます。
startRotations: 各曲線の始点における各パイプ ハンドルのカスタム回転角度(度単位)。autoHandleStart が true の場合、このパラメータは無視されます。リストのサイズは、曲線数、または 1 (複製の場合)にすることができます。
endRotations: 各曲線の終点における各パイプ ハンドルのカスタム回転角度(度単位)。autoHandleEnd が true の場合、このパラメータは無視されます。リストのサイズは、曲線数、または 1 (複製の場合)にすることができます。
startRadii: 各曲線の始点における各パイプ ハンドルのカスタム半径。autoHandleStart が true の場合、このパラメータは無視されます。リストのサイズは、曲線数、または 1 (複製の場合)にすることができます。
endRadii: 各曲線の終点における各パイプ ハンドルのカスタム半径。autoHandleEnd が true の場合、このパラメータは無視されます。リストのサイズは、曲線数、または 1 (複製の場合)にすることができます。
startPositions: 曲線の弧長に沿って 0 から 1 までのパーセンテージで示した、各曲線の始点における各パイプ ハンドルのカスタム位置。autoHandleStart が true の場合、このパラメータは無視されます。リストのサイズは、曲線数、または 1 (複製の場合)にすることができます。始点と終点の位置は、各曲線が互いに重ならないようにする必要があります。理想的には、始点は 0 に近い位置、終点は 1 に近い位置にする必要があります。
endPositions: 曲線の弧長に沿って 0 から 1 までのパーセンテージで示した、各曲線の終点における各パイプ ハンドルのカスタム位置。autoHandleEnd が true の場合、このパラメータは無視されます。リストのサイズは、曲線数、または 1 (複製の場合)にすることができます。始点と終点の位置は、各曲線が互いに重ならないようにする必要があります。理想的には、始点は 0 に近い位置、終点は 1 に近い位置にする必要があります。
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
T スプラインがボックス モードであるかスムーズ モードであるかを返します。
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
T スプラインが開いているかどうかを返します。
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
T スプライン サーフェスを、その形状に応じてソリッドまたはサーフェスに変換します。
注: 入力サーフェスが Dynamo にロードされているバージョンよりも高いバージョンの T スプラインで作成された場合、サーフェスのコピーが Dynamo バージョンにダウングレードされて変換に利用されるため、結果として得られる B-Rep に予期しない変化がわずかに生じることがあります。
matchTopology: 結果として得られる本体のトポロジを入力 T スプライン サーフェスと同じトポロジにするかどうかを決定します。
Returns: トポロジ エンティティ(ソリッドまたはサーフェス)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
T スプライン サーフェスをメッシュに変換します。メッシュには、三角形と四角形の両方を含めることができます。
minSegments: 各方向におけるセグメントの最小数。必ず 1 つ以上のセグメントが生成されます。
tolerance: メッシュからサーフェスまでの最大許容距離。0 以下の値を指定すると、距離が無効になります。
Returns: メッシュ エンティティ
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
入力された頂点のリストを 1 つの頂点に連結します。
vertices: 連結する頂点
newPosition: 出力される頂点グリップの位置。Null 値を指定した場合、グリップの平均位置が使用されます。
keepSubdCreases: 入力トポロジの再分割された折り目を保存
Returns: 連結された頂点を持つ T スプライン サーフェス
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
T スプラインと、閉じた曲線ループとの一致を作成します。
tsEdges: 一致を作成する閉じた T スプライン エッジ ループ
curves: 一致を作成する閉じた曲線ループ
continuity: 一致させるためのジオメトリの連続性: G0、G1、G2
useArclength: 一致を作成する際に arcLength 位置合わせを使用するかどうか
useRefinement: true を指定すると、追加の制御点が T スプラインに付加され、入力された許容値の範囲内でサーフェスが一致します。
numRefinementSteps: 微調整の最大ステップ数。useRefinement に false を指定すると、この値は無視されます。
refinementTolerance: 最大の許容値。useRefinement に false を指定すると、この値は無視されます。
usePropagation: 一致を作成する際に伝播を使用するかどうか
widthOfPropagation: 一致によって影響を受けるサーフェスの範囲を指定します。usePropagation に false を指定すると、この値は無視されます。
tangentScale: 接線のスケール。連続性が G1 に設定されていない場合、この値は無視されます。
curvParamWeight: 曲率パラメータのウェイト。連続性が G2 に設定されていない場合、この値は無視されます。
flipSourceTargetAlignment: 位置合わせの方向を反転させるかどうか
Returns: 指定された T スプライン境界のエッジと曲線ループとの間に位置する T スプライン サーフェス
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
T スプラインと、閉じた曲線ループとの一致を作成します。
tsEdges: 一致を作成する閉じた T スプライン エッジ ループ
curves: 一致を作成する閉じた曲線ループ
continuity: 一致させるためのジオメトリの連続性: G0、G1、G2
useArclength: 一致を作成する際に arcLength 位置合わせを使用するかどうか
useRefinement: true を指定すると、追加の制御点が T スプラインに付加され、入力された許容値の範囲内でサーフェスが一致します。
numRefinementSteps: 微調整の最大ステップ数。useRefinement に false を指定すると、この値は無視されます。
refinementTolerance: 最大の許容値。useRefinement に false を指定すると、この値は無視されます。
usePropagation: 一致を作成する際に伝播を使用するかどうか
widthOfPropagation: 一致によって影響を受けるサーフェスの範囲を指定します。usePropagation に false を指定すると、この値は無視されます。
scale: G1 の場合は接線スケール、G2 の場合は曲率スケール。連続性が G0 の場合、この値は無視されます。
flipSourceTargetAlignment: 位置合わせの方向を反転させるかどうか
Returns: 指定された T スプライン境界のエッジと曲線ループとの間に位置する T スプライン サーフェス
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
T スプラインと閉じた BRep エッジ ループとの一致を作成します。最初に
エッジ ループが曲線ループに変換され、次に一致の作成処理が実行されます。
tsEdges: 一致を作成する閉じた T スプライン エッジ ループ
brepEdges: 一致を作成する閉じた BRep エッジ ループ
continuity: 一致させるためのジオメトリの連続性: G0、G1、G2
useArclength: 一致を作成する際に arcLength 位置合わせを使用するかどうか
useRefinement: true を指定すると、追加の制御点が T スプラインに付加され、入力された許容値の範囲内でサーフェスが一致します。
numRefinementSteps: 微調整の最大ステップ数。useRefinement に false を指定すると、この値は無視されます。
refinementTolerance: 最大の許容値。useRefinement に false を指定すると、この値は無視されます。
usePropagation: 一致を作成する際に伝播を使用するかどうか
widthOfPropagation: 一致によって影響を受けるサーフェスの範囲を指定します。usePropagation に false を指定すると、この値は無視されます。
tangentScale: 接線のスケール。連続性が G1 に設定されていない場合、この値は無視されます。
curvParamWeight: 曲率パラメータのウェイト。連続性が G2 に設定されていない場合、この値は無視されます。
flipSourceTargetAlignment: 位置合わせの方向を反転させるかどうか
Returns: 指定された T スプライン境界のエッジと BRep エッジ ループとの間に位置する T スプライン サーフェス
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
T スプラインの表示スタイルを変更します。
true を指定するとスムーズな表示スタイルになり、false を指定するとボックスの表示スタイルになります。
enable: スムーズな表示スタイルのオン/オフを切り替える
Returns: 選択した表示スタイルの T スプライン
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
面の 2 つのセット間にブリッジを作成します。1 番目のグループの項目は、
このサーフェスの子として認識されます。2 番目のグループの項目は、
このサーフェスの子である場合もあれば、別のサーフェスに属する項目である場合もあります。
各グループ内のトポロジは隣接していない場合がありますが、
各グループ内のトポロジの数は、各ループの数と同じになります。
firstGroup: ブリッジする 1 番目のグループの面
secondGroup: ブリッジする面の 2 番目のグループ
followCurves: 各トポロジ ループのブリッジ曲線
(空のリストが入力された場合は直線が使用されます。1 本の曲線が入力された場合は
入力された曲線が複製されます。複数の曲線が入力された場合は、ループが検出されます)
frameRotations: 各トポロジ ループのブリッジ曲線に沿うフレームの
法線の周囲で回転させる回数
(空のリストが入力された場合は 0 が使用されます。1 つの値が入力された場合は
入力された値が複製されます。複数の値が入力された場合は、ループが検出されます)
spansCounts: 各トポロジ ループのブリッジに沿うセグメントの数
各グループのスパンの数は、対応する回転数よりも大きくなります
(空のリストが入力された場合は 1 が使用されます。
1 つの値が入力された場合は、入力された値が複製されます。
複数の値が入力された場合は、ループが検出されます。)
cleanBorderBridges: 境界エッジ間のブリッジを削除します。
keepSubdCreases: 入力トポロジの再分割された折り目を保存
firstAlignVertices: 1 番目のグループに属する各トポロジ ループの
頂点の方向のリスト(頂点の数は、検出された入力ループの数と
同じになります。リストは空でもかまいません)
secondAlignVertices: 2 番目のグループの各トポロジ ループの
頂点の方向のリスト(頂点の数は、検出された入力ループの数と
同じになります。リストは空でもかまいません)
flipAlignmentFlags: 対応するトポロジ ループの
ブリッジの位置合わせを反転するかどうかを示すフラグのリスト
(空のリストが入力された場合は false が設定されます。1 つの値が入力された場合は
検出された入力ループごとにその値が複製されます)
Returns: ブリッジによって接続されたトポロジを持つ T スプライン サーフェス
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
面のセットとエッジのセットとの間にブリッジを作成します。1 番目のグループの項目は
このサーフェスの子として認識されます。2 番目のグループの項目は
このサーフェスの子である場合もあれば、別のサーフェスに属する項目である場合もあります。
各グループ内のトポロジは隣接していない場合がありますが、
各グループ内のトポロジの数は、各ループの数と同じになります。
firstGroup: ブリッジする 1 番目のグループの面
secondGroup: ブリッジする 2 番目のグループのエッジ
followCurves: 各トポロジ ループのブリッジ曲線
(空のリストが入力された場合は直線が使用されます。1 本の曲線が入力された場合は
入力された曲線が複製されます。複数の曲線が入力された場合は、ループが検出されます)
frameRotations: 各トポロジ ループのブリッジ曲線に沿うフレームの
法線の周囲で回転させる回数
(空のリストが入力された場合は 0 が使用されます。1 つの値が入力された場合は
入力された値が複製されます。複数の値が入力された場合は、ループが検出されます)
spansCounts: 各トポロジ ループのブリッジに沿うセグメントの数
各グループのスパンの数は、対応する回転数よりも大きくなります
(空のリストが入力された場合は 1 が使用されます。
1 つの値が入力された場合は、入力された値が複製されます。
複数の値が入力された場合は、ループが検出されます。)
cleanBorderBridges: 境界エッジ間のブリッジを削除します。
keepSubdCreases: 入力トポロジの再分割された折り目を保存
firstAlignVertices: 1 番目のグループに属する各トポロジ ループの
頂点の方向のリスト(頂点の数は、検出された入力ループの数と
同じになります。リストは空でもかまいません)
secondAlignVertices: 2 番目のグループの各トポロジ ループの
頂点の方向のリスト(頂点の数は、検出された入力ループの数と
同じになります。リストは空でもかまいません)
flipAlignmentFlags: 対応するトポロジ ループの
ブリッジの位置合わせを反転するかどうかを示すフラグのリスト
(空のリストが入力された場合は false が設定されます。1 つの値が入力された場合は
検出された入力ループごとにその値が複製されます)
Returns: ブリッジによって接続されたトポロジを持つ T スプライン サーフェス
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
エッジのセットと面のセットとの間にブリッジを作成します。1 番目のグループの項目は、
このサーフェスの子として認識されます。2 番目のグループの項目は、
このサーフェスの子である場合もあれば、別のサーフェスに属する項目である場合もあります。
各グループ内のトポロジは隣接していない場合がありますが、
各グループ内のトポロジの数は、各ループの数と同じになります。
firstGroup: ブリッジする 1 番目のグループのエッジ
secondGroup: ブリッジする面の 2 番目のグループ
followCurves: 各トポロジ ループのブリッジ曲線
(空のリストが入力された場合は直線が使用されます。1 本の曲線が入力された場合は
入力された曲線が複製されます。複数の曲線が入力された場合は、ループが検出されます)
frameRotations: 各トポロジ ループのブリッジ曲線に沿うフレームの
法線の周囲で回転させる回数
(空のリストが入力された場合は 0 が使用されます。1 つの値が入力された場合は
入力された値が複製されます。複数の値が入力された場合は、ループが検出されます)
spansCounts: 各トポロジ ループのブリッジに沿うセグメントの数
各グループのスパンの数は、対応する回転数よりも大きくなります
(空のリストが入力された場合は 1 が使用されます。
1 つの値が入力された場合は、入力された値が複製されます。
複数の値が入力された場合は、ループが検出されます。)
cleanBorderBridges: 境界エッジ間のブリッジを削除します。
keepSubdCreases: 入力トポロジの再分割された折り目を保存
firstAlignVertices: 1 番目のグループに属する各トポロジ ループの
頂点の方向のリスト(頂点の数は、検出された入力ループの数と
同じになります。リストは空でもかまいません)
secondAlignVertices: 2 番目のグループの各トポロジ ループの
頂点の方向のリスト(頂点の数は、検出された入力ループの数と
同じになります。リストは空でもかまいません)
flipAlignmentFlags: 対応するトポロジ ループの
ブリッジの位置合わせを反転するかどうかを示すフラグのリスト
(空のリストが入力された場合は false が設定されます。1 つの値が入力された場合は
検出された入力ループごとにその値が複製されます)
Returns: ブリッジによって接続されたトポロジを持つ T スプライン サーフェス
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
エッジの 2 つのセット間にブリッジを作成します。1 番目のグループの項目は、
このサーフェスの子として認識されます。2 番目のグループの項目は、
このサーフェスの子である場合もあれば、別のサーフェスに属する項目である場合もあります。
各グループ内のトポロジは隣接していない場合がありますが、
各グループ内のトポロジの数は、各ループの数と同じになります。
firstGroup: ブリッジする 1 番目のグループのエッジ
secondGroup: ブリッジする 2 番目のグループのエッジ
followCurves: 各トポロジ ループのブリッジ曲線
(空のリストが入力された場合は直線が使用されます。1 本の曲線が入力された場合は
入力された曲線が複製されます。複数の曲線が入力された場合は、ループが検出されます)
frameRotations: 各トポロジ ループのブリッジ曲線に沿うフレームの
法線の周囲で回転させる回数
(空のリストが入力された場合は 0 が使用されます。1 つの値が入力された場合は
入力された値が複製されます。複数の値が入力された場合は、ループが検出されます)
spansCounts: 各トポロジ ループのブリッジに沿うセグメントの数
各グループのスパンの数は、対応する回転数よりも大きくなります
(空のリストが入力された場合は 1 が使用されます。
1 つの値が入力された場合は、入力された値が複製されます。
複数の値が入力された場合は、ループが検出されます。)
cleanBorderBridges: 境界エッジ間のブリッジを削除します。
keepSubdCreases: 入力トポロジの再分割された折り目を保存
firstAlignVertices: 1 番目のグループに属する各トポロジ ループの
頂点の方向のリスト(頂点の数は、検出された入力ループの数と
同じになります。リストは空でもかまいません)
secondAlignVertices: 2 番目のグループの各トポロジ ループの
頂点の方向のリスト(頂点の数は、検出された入力ループの数と
同じになります。リストは空でもかまいません)
flipAlignmentFlags: 対応するトポロジ ループの
ブリッジの位置合わせを反転するかどうかを示すフラグのリスト
(空のリストが入力された場合は false が設定されます。1 つの値が入力された場合は
検出された入力ループごとにその値が複製されます)
Returns: ブリッジによって接続されたトポロジを持つ T スプライン サーフェス
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
T スプラインの穴を埋めます。
edges: 内側に穴のあるエッジのセット。エッジは境界である必要があります。
fillMethod: 穴を埋める方法(0 - テッセレーション、1 - 多角形、2 - 集約、3 - 集約と連結)を指定します。
keepSubdCreases: 入力トポロジの再分割された折り目を保存
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
サーフェス上のすべてのトポロジを圧縮し、インデックスを隣接させます。この機能はインデックスの相対順序を維持します。
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
前進補間を実行すると、制御点がサーフェスのパラメトリック位置に移動します。逆補間を実行すると、元の制御点ごとにサーフェス上にポイントが生成され、制御点は対応するサーフェス ポイントに移動します。
reverse: 補間方向を指定します。false を指定すると前進補間、true を指定すると逆補間になります。
Returns: 指定の方向に補間された T スプライン
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
選択された面を新しいサーフェスにコピーします。新しいサーフェスには対称性は適用されません。
faces: 複製する面
Returns: 選択された面のみを持つ T スプライン サーフェス
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
入力された頂点を指定のベクトルに沿って移動します。
vertices: 移動する頂点のリスト
vector: 移動方向
onSurface: サーフェスと頂点の制御点のどちらを使用するかを示すフラグ

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSS(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface},System.String)
入力された T スプライン サーフェスのセットを、T スプライン シーン ファイルに書き出します。
tSplineSurfaces: 書き出す T スプライン サーフェスのセット
filePath: 保存先のファイル パス
Returns: T スプライン セットが保存されているファイル パス
tspline,export,save,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface,System.String)
入力された T スプライン サーフェスを、T スプライン メッシュ ファイルに書き出します。
tSplineSurface: 書き出す T スプライン サーフェス
filePath: 保存先のファイル パス
Returns: T スプライン サーフェスが保存されているファイル パス
tspline,export,save,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
T スプライン サーフェスを T スプライン メッシュ形式の文字列に書き込みます。
tSplineSurface: シリアル化する T スプライン サーフェス
Returns: T スプライン サーフェスがシリアル化されている文字列
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
T スプライン メッシュ形式の文字列から T スプライン サーフェスを作成します。
content: T スプライン メッシュ ファイルの文字列表現
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: リストに新しくロードされた T スプライン サーフェス
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
入力された T スプライン メッシュ ファイルから、T スプライン サーフェスをロードします。
filePath: ロード元のファイル パス
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: リストに新しくロードされた T スプライン サーフェス
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.IO.FileInfo,System.Boolean)
入力された T スプライン メッシュ ファイルから、T スプライン サーフェスをロードします。
file: ロード元のファイル
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: リストに新しくロードされた T スプライン サーフェス
tspline,import,load,tsm,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
入力された T スプライン シーン ファイルから、T スプライン サーフェスのセットをロードします。
filePath: ロード元のファイル パス
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: 新しくロードされた T スプライン サーフェスのセット
tspline,import,load,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.IO.FileInfo,System.Boolean)
入力された T スプライン シーン ファイルから、T スプライン サーフェスのセットをロードします。
file: ロード元のファイル
inSmoothMode: ボックスの表示スタイルかスムーズな表示スタイルで T スプライン サーフェスを表示
Returns: 新しくロードされた T スプライン サーフェスのセット
tspline,import,load,tss,file