Autodesk.DesignScript.Geometry.NurbsCurve.ToString
NURBS 曲線の文字列表現を取得します

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
明示的な制御点を使用して B スプライン曲線を作成します。注 1: deg = 1 の B スプライン曲線には G1 不連続が発生し、押し出し、スイープ、その他の操作に問題が生じます。これらの問題は回避する必要があります。代わりにポリカーブを使用します。注 2: 曲線が周期曲線である(閉じている)場合、最初の点と最後の点を同じにする必要があります。
points: NURBS 曲線の点群
Returns: 点群から作成した NURBS 曲線
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
明示的な制御点を使用して B スプライン曲線を作成します。注 1: deg = 1 の B スプライン曲線には G1 不連続が発生し、押し出し、スイープ、その他の操作に問題が生じます。これらの問題は回避する必要があります。代わりにポリカーブを使用します。注 2: 曲線が周期曲線である(閉じている)場合、最初の点と最後の点を同じにする必要があります。
points: NURBS 曲線の点群
degree: 曲線の次数
Returns: 点群から作成した NURBS 曲線
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
明示的な制御点を使用して B スプライン曲線を作成します。注 1: deg = 1 の B スプライン曲線には G1 不連続が発生し、押し出し、スイープ、その他の操作に問題が生じます。これらの問題は回避する必要があります。代わりにポリカーブを使用します。注 2: 曲線が周期曲線である(閉じている)場合、最初の点と最後の点を同じにする必要があります。
points: NURBS 曲線の点群
degree: 曲線の次数
closeCurve: 切り替えて曲線を閉じる
Returns: 点群から作成した NURBS 曲線
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
入力された制御点、重み、ノットから B スプライン曲線を作成します。ASM ドキュメントから: 次数は 1 より大きく(折れ線状スプライン)、26 より小さい(ASM がサポートする最大 B スプライン基準次数)する必要があります。重み: すべての重み値(指定する場合)は、かならず正でなければなりません。1e-11 よりも軽い重みは却下され、動作しなくなります。ノット: ノット ベクトルは非減少シーケンスにする必要があります。内部ノットの多重度は開始/終了ノットの度数 + 1 および内部ノットの次数よりも小さくする必要があります(これにより、G1 の不連続を持つ曲線を表現することができます)。未固定ノット ベクトルはサポートされていませんが、これらは固定ノット ベクトルに変換され、制御点/重みデータに対応する変更が適用されます。ノット配列: 配列サイズは num_control_points + 次数 + 1 とする必要があります
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
点間を補間することにより B スプライン曲線を作成します。注 2: 曲線が周期曲線である(閉じている)場合、最初の点と最後の点を同じにする必要があります。
points: NURBS 曲線の点群
closeCurve: 切り替えて曲線を閉じる
Returns: 点群から作成した NURBS 曲線
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
NURBS 曲線の制御点を取得します。これらの点は曲線が補間される点です。
Returns: 点の配列