DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Salva l'immagine in un percorso, con il nome file specificato.
image: Immagine da salvare
Nessun output
write image,image,file,filepath