Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Crea un EllipseArc in un piano con i raggi dati lungo gli assi X e Y e gli angoli per l'estrusione su percorso
plane: Piano contenente l'arco dell'ellisse
xRadius: Il raggio di EllipseArc nella direzione X del piano
yRadius: Il raggio di EllipseArc nella direzione Y del piano
startAngle: L'angolo iniziale dell'arco misurato dall'asse x positivo del piano di input
sweepAngle: L'angolo da sottoporre a sweep dall'angolo iniziale in gradi
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs