Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
Restituisce il numero di superfici della PolySurface.
Returns: Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
Restituisce il numero di spigoli della PolySurface.
Returns: Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
Restituisce il numero di vertici della PolySurface.
Returns: Number of vertices