Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
Crea una curva mediante una linea di superficie nello spazio UV
baseSurface: Superficie da utilizzare
startParams: UV iniziale in prossimità del quale inizierà la curva
endParams: UV finale in prossimità del quale terminerà la curva
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
Crea una curva dall'isolinea di una superficie
baseSurface: Superficie di base
direction: se isolinea 0 si trova lungo la direzione U, se 1 si trova lungo la direzione V
parameter: fissato per il valore di curva dell'altro parametro di superficie
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Unisce un gruppo di curve alla fine della PolyCurve. Inverte le curve per garantire la connettività.
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany