Autodesk.DesignScript.Geometry.Line.ByStartPointEndPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Crea una linea retta tra due punti di input.
startPoint: Line start point
endPoint: Line end point
Returns: Line from start and end point
line,linebypoints,lines

Autodesk.DesignScript.Geometry.Line.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea la linea di approssimazione ottimale tra i punti di un insieme diffuso.
bestFitPoints: List of points to best fit line
Returns: Line from fit through points
line,approximate,lines

Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Crea una linea tangente alla curva di input, posizionata nel punto della curva corrispondente al parametro.
curve: Base curve for tangent line
parameter: Parameter value
Returns: Tangent line
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Crea una linea retta a partire dal punto iniziale, che si estende nella direzione del vettore per la lunghezza specificata.
startPoint: Line start point
direction: Direction vector
length: Length of line
Returns: Line from start direction and length
linebyvector,lines