Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Crea un'ellisse centrata nel punto di input, allineata con il piano XY del sistema di coordinate globali (WCS), con i raggi asse X e Y specificati.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by origin and radii
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crea un'ellisse centrata nel punto di input, con i due assi specificati. Gli assi devono essere perpendicolari tra loro.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from origin vectors
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crea un'ellisse centrata e allineata con il CoordinateSystem di input, con un raggio x_radius nella direzione X del sistema di coordinate e un raggio y_radius nella direzione Y del sistema di coordinate.
origin: Origin coordinate system of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by coordinate system and radii
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Crea un'ellisse centrata e allineata con il piano di input, con un raggio x_radius nella direzione dell'asse X del piano e un raggio y_radius nella direzione dell'asse Y del piano.
plane: Plane where ellipse arc is drawn
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from plane and radii
ellipse,aligned ellipse,ellipsebylengths