Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Creare una PolyCurve collegando i punti. Impostare l'input 'connectLastToFirst' su true per chiudere la PolyCurve.
points: Punti per creare PolyCurve
connectLastToFirst: True per collegare l'ultimo punto al primo punto, false per lasciarli aperti
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
Restituisce la curva della PolyCurve in base all'indice
index: Lunghezza per posizionare punto
endOrStart: True per contare dalla fine della PolyCurve, false per contare dall'inizio della PolyCurve
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
Applica un offset alla PolyCurve nel piano di appartenenza.
signedDistance: Valore di offset
extendCircular: Attivare/Disattivare per rendere circolari gli angoli
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Applica un raccordo alla PolyCurve nel piano di appartenenza.
radius: Raggio di raccordo
rightSide: True per raccordare sul lato destro rispetto all'inizio della PolyCurve, false per raccordare sul lato sinistro
Returns: Filleted polyCurve
round,smooth,radius