Autodesk.DesignScript.Geometry.Solid.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Esegue l'estrusione su percorso di una curva di profilo chiusa lungo due curve guida.
path: Il percorso di input lungo cui eseguire l'estrusione.
guideRail: Una guida per l'orientamento dell'estrusione.
profile: The profile curve to sweep along the path
Brep,brep,sweep2,guides,sweepprofile

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Crea un solido di rivoluzione effettuando l'estrusione su percorso della curva di profilo intorno al raggio dell'asse formato dall'origine e dal vettore dell'asse, dall'angolo iniziale in gradi all'angolo di estrusione su percorso in gradi.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Solid created by revolve
Brep,brep,lathe,revolveprofile