Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Crea una superficie NURBS con i punti interpolati e i gradi U e V specificati. La superficie risultante passa attraverso tutti i punti.
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Crea una NurbsSurface utilizzando punti di controllo espliciti con i gradi U e V specificati.
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
Restituisce i pesi dei punti di controllo della NurbsSurface. I pesi determineranno l'influenza applicata da ciascuno dei punti di controllo sulla forma della superficie.
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
Restituisce i nodi di superficie in direzione U. I nodi sono una serie di valori dei parametri (double) utilizzati per determinare dove e come i punti di controllo influiscono sulla superficie.
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
Restituisce i nodi di superficie in direzione V. I nodi sono una serie di valori dei parametri (double) utilizzati per determinare dove e come i punti di controllo influiscono sulla superficie.
Returns: Nurbs V knots of surface