Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea una curva BSpline mediante punti di controllo espliciti. NOTA 1: le curve BSpline con deg=1 hanno discontinuità G1 che danno origine a problemi per l'estrusione, l'estrusione su percorso ed altre operazioni. È consigliabile evitarle ed utilizzare curve PolyCurve. NOTA 2: se la curva è periodica (chiusa), il primo e l'ultimo punto DEVONO coincidere.
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Crea una curva BSpline mediante punti di controllo espliciti. NOTA 1: le curve BSpline con deg=1 hanno discontinuità G1 che danno origine a problemi per l'estrusione, l'estrusione su percorso ed altre operazioni. È consigliabile evitarle ed utilizzare curve PolyCurve. NOTA 2: se la curva è periodica (chiusa), il primo e l'ultimo punto DEVONO coincidere.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Crea una curva BSpline mediante punti di controllo espliciti. NOTA 1: le curve BSpline con deg=1 hanno discontinuità G1 che danno origine a problemi per l'estrusione, l'estrusione su percorso ed altre operazioni. È consigliabile evitarle ed utilizzare curve PolyCurve. NOTA 2: se la curva è periodica (chiusa), il primo e l'ultimo punto DEVONO coincidere.
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea una curva BSpline tramite interpolazione tra i punti.
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Crea una curva BSpline tramite interpolazione tra i punti. NOTA 2: se la curva è periodica (chiusa), il primo e l'ultimo punto DEVONO coincidere.
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Crea una curva BSpline tramite interpolazione tra punti con valore di grado specificato.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Restituisce una curva BSpline attraverso i punti, con direzioni tangenti.
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
I nodi della curva. I nodi sono una serie di valori dei parametri (double) utilizzati per determinare dove e come i punti di controllo influiscono sulla curva.
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
Restituisce i pesi dei punti di controllo della NurbsCurve. I pesi determinano l'influenza di ciascuno dei punti di controllo sulla forma della curva.
Returns: Weights of nurbs curve
ptweight