Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
Importa un file SAT e restituisce una serie di geometrie importate
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
Importa un file SAT e restituisce una matrice di geometrie importate
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Serializza un elenco di geometria specificata in formato Standard ACIS Binary (SAB) e restituisce dati di flusso binari serializzati
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes