Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crea un cilindro solido definito da un CoordinateSystem principale, dal raggio e dall'altezza del cilindro
coordinateSystem: Sistema di coordinate principale
radius: Radius size
height: Cylinder height
Returns: Cylinder created from radius and height
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Crea un cilindro solido a partire dal centro superiore e inferiore del cilindro.
startPoint: Start point of cylinder
endPoint: End point of cylinder
radius: Radius  of cylinder
Returns: Cylinder created by points and radius
cylinder,tube,by center points