Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Crea un BoundingBox allineato all'asse intorno alle geometrie di input.
geom: Geometries to determine bounding box
Returns: Bounding box enclosing geometries
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Ottiene l'intersezione di due BoundingBox
other: Other bounding box to intersect
Returns: Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Determina se due BoundingBox si intersecano
other: Other bounding box
Returns: Do bounding boxes intersect
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
Determina se il BoundingBox è vuoto
Returns: Returns true if the bounding box is empty