Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Crea un piano centrato nel punto radice, con il vettore normale di input.
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crea un piano "orientato" posizionato nell'origine del punto con il vettore come normale, ma con un orientamento specifico dell'asse X. Ciò non ha effetto sulle operazioni di suddivisione, intersezione, proiezione e così via, ma semplicemente specifica l'orientamento del CoordinateSystem di input.
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Gli assi X e Y si trovano sul piano. L'asse Z è il prodotto vettoriale dei due vettori.
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Adatta un piano ai punti di input. Si tratta in pratica di un adattamento 3D di un grafico di dispersione.
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Crea un piano contenente la linea di input e il punto esterno. Il punto non può trovarsi sulla linea o sull'asse della linea.
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
Crea un piano nel piano XY globale
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
Crea un piano nel piano XZ globale
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
Crea un piano nel piano YZ globale
Returns: Plane at YZ plane of world