Autodesk.DesignScript.Geometry.Properties.Resources.LowerModelerExtentExceeded
Cerca una stringa localizzata simile a Gli input sono fuori dell'intervallo di modellazione consentito. Prendere in considerazione la scelta dell'impostazione {0} con un intervallo di modellazione compreso tra {1} e {2} dalla finestra di dialogo "Impostazioni => Intervallo di lavoro geometria".

Autodesk.DesignScript.Geometry.Properties.Resources.UpperModelerExtentExceeded
Cerca una stringa localizzata simile a Gli input sono fuori dell'intervallo di modellazione consentito. Prendere in considerazione la scelta dell'impostazione {0} con un intervallo di modellazione compreso tra {1} e {2} dalla finestra di dialogo "Impostazioni => Intervallo di lavoro geometria".