Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Crea una superficie mediante loft tra curve di sezione trasversale di input.
crossSections: Curves to loft through
Returns: Surface created by loft
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Esegue il loft di una superficie mediante le sezioni trasversali con curve di guida date. Le curve di guida devono intersecare tutte le curve di sezione trasversale.
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Crea una superficie tramite estrusione su percorso di una curva di sezione trasversale lungo un percorso.
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea una superficie poligonale connettendo punti di input in un poligono chiuso e aggiungendo una superficie chiusa.
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Esegue l'estrusione su percorso della curva di sezione trasversale lungo un percorso definito da due guide
path: Il percorso di input lungo cui eseguire l'estrusione.
guideRail: Una guida per l'orientamento dell'estrusione.
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Crea una superficie eseguendo l'estrusione su percorso della curva di profilo attorno al raggio asse formato dal punto di origine nella direzione del vettore dell'asse, dall'angolo iniziale in gradi all'angolo di estrusione su percorso in gradi.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Crea una superficie mediante il riempimento di un contorno chiuso definito da curve di input.
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
Restituisce la normale della superficie in corrispondenza del punto di input sulla superficie stessa.
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Ottiene una rappresentazione NURBS della superficie, entro una tolleranza specifica. In determinate circostanze, questo metodo può restituire un valore di superficie approssimato.
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Ispessisce una superficie e crea un solido. L'estrusione avviene nella direzione delle normali su entrambi i lati della superficie.
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Ispessisce una superficie e crea un solido. L'estrusione avviene nella direzione delle normali su entrambi i lati della superficie. Se il parametro both_sides è true, la superficie viene ispessita su entrambi i lati.
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
Applica un offset alla superficie in direzione della normale e in base ad una distanza specificata.
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
Il sistema di coordinate restituito utilizza xAxis, yAxis e zAxis per rappresentare uDir, vDir e la normale. La lunghezza di xAxis, yAxis rappresenta le curvature.
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
Restituisce un CoordinateSystem allineato con le direzioni di curvatura principali.
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
Restituisce il vettore tangente U in corrispondenza dei parametri U e V specificati.
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
Restituisce il vettore tangente V in corrispondenza dei parametri U e V specificati.
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
Restituisce il vettore normale in corrispondenza dei parametri U e V specificati.
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
Restituisce le derivate in corrispondenza delle coordinate U e V di input.
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
Restituisce i vettori di direzione principali in corrispondenza dei parametri U e V.
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Restituisce una nuova superficie con la normale invertita. La superficie resta invariata.
Returns: Surface, which is the same as the input surface but with flipped normals