Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
Crea un IndexGroup che memorizza quattro indici
a: Index a
b: Index b
c: Index c
d: Index d
Returns: IndexGroup
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Crea un IndexGroup che memorizza tre indici
a: Index a
b: Index b
c: Index c
Returns: IndexGroup
tri,polygon,mesh,meshes