Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
Combinare determinate superfici T-Spline in una sola.
Le superfici potrebbero non essere collegate tra loro.
Se almeno una superficie è in modalità riquadro, anche la superficie di output sarà in quella modalità.
tSplineSurfaces: Superfici T-Spline da combinare
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Convertire una superficie T-Spline in solido o superficie, a seconda della forma
matchTopology: Determina cosa succede se il corpo risultante ha la stessa topologia della T-Spline
Returns: Entità topologia (solido o superficie)
tspline,brep,solid,surface