Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Definisce un vettore a partire da tre coordinate euclidee
x: Coordinata X
y: Coordinata Y
z: Coordinata Z
Returns: Vector created by coordinates
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Definisce un vettore a partire da tre coordinate euclidee e normalizza il vettore
x: Coordinata X
y: Coordinata Y
z: Coordinata Z
normalized: True per normalizzare il vettore, false per non normalizzarlo
Returns: Vector created by coordinates
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Definisce il prodotto scalare tra due vettori
vec: a second vector
Returns: Resulting dot product
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Determina se due vettori sono paralleli.
otherVector: Altro vettore
Returns: Returns True if the vectors are parallel; false otherwise.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Determina se due vettori sono quasi uguali. Un valore di tolleranza di 1e-5 specificato per gestire problemi di precisione.
otherVector: Altro vettore
Returns: Returns True if the vectors are almost equal; false otherwise.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Trasforma il vettore corrente mediante una matrice CoordinateSystem di input.
coordinateSystem: Sistema di coordinate utilizzato per trasformare il vettore
Returns: Transformed vector

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Ruota un vettore attorno ad un asse per un numero specifico di gradi
axis: Rotation axis vector
degrees: Number of degrees to rotate
Returns: Rotated vector
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Ruota un vettore intorno all'origine del piano e alla normale, per un numero specifico di gradi
plane: Piano di rotazione
degrees: Number of degrees to rotate
Returns: Rotated vector
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Adatta in scala il vettore intorno all'origine in modo uniforme
scale_factor: Scale factor
Returns: Scaled vector
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
Restituisce l'angolo tra i due vettori in gradi da 0 a 180.
otherVector: Other vector
Returns: Returns angle between the supplied vectors in degrees from 0 to 180.
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Restituisce l'angolo tra i due vettori in gradi da 0 a 360. Utilizza l'asse di rotazione per determinare la direzione dell'angolo.
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,