Autodesk.DesignScript.Geometry.Cuboid.ByLengths(System.Double,System.Double,System.Double)
Crea un cuboide con centro nell'origine del sistema di coordinate globali (WCS), con la larghezza, lunghezza e altezza specificate.
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Crea un cuboide con centro nel punto di input e con la larghezza, lunghezza e altezza specificate.
origin: Origin point
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Crea un cuboide con centro nell'origine del sistema di coordinate globali (WCS), con la larghezza, lunghezza e altezza specificate.
coordinateSystem: Sistema di coordinate principale (centro del cuboide)
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created from lengths
box,cube,cubebysize,bycoord,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Crea un cuboide che si estende dal punto più basso al più alto.
lowPoint: Corner low point of cuboid
highPoint: Corner high point of cuboid
Returns: Cuboind created by corners
box,cube,byminmax,by corners,by points,cubes