Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
Definisce un punto nel piano XY da due coordinate cartesiane. Il componente Z è 0.
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
Ottiene il punto di origine (0,0,0)
Returns: Origin point
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
Definisce un punto da tre coordinate cartesiane
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Definisce un punto da tre coordinate cartesiane nel sistema di coordinate dato
coordinateSystem: Sistema di coordinate principale
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
Elimina punti per escludere duplicati entro la tolleranza dei punti inclusi
points: Elenco di punti da cui eliminare duplicati
tolerance: Tolleranza utilizzata per l'eliminazione
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near