Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Crea un'elica. L'elica ruota sempre in senso orario intorno alla direzione dell'asse fornito. Se si guarda lungo la direzione dell'asse, si vedrà il punto che ruota in senso orario intorno all'asse, mentre si sposta lungo la curva nella direzione specificata dal parametro di incremento. Il passo è la distanza di spostamento dell'elica nella direzione dell'asse ad ogni rotazione. Questo valore può essere positivo o negativo.
axisPoint: Axis point
axisDirection: Axis direction vector
startPoint: Helix start point
pitch: Distance of the helix per each 360 degrees in the direction of the axis
angleTurns: How many turns in degrees
Returns: Helix created by axis
helix,screw,corkscrew,thread