Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Creare un arco che si avvicina meglio ad un gruppo di punti
points: Elenco di punti a cui adattare meglio l'arco
Returns: Arc created by best fit through points
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Crea un arco dal punto iniziale al punto finale con tangente iniziale al vettore
startPoint: Start point of arc
endPoint: End point of arc
startTangent: Start tangent direction vector
arc,tangent,arcs