Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
Механизм реализации типа геометрии.
hostType: Тип производных интерфейсов IGeometryEntity.
contructor: Делегат для построения геометрии.

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
Преобразование геометрии в заданном направлении по длине вектора
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Преобразование геометрии по заданным параметрам преобразования CoordinateSystem
Returns: Преобразованная геометрия

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Преобразование геометрии исходного объекта CoordinateSystem в новый
контекстный объект CoordinateSystem.
Returns: Преобразованная геометрия.
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Поворот объекта относительно нормали и начала координат плоскости на заданное
количество градусов
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
Неравномерное масштабирование относительно начала координат
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Неравномерное масштабирование относительно заданной плоскости
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Равномерное масштабирование вокруг заданной точки с использованием двух указанных точек в качестве скалярных компонентов.
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Масштабирование в одном измерении по основе и двум указанным точкам. Ось масштабирования определяется по линии между основой и точкой.
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Масштабирование в одном измерении по основе и 2-м указанным точкам. Две выбранные точки проецируются на основную плоскость для определения факторов двумерного масштабирования.
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
Получение расстояния от этой геометрии до другой
other: Другая геометрия
Returns: Расстояние
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
Получение ближайшей точки на данной геометрии к соседней
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
Определите, пересекается ли данный геометрический объект с другим
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
Получение геометрии пересечения данного объекта с другим
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Получение пересечения геометрии данного объекта с набором других геометрических объектов. Поиск общей геометрии для всех задействованных элементов.
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
Разделение данной геометрии при помощи другой геометрии в качестве инструмента обрезки
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
Установите флажок, если для двух объектов имеется одинаковая наглядная геометрия или одинаковые числовые значения
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
Получение объекта BoundingBox, содержащего данный элемент геометрии
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
Преобразование геометрии в тело формата DEF JSON
Returns: Строка формата JSON

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
Импорт файла SAT и возврат массива импортированных объектов геометрии
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
Импорт файла SAT и получение массива импортированных объектов геометрии
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
Экспорт выбранных объектов геометрии в указанный файл SAT
filePath: Имя файла для экспорта геометрии в

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
Экспорт выбранных объектов геометрии в указанный файл SAT
filePath: Имя файла для экспорта геометрии в
unitsMM: Единицы для использования

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String,System.Double)
Экспорт списка выбранных объектов геометрии в указанный файл SAT

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
Индексация указанной геометрии в стандартный формат ACIS Binary (SAB) и получением индексированных данных двоичного потока

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Индексация списка элементов указанной геометрии в стандартный формат ACIS Binary (SAB) и получением индексированных данных двоичного потока
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
Получение контекстной/опорной системы координат, которая использовалась для создания данной геометрии.