Autodesk.DesignScript.Geometry.Face.ToString
Получение строчного представления грани

Autodesk.DesignScript.Geometry.Face.SurfaceGeometry
Базовая поверхность, образующая грань
Returns: Surface representation of face