Autodesk.DesignScript.Geometry.Vector.ToString
Получение строчного представления вектора

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Сравнение двух векторов:
other: Другой вектор
Returns: Являются ли два объекта одинаковыми

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
Получение хэш-кода для данного типа
Returns: Уникальный хэш-код для данного объекта

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Построение вектора на основе 3 евклидовых координат
x: Координата X
y: Координата Y
z: Координата Z
Returns: Vector created by coordinates
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Построение вектора на основе 3 евклидовых координат и нормализация вектора
x: Координата X
y: Координата Y
z: Координата Z
normalized: Значение true для нормализации вектора, в противном случае — false
Returns: Vector created by coordinates
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Построение вектора на основе 2-х конечных точек. В результате получается вектор от начальной до конечной точки.
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
Получение канонического вектора оси X (1; 0; 0)
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
Получение канонического вектора оси Y (0; 1; 0)
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
Получение канонического вектора оси Z (0; 0; 1)
z,basis,up

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Получение скалярного произведения двух векторов
vec: a second vector
Returns: Resulting dot product
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Определение того, параллельны ли два вектора.
otherVector: Другой вектор
Returns: Returns True if the vectors are parallel; false otherwise.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Определение того, являются ли два вектора почти равными. Значение допуска 1e-5, заданное для устранения проблем, связанных с точностью.
otherVector: Другой вектор
Returns: Returns True if the vectors are almost equal; false otherwise.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Преобразование этого вектора с помощью входной матрицы CoordinateSystem.
coordinateSystem: Система координат, используемая для преобразования вектора
Returns: Transformed vector

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Поворот вектора вокруг оси с заданным значением кривизны
axis: Rotation axis vector
degrees: Number of degrees to rotate
Returns: Rotated vector
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Поворот вектора относительно нормали и начала координат плоскости на заданное
количество градусов
plane: Плоскость вращения
degrees: Number of degrees to rotate
Returns: Rotated vector
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Равномерное масштабирование вектора относительно начала координат
scale_factor: Scale factor
Returns: Scaled vector
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
Возврат угла между двумя векторами в диапазоне от 0 до 180 градусов.
otherVector: Other vector
Returns: Returns angle between the supplied vectors in degrees from 0 to 180.
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
Получение угла между двумя векторами в следующем диапазоне градусов: [0, 180].
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Возврат угла между двумя векторами в диапазоне от 0 до 360 градусов. Для определения направления угла используется ось вращения.
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Получение угла между двумя векторами в следующем диапазоне градусов: [0, 360]. Для определения направления угла используется ось вращения.
rotation angle