Autodesk.DesignScript.Geometry.Line.ToString
Получение строчного представления линии

Autodesk.DesignScript.Geometry.Line.ByStartPointEndPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Построение прямой линии между двумя точками ввода.
startPoint: Line start point
endPoint: Line end point
Returns: Line from start and end point
line,linebypoints,lines

Autodesk.DesignScript.Geometry.Line.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Создание линии, максимально приближенной к графику рассеяния точек.
bestFitPoints: List of points to best fit line
Returns: Line from fit through points
line,approximate,lines

Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Создание линии, касательной к исходной кривой, расположенной в точке параметра исходной кривой.
curve: Base curve for tangent line
parameter: Parameter value
Returns: Tangent line
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Построение прямой линии заданной длины, начинающейся в начальной точке и проходящей в направлении вектора.
startPoint: Line start point
direction: Direction vector
length: Length of line
Returns: Line from start direction and length
linebyvector,lines