Autodesk.DesignScript.Geometry.IndexGroup.ToString
Получение строчного представления объекта IndexGroup

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
Сравнение двух объектов IndexGroup
other: Другие объекты IndexGroup
Returns: Являются ли два объекта одинаковыми

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
Получение хэш-кода для данного типа
Returns: Уникальный хэш-код для данного объекта

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
Создание объекта IndexGroup, содержащего четыре индекса
a: Index a
b: Index b
c: Index c
d: Index d
Returns: IndexGroup
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Создание объекта IndexGroup, содержащего три индекса
a: Index a
b: Index b
c: Index c
Returns: IndexGroup
tri,polygon,mesh,meshes