Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
Получение строчного представления системы координат

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
Создание объекта CoordinateSystem с началом координат во входной точке с осями
X и Y, соответствующими осям X и Y МСК.
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Создание объекта CoordinateSystem в начале системы координат X и Y, в которой
ось Z полностью игнорируется. Векторы ввода перед созданием
объекта CoordinateSystem нормализуются.
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Создание объекта CoordinateSystem с заданными параметрами цилиндрических координат относительно указанной системы координат

Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Создание объекта CoordinateSystem с заданными параметрами сферических координат относительно указанной системы координат

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
Определите, возможно ли можно выполнить инверсию для данной CoordinateSystem
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
Проверка ортогональности масштабирования, а именно наличия компонента сдвига.
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
Проверка ортогональности масштабирования и нормализации всех векторов.
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
Создание точки, обозначающей система начало координат CoordinateSystem.
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
Получение оси X для CoordinateSystem.
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
Получение оси Y для CoordinateSystem.
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
Получение оси Z для CoordinateSystem.
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
Получение масштабирования оси X для объекта CoordinateSystem: длина вектора оси X.

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
Получение масштабирования оси Y для объекта CoordinateSystem: длина вектора оси Y.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
Получение масштабирования оси Z для объекта CoordinateSystem: длина вектора оси Z.

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
Получение инверсии объекта CoordinateSystem: применение данного объекта CoordinateSystem к элементу геометрии обращает исходный объект.

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Применение аргумента CoordinateSystem после следующего: результат = этот*другой

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Применение аргумента CoordinateSystem перед следующим: результат = другой*этот

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
Получение вектора, для которого указаны масштабные коэффициенты по X, Y и Z
Returns: Масштабированный вектор
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
Определите, равны ли CoordinateSystems
other: другая система координат
Returns: возврат значения true, если системы координат равны

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
Преобразование любого объекта CoordinateSystem в соответствии с указанными
перемещениями в направлениях X, Y и Z, определенных в МСК.
xTranslation: Перемещение вдоль оси X.
yTranslation: Перемещение вдоль оси Y.
zTranslation: Перемещение вдоль оси Z.
Returns: Преобразованный объект CoordinateSystem.
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
Преобразование объекта в направлении входного вектора в соответствии с его величиной.
direction: Вектор направления преобразования
Returns: Преобразованная система координат
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Преобразование любого типа CoordinateSystem по заданному расстоянию в указанном
направлении.
direction: Вектор направления перемещения
distance: Расстояние перемещения вдоль заданного направления
Returns: Преобразованная система координат
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Преобразование данного объекта CoordinateSystem из исходного объекта CoordinateSystem
в новый контекстный объект CoordinateSystem.
Returns: Преобразованный элемент CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Поворот объекта вокруг начала координат и оси на заданное количество градусов
origin: Исходная точка
axis: Векторная ось для поворота
degrees: Градусы поворота
Returns: Повернутая система координат
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Поворот объекта вокруг нормали и начала координат плоскости на заданное
количество градусов
plane: Плоскость для получения нормали
degrees: Значение поворота в градусах
Returns: Повернутая система координат
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
Равномерное масштабирование относительно начала координат
amount: Величина масштабирования
Returns: Масштабированная система координат
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
Неравномерное масштабирование относительно начала координат
xamount: Величина масштабирования по оси X
yamount: Величина масштабирования по оси Y
zamount: Величина масштабирования по оси Z
Returns: Масштабированная система координат
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Неравномерное масштабирование относительно заданной плоскости
plane: Плоскость, вокруг которой выполняется масштабирование
xamount: Величина масштабирования по оси X
yamount: Величина масштабирования по оси Y
zamount: Величина масштабирования по оси Z
Returns: Масштабированная система координат
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Равномерное масштабирование относительно заданной точки при использовании
basePoint: Базовая точка масштабирования
from: Начальная точка масштабирования
to: Конечная точка масштабирования
Returns: Масштабированная система координат
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Масштабирование в одном измерении путем использования базовой точки, начальной (от) и конечной (до) точек. Ось масштабирования определяется по линии между базовой и начальной точками.
basePoint: Базовая точка масштабирования
from: Начальная точка масштабирования
to: Конечная точка масштабирования
Returns: Масштабированная система координат
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Масштабирование в одном измерении по основе и 2-м указанным точкам. Две выбранные точки проецируются на основную плоскость для определения факторов двумерного масштабирования.
basePlane: Базовая точка масштабирования
from: Начальная точка масштабирования
to: Конечная точка масштабирования
Returns: Масштабированная система координат
resize,size,from,to,scale2d,2d