Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
Получение строчного представления TSplineReflection

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
Создание радиального отражения для симметрии Т-сплайна по заданной плоскости с заданными сегментами и углами (в градусах) между каждой парой сегментов.
plane: Плоскость, нормалью которой является ось для радиального отражения Т-сплайна. В мировых координатах
segmentsCount: Количество сегментов радиального отражения
segmentAngle: Угол между каждой парой сегментов радиальной симметрии (в градусах). Если задано значение 0, он определяется следующим образом: (360/количество сегментов)
Returns: Радиальное отражение Т-сплайна
tspline,symmetry,reflection,radial