Autodesk.DesignScript.Geometry.EllipseArc.ToString
Получение строчного представления объекта EllipseArc

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Создание объекта EllipseArc в плоскости с заданными значениями радиусов вдоль осей X и Y и углами сдвига
plane: Плоскость, на которой содержится дуга эллипса
xRadius: Радиус объекта EllipseArc в направлении X плоскости
yRadius: Радиус объекта EllipseArc в направлении Y плоскости
startAngle: Начальный угол дуги, измеренный по положительной оси X входной плоскости
sweepAngle: Угол сдвига от начального угла в градусах
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiStartAngleSweepAngle(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Создание объекта EllipseArc в плоскости с заданными значениями радиусов вдоль осей X и Y и углами сдвига
plane: Плоскость объекта EllipseArc содержится в
xRadius: Радиус объекта EllipseArc в направлении X плоскости
yRadius: Радиус объекта EllipseArc в направлении Y плоскости
startAngle: Начальный угол дуги, измеренный по положительной оси X входной плоскости
sweepAngle: Угол сдвига от начального угла в градусах
ellipsearc,arcs