Autodesk.DesignScript.Geometry.Polygon.ToString
Получение строчного представления полигона

Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Проверка того, находится ли точка внутри плоского полигона без самопересечений.