Autodesk.DesignScript.Geometry.Surface.ToString
Получение строчного представления поверхности

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Объединение коллекции поверхностей в одну поверхность. Этот метод может вернуть объект polySurface, если полученное объединение будет неразветвленным или многогранным.
surfaces: Коллекция поверхностей.
Returns: Объединение поверхностей
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Создание поверхности посредством лофтинга между входными кривыми поперечного сечения.
crossSections: Curves to loft through
Returns: Surface created by loft
loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
Создание поверхности посредством лофтинга между входными линиями поперечного сечения. Этот процесс немного быстрее, но при этом он дает менее четкий результат, чем при использовании Surface.ByLoft.
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Лофтинг поверхности через поперечные сечения с использованием заданной направляющей кривой. Направляющая кривая должна пересекать все кривые поперечного сечения.
loftbyrail

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Лофтинг поверхности через поперечные сечения с использованием заданных направляющих кривых. Направляющие кривые должны пересекать все кривые поперечного сечения.
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Создание поверхности путем сдвига кривой поперечного сечения вдоль траектории.
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Создание поверхности полигона, соединяющей входные точки в замкнутом полигоне и замыкающей его.
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Сдвиг поперечного сечения кривой вдоль траектории по двум направляющим
path: Путь ввода для сдвига.
guideRail: Направляющая для ориентации сдвига.
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Создание поверхности путем сдвига кривой профиля вокруг луча оси, представляющего собой вектор оси с началом в точке значения start_angle в градусах, заканчивающийся значением sweep_angle в градусах.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Создание поверхности путем заполнения пространства внутри замкнутой границы, определяемой входными кривыми.
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Логическая разность данной поверхности и объединения поверхностей ввода. Этот метод может вернуть объект polySurface, если полученный логический объект будет неразветвленным или многогранным.
others: Другие поверхности для вычитания
Returns: Итоговая логическая поверхность или сложная поверхность
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Обрезка поверхности с помощью коллекции одного или нескольких контуров в рамках входной поверхности. Один из контуров должен быть граничным контуром входной поверхности. Кроме того, необходимо добавить один или несколько внутренних контуров для отверстий.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
Получение нормали поверхности при вводе точки на поверхности.
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
Получение представления NURBS для поверхности. При использовании данного метода можно в определенных условиях аппроксимировать поверхность.

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Получение представления NURBS для поверхности в пределах заданного допуска. При использовании данного метода можно в определенных условиях аппроксимировать поверхность.
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Утолщение поверхности до формирования тела с выдавливанием в направлении нормалей поверхности с обеих сторон поверхности.
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Утолщение поверхности до формирования тела с выдавливанием в направлении нормалей поверхности. Если для параметра both_sides установлено значение «истина», поверхность будет утолщена с обеих сторон.
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
Смещение поверхности в направлении нормали поверхности на заданное расстояние.
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
В полученной системе координат используются параметры xAxis, yAxis и zAxis для обозначения uDir, vDir и нормали. Длина xAxis и yAxis обозначает величину кривизны.
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
Получение объекта CoordinateSystem, выровненного по основным направлениям кривизны.
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
Получение вектора касательной U при заданных параметрах U и V.
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
Получение вектора касательной V при заданных параметрах U и V.
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
Получение вектора нормали с заданными параметрами U и V.
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
Получение производных при вводе координат U и V.
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
Получение основных векторов направления для параметров U и V.
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
Создание параметрической кривой на заданной поверхности. Создание кривой, представляющей параметрическую линию U или V на поверхности. Параметрическая линия проходит в направлении увеличения значений параметров U или V при постоянном противоположном значении параметров U и V. Результирующая кривая будет совпадать с параметризацией поверхности, а диапазон ее значений зависит от диапазона значений параметров поверхности. Полученный тип кривой зависит от типа поверхности.
isoDirection: Если направление == 0, создается параметрическая линия U, если направление == 1, создается параметрическая линия V.
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Получение новой поверхности с перевернутой нормалью. Поверхность при этом остается без изменений.
Returns: Surface, which is the same as the input surface but with flipped normals

Autodesk.DesignScript.Geometry.Surface.Join(Autodesk.DesignScript.Geometry.Surface)
Объединение этой поверхности и поверхности ввода в одну сложную поверхность
topolysurface

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Объединение этой поверхности и поверхностей ввода в одну сложную поверхность
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Проецирование входного объекта геометрии на текущую поверхность в направлении заданного вектора. В настоящее время этот метод проецирования поддерживает только точки и кривые.
projecttosurface,projectonto