Autodesk.DesignScript.Geometry.Cuboid.ToString
Получение строчного представления кубоида

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(System.Double,System.Double,System.Double)
Создание кубоида, центрированного по началу координат МСК,с определенной шириной, длиной и высотой.
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Создание кубоида, центрированного по входной точке, с определенной шириной, длиной и высотой.
origin: Origin point
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Создание кубоида, центрированного по началу координат МСК, с определенной шириной, длиной и высотой.
coordinateSystem: Родительская система координат (центр кубоида)
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created from lengths
box,cube,cubebysize,bycoord,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Создание пролета кубоида от нижней до верхней точки.
lowPoint: Corner low point of cuboid
highPoint: Corner high point of cuboid
Returns: Cuboind created by corners
box,cube,byminmax,by corners,by points,cubes

Autodesk.DesignScript.Geometry.Cuboid.Length
Возврат значения длины.                         Примечание: возвращаются входные значения кубоида, а не                  действительные размеры в мировом пространстве. Другими словами, если создать кубоид                   шириной (по оси X) и длиной 10 и преобразовать его в объект CoordinateSystem с                   2-кратным масштабированием по оси X, значение ширины останется неизменным и будет составлять 10. В ASM не допускается                   извлекать вершины тела в любом прогнозируемом порядке, поэтому                    невозможно будет определить размеры после преобразования.

Autodesk.DesignScript.Geometry.Cuboid.Width
Возврат значения ширины.                         Примечание: возвращаются входные значения кубоида, а не                  действительные размеры в мировом пространстве. Другими словами, если создать кубоид                   шириной (по оси X) и длиной 10 и преобразовать его в объект CoordinateSystem с                   2-кратным масштабированием по оси X, значение ширины останется неизменным и будет составлять 10. В ASM не допускается                   извлекать вершины тела в любом прогнозируемом порядке, поэтому                    невозможно будет определить размеры после преобразования.

Autodesk.DesignScript.Geometry.Cuboid.Height
Возврат значения высоты.                         Примечание: возвращаются входные значения кубоида, а не                  действительные размеры в мировом пространстве. Другими словами, если создать кубоид                   шириной (по оси X) и длиной 10 и преобразовать его в объект CoordinateSystem с                   2-кратным масштабированием по оси X, значение ширины останется неизменным и будет составлять 10. В ASM не допускается                   извлекать вершины тела в любом прогнозируемом порядке, поэтому                    невозможно будет определить размеры после преобразования.