Autodesk.DesignScript.Geometry.Properties.Resources.LowerModelerExtentExceeded
Поиск локализованной строки, подобной строке «Введенные данные находятся за пределами допустимого диапазона моделирования. Попробуйте выбрать параметр {0} с диапазоном моделирования между {1} и {2} в диалоговом окне «Параметры» => «Рабочий диапазон геометрии».

Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
Поиск локализованной строки, подобной строке «Превышены допустимые границы моделирования, попробуйте указать меньшие значения».

Autodesk.DesignScript.Geometry.Properties.Resources.UpperModelerExtentExceeded
Поиск локализованной строки, подобной строке «Введенные данные находятся за пределами допустимого диапазона моделирования. Попробуйте выбрать параметр {0} с диапазоном моделирования между {1} и {2} в диалоговом окне «Параметры» => «Рабочий диапазон геометрии».