Autodesk.DesignScript.Geometry.Curve.ToString
Получение строчного представления кривой

Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
Создание кривой по линии поверхности в UV-пространстве
baseSurface: Поверхность для использования
startParams: Точка UV-пространства, в которой начинается кривая
endParams: Точка UV-пространства, в которой кончается кривая
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Создание кривой, переходящей из одной в другую кривую
curve1: Первую кривую для перехода
curve2: Вторая кривая для перехода
endOrStart1: флажок для определения того, какой конец кривой1 будет переходящим
endOrStart2: флажок для определения того, какой конец кривой1 будет переходящим
isG2Continuous: флажок для определения того, к какой непрерывности принадлежит результирующая кривая (G1 или G2)
Returns: Итоговая кривая из перехода двух кривых
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
Создание кривой по изолинии поверхности
baseSurface: Базовая поверхность
direction: если 0 - изолиния идет по направлению U, если 1 - по направлению V
parameter: фиксируется для значения кривой других параметров поверхности
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
Получение элемента CoordinateSystem с началом координат в точке при заданном параметре. Ось X выравнивается по нормали кривой, ось Y — по прямому участку кривой в данной точке, а ось Z — по вектору вверх или бинормали в этой точке
param: Параметр для оценки
Returns: Система координат в параметре кривой
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
Получение плоскости, нормаль которой выравнивается по прямому участку кривой. Параметры настраиваются таким образом, что начальная точка всегда имеет значение 0, а конечная — 1.
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtDistance(System.Double)
Получение точки при определенной длине дуги вдоль кривой
segmentLength: Расстояние вдоль кривой, для которого выполняется оценка
Returns: Точка с заданной длиной дуги
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
Получение точек, размещенных по длине хорды с равными интервалами на основе введенного количества делений
divisions: Число делений
Returns: Точки с равным интервалом по длине кривой

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
Получение точек, размещенных на кривой с равной длиной хорды на основе введенного количества делений
divisions: Число делений
Returns: Список точек на кривой

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Получение точек, размещенных на кривой с равным интервалом, с заданной длиной сегмента от указанной точки
point: Опорная точка, от которой требуется выполнить измерение
segmentLength: Расстояние вдоль кривой, для которого выполняется оценка
Returns: Список точек на кривой

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Получение точек, расположенных на кривой с заданной длиной хорды от указанной точки
point: Опорная точка, от которой требуется выполнить измерение
chordLength: Длина хорды
Returns: Список точек на кривой

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
Получение элемента CoordinateSystem на заданное расстояние от начальной точки кривой. Ось Y расположена по касательной к кривой, а ось X представляет собой кривизну.
segmentLength: Расстояние вдоль кривой, для которого выполняется оценка
Returns: CoordinateSystem для кривой
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtDistance(System.Double)
Получение элемента CoordinateSystem на заданное расстояние от начальной точки кривой. Ось Y расположена по касательной к кривой, а ось X представляет собой кривизну.
segmentLength: Расстояние вдоль кривой, для которого выполняется оценка
Returns: CoordinateSystem на кривой
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
Получение плоскости на заданное расстояние вдоль кривой от начальной точки. Нормаль плоскости выравнивается по прямому участку кривой.
segmentLength: Расстояние вдоль кривой, для которого выполняется оценка
Returns: Плоскость на кривой
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PlaneAtDistance(System.Double)
Получение плоскости на заданное расстояние вдоль кривой от начальной точки. Нормаль плоскости выравнивается по прямому участку кривой.
segmentLength: Расстояние вдоль кривой, для которого выполняется оценка
Returns: Плоскость на кривой
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
Получение длины сегмента, измеренной от начальной точки кривой до указанного параметра.
param: Значение от 0 до 1
Returns: Длина сегмента
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtDistance(System.Double)
Получение параметра при определенной длине дуги вдоль кривой.
segmentLength: Расстояние вдоль кривой, для которого выполняется оценка
Returns: Параметр
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.LengthBetweenParameters(System.Double,System.Double)
Получение длины дуги между двумя значениями точки на кривой
startParam: Начало области
endParam: Конец области
Returns: Длина дуги между двумя параметрами
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Получение параметра в указанной точке вдоль кривой. Если точка не находится на кривой, выполняется получение ближайшего параметра. Если входная кривая является объектом PolyCurve, эта функция возвращает допустимый параметр только при условии, что объект Point лежит на объекте PolyCurve. Для других типов кривых эта функция возвращает параметр относительно кривой, которая расположена в точке, ближайшей к входной.
point: Точка на кривой или рядом с ней
Returns: Параметр на кривой для объектов PolyCurve или ближайший параметр вдоль кривой для кривых другого типа.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.DivideEqually(System.Int32)
Разделение кривой на заданное количество кривых равной длины
divisions: Число делений
Returns: Массив кривых после разделения
chopcurve,segment,slices

Autodesk.DesignScript.Geometry.Curve.DivideByDistance(System.Int32)
Разделение кривой на заданное количество кривых с одинаковым расстоянием от начала до конца каждой из кривой (равные хорды).
divisions: Число делений
Returns: Массив кривых после разделения
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByLengthFromParameter(System.Double,System.Double)
Разделение кривой на кривые заданной длины, измеряемой от заданного местоположения параметра
length: Длина кривых после разделения
parameter: Местоположение параметра для измерения от
Returns: Массив кривых после разделения
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByDistanceFromParameter(System.Double,System.Double)
Разделение кривой на кривые с заданной длиной хорды, измеряемой от заданного местоположения параметра
distance: Длина хорды для каждой кривой, полученной при разделении
parameter: Местоположение параметра для измерения от
Returns: Массив кривых после разделения
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimStart(System.Double)
Удаление начала кривой с заданным параметром
startParameter: Параметр, с которого начинается обрезка
Returns: Новая кривая с удаленным началом
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimEnd(System.Double)
Удаление конца кривой с заданным параметром
endParameter: Параметр, с которого начинается обрезка
Returns: Новая кривая с удаленным концом
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrim(System.Double,System.Double)
Удаление начала и конца кривой при заданных параметрах.
startParameter: Параметр, с которого начинается обрезка
endParameter: Параметр, с которого начинается обрезка
Returns: Новая кривая с удаленным наружным сегментом
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.ParameterTrimInterior(System.Double,System.Double)
Удаление внутренней части кривой с заданными параметрами
startParameter: Параметр, с которого начинается обрезка
endParameter: Параметр, с которого начинается обрезка
Returns: Новая кривая с удаленным внутренним сегментом
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimSegments(System.Double[])
Удаление нескольких сегментов кривой, пропуская 1-й, 3-е, 5-й сегменты и т. д.
parameters: Список параметров для разделения кривой
Returns: Массив кривых, в котором пропущены 1-й, 3-й, 5-й и т.д. сегменты
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
Удаление нескольких сегментов кривой, пропуская 2-й, 4-й, 6-й сегменты и т. д., если для лог. операции установлено значение true
parameters: Список параметров для разделения кривой
discardEvenSegments: Переключатель для пропуска четных сегментов
Returns: Массив кривых, в котором пропущены 2-й, 4-й, 6-й и т.д. сегменты
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double)
Разделение кривой на две части с заданным параметром
parameter: Параметр, с которого выполняется разделение
Returns: После разделения образуются две кривые
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double)
Разделение кривой на две части с заданным параметром
parameter: Параметр, с которого выполняется разделение
Returns: После разделения образуются две кривые
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double[])
Разделение кривой на несколько элементов с заданными параметрами
parameters: Список параметров для разделения кривой
Returns: Кривые, полученные путем разделения
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Соединение набора кривых с концом сложной кривой. Положение кривых изменяется для обеспечения возможности соединения.
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany

Autodesk.DesignScript.Geometry.Curve.Join(Autodesk.DesignScript.Geometry.Curve)
Объединение данной кривой с входной кривой в новый объект PolyCurve с сохранением исходных кривых.
curve: Кривая для объединения
Returns: Объект PolyCurve, созданный из двух кривых
convertcurve,curve2polycurve,joincurve,concat

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
Удлинение кривой на заданное расстояние с заданного конца, определяемого точкой выбора. Кривая удлиняется с указанной стороны. Замкнутые кривые, например круги и эллипсы, нельзя удлинить.
distance: Расстояние для удлинения
pickSide: Точка на конце для удлинения
Returns: Удлиненная кривая
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
Удлинение кривой на заданное расстояние с начальной стороны. Замкнутые кривые, например круги и эллипсы, нельзя удлинить.
distance: Расстояние для удлинения
Returns: Удлиненная кривая
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
Удлинение кривой на заданное расстояние с определенного конца. Замкнутые кривые, например круги и эллипсы, нельзя удлинить.
distance: Расстояние для удлинения
Returns: Удлиненная кривая
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Проецирование входной кривой вдоль указанного направления проекции на указанную базовую геометрию. Геометрия для проецирования на список векторов объектов геометрии, спроецированных на базовую геометрию