Autodesk.DesignScript.Geometry.Rectangle.ToString
Получение строчного представления прямоугольника

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Построение прямоугольника по четыре угловым точкам.
points: List of corner points of rectangle
Returns: Rectangle created by corner points
rectbypointarray

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Построение прямоугольника по четыре угловым точкам.
p1: 1st corner point of rectangle
p2: 2nd corner point of rectangle
p3: 3rd corner point of rectangle
p4: 4th corner point of rectangle
Returns: Rectangle created by corner points
rectbypoints

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Построение прямоугольника, центрированного в начале координат МСК в плоскости XY МСК с заданной шириной (расстояние по оси X) и длиной (расстояние по оси Y).
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Построение прямоугольника, центрированного в корне входной плоскости с входной шириной (расстояние по оси плоскости X) и длиной (расстояние по оси плоскости Y).
plane: Plane used to center rectangle
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Построение прямоугольника, центрированного во входном начале координат CoordinateSystem в плоскости XY с заданной шириной (расстояние по оси X) и длиной (расстояние по оси Y).
coordinateSystem: Система координат прямоугольника (центр прямоугольника)
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created from width and length
rectbylengths