Autodesk.DesignScript.Geometry.NurbsCurve.ToString
Получение строчного представления объекта NurbsCurve

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Создание элемента BSplineCurve с помощью точных управляющих точек. Примечание 1: В объектах BSplineCurve со значением кривизны = 1 имеются точки разрыва G1, приводящие к проблемам при выдавливании, сдвиге и выполнении других операций. Их следует избегать. Используйте вместо них объекты PolyCurve. Примечание 2: если кривая является периодической (замкнутой), первые и последние точки должны совпадать.
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Создание элемента BSplineCurve с помощью точных управляющих точек. Примечание 1: В объектах BSplineCurve со значением кривизны = 1 имеются точки разрыва G1, приводящие к проблемам при выдавливании, сдвиге и выполнении других операций. Их следует избегать. Используйте вместо них объекты PolyCurve. Примечание 2: если кривая является периодической (замкнутой), первые и последние точки должны совпадать.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Создание элемента BSplineCurve с помощью точных управляющих точек. Примечание 1: В объектах BSplineCurve со значением кривизны = 1 имеются точки разрыва G1, приводящие к проблемам при выдавливании, сдвиге и выполнении других операций. Их следует избегать. Используйте вместо них объекты PolyCurve. Примечание 2: если кривая является периодической (замкнутой), первые и последние точки должны совпадать.
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
Создание элемента BSplineCurve с заданными управляющими вершинами, весом и узлами. Далее следует информация из документов ASM. Кривизна: значения U и V должны быть > = 1 (кусочно-линейный сплайн) и меньше 26 (максимальное базовое значение кривизны B-сплайна, поддерживаемое ASM). Вес линий: Все значения веса (если указаны) должны быть только положительными. Вес меньше 1e-11 будет отклонен и выполнение функций будет невозможно.  Узлы: оба вектора узлов должны составлять неубывающую последовательность. Множество внутренних узлов не должно быть больше значения кривизны + 1 в начале/конце узла и кривизны внутреннего узла (таким образом, возможно представление поверхностей с точками разрыва G1). Обратите внимание на то, что несмотря на то что поддерживаются векторы узлов без фиксации, они будут преобразованы в фиксированные наряду с соответствующими изменениями применительно к данным управляющих точек/веса. Массив узла: размер массива рассчитывается по формуле num_control_points + degree + 1
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Создание элемента BSplineCurve путем интерполяции между точками.
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Создание элемента BSplineCurve путем интерполяции между точками. Примечание 2: если кривая является периодической (замкнутой), первые и последние точки должны совпадать.
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Создание элемента BSplineCurve путем интерполяции между точками с определенным значением кривизны.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Получение объекта BSplineCurve через точки с направлениями касательных.
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
Получение управляющих точек NurbsCurve. Эти точки являются точками интерполяции кривой.
Returns: Массив точек

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
Узлы кривой. Узлы представляют собой серию значений параметров (двойных значений), используемых для определения места и способа воздействия управляющих точек на кривую.
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
Возврат весов управляющих точек объекта NurbsCurve. Веса определяют влияние каждой управляющей точки на форму кривой.
Returns: Weights of nurbs curve
ptweight