Autodesk.DesignScript.Geometry.Cone.ToString
Получение строчного представления конуса

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Создание конуса с заданным радиусом основания в начальной точке и вершиной в конечной точке.
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Создание конуса, ось которого начинается в начальной точке и заканчивается в конечной, с заданными значениями радиуса в начале и конце. Данный объект не имеет вершины, и его можно рассматривать как усеченный конус.
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Создание конуса с базовой точкой в начале координат CoordinateSystem, удлиняющегося на заданное значение длины в направлении оси Z CoordinateSystem, с круговым основанием в плоскости XY CoordinateSystem.

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Создание конуса с базовой точкой в начале координат CoordinateSystem, удлиняющегося на заданное значение длины в направлении оси Z CoordinateSystem, с круговым основанием в плоскости XY CoordinateSystem.
cone,cone by height,cones