Autodesk.DesignScript.Geometry.Plane.ToString
Получение строчного представления плоскости

Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Создание плоскости, центрированной по корневой входной точке с входным вектором нормали.
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Создание ориентированной плоскости, расположенной в точке начала координат с вектором нормали, но с особой ориентацией оси X. Это никак не влияет на разделение, пересечение, проецирование и другие операции; с помощью этого определяется ориентация входного объекта CoordinateSystem.
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Оси X и Y лежат в плоскости. Ось Z является векторным произведением двух векторов.
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Вписывание плоскости во входные точки — по сути, это вписывание в трехмерный график рассеяния.
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Создание плоскости, содержащей линию ввода и внешнюю точку. Точка не может находиться на линии или на соответствующей оси.
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
Создание плоскости в XY МСК
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
Создание плоскости в XZ МСК
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
Создание плоскости в YZ МСК
Returns: Plane at YZ plane of world

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
Построение нового элемента CoordinateSystem, обозначающего эту плоскость. Он состоит из начала координат и осей X и Y.
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
Создание нового смещения плоскости данной плоскостью в направлении нормали на заданное расстояние.
alongnormal,moveplane