Autodesk.DesignScript.Geometry.Helix.ToString
Получение строчного представления спирали

Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Создание спирали. Спираль всегда вращается по часовой стрелке вокруг указанной оси. При просмотре по направлению оси будет видна точка поворота по часовой стрелке вокруг оси при перемещении вдоль кривой в направлении увеличения параметра. Шаг – это расстояние, на которое спираль перемещается в направлении оси, проходя одну петлю. Его значение может быть как положительным, так и отрицательным.
axisPoint: Axis point
axisDirection: Axis direction vector
startPoint: Helix start point
pitch: Distance of the helix per each 360 degrees in the direction of the axis
angleTurns: How many turns in degrees
Returns: Helix created by axis
helix,screw,corkscrew,thread