Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
Получение строчного представления TSplineSurface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайновой ориентированной плоскости, расположенной в точке начала координат с вектором нормали, но с особой ориентацией оси X.
Это никак не влияет на разделение, пересечение, проецирование и другие операции — с помощью этого определяется ориентация входного объекта CoordinateSystem.
origin: Корневая точка плоскости
normal: Нормаль плоскости
xAxis: Ось X плоскости
minCorner: 2D-точка минимального угла в координатах плоскости
maxCorner: 2D-точка максимального угла в координатах плоскости
xSpans: Количество пролетов по ширине
ySpans: Количество пролетов по длине
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Плоская Т-сплайновая поверхность
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание плоскости по началу координат и осям X, Y.
Ось Z является векторным произведением двух векторов.
origin: Корневая точка плоскости
xAxis: Ось X плоскости
yAxis: Ось Y плоскости
minCorner: 2D-точка минимального угла в координатах плоскости
maxCorner: 2D-точка максимального угла в координатах плоскости
xSpans: Количество пролетов по ширине
ySpans: Количество пролетов по длине
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Плоская Т-сплайновая поверхность
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайнового конуса, ось которого пролегает от начальной до конечной точки, с заданным радиусом в начале и конце.
Этот объект не имеет вершины и создан в форме усеченного конуса.
startPoint: Начальная точка конуса
endPoint: Конечная точка конуса
startRadius: Начальный радиус конуса
endRadius: Конечный радиус конуса
radiusSpans: Количество пролетов в окружности
heightSpans: Количество пролетов по высоте
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Коническая Т-сплайновая поверхность
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайнового конуса с базовой точкой в начале координат CoordinateSystem, который продолжается
в направлении оси Z объекта CoordinateSystem, с круглым основанием в плоскости XY объекта
CoordinateSystem.
cs: Центр и основание конуса будут вписаны в плоскость XY данной системы координат
height: Высота конуса
radius: Радиус конуса
radiusSpans: Количество пролетов в окружности
heightSpans: Количество пролетов по высоте
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Коническая Т-сплайновая поверхность
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайнового конуса с базовой точкой в начале координат CoordinateSystem, который продолжается в направлении оси Z объекта CoordinateSystem,
с круглым основанием в плоскости XY объекта CoordinateSystem.
cs: Центр и основание конуса будут вписаны в плоскость XY данной системы координат
height: Высота конуса
startRadius: Начальный радиус конуса
endRadius: Конечный радиус конуса
radiusSpans: Количество пролетов в окружности
heightSpans: Количество пролетов по высоте
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Коническая Т-сплайновая поверхность
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайновой сферы, центрированной во входной точке с заданным радиусом.
centerPoint: Центр сферы
radius: Радиус сферы
radiusSpans: Количество радиальных пролетов
heightSpans: Количество пролетов по высоте
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Сферическая Т-сплайновая поверхность
tspline,sphere,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайновой сферы, содержащей четыре входные точки на поверхности.
points: Четыре точки в списке для построения сферы. Точки не должны быть компланарными
radiusSpans: Количество радиальных пролетов
heightSpans: Количество пролетов по высоте
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Сферическая Т-сплайновая поверхность
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайнового тора с заданным центром и радиусом, выровненного по стандартной плоскости XY МСК
center: Центр тора
innerRadius: Внутренний радиус тора
outerRadius: Внешний радиус тора
innerRadiusSpans: Количество пролетов внутреннего радиуса
outerRadiusSpans: Количество пролетов внешнего радиуса
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Тороидальная Т-сплайновая поверхность
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайновой рамки, центрированной по входной точке, с определенной шириной, длиной и высотой.
origin: Центр рамки
width: Ширина рамки
length: Длина рамки
height: Высота рамки
xSpans: Количество пролетов по ширине
ySpans: Количество пролетов по длине
zSpans: Количество пролетов по высоте
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Кубоид Т-сплайна
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайновой рамки, центрированной и ориентированной относительно объекта CoordinateSystem, с определенной шириной, длиной и высотой.
cs: Плоскость XY рамки будет выровнена по соответствующей координате на оси X
width: Ширина рамки
length: Длина рамки
height: Высота рамки
xSpans: Количество пролетов по ширине
ySpans: Количество пролетов по длине
zSpans: Количество пролетов по высоте
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Кубоид Т-сплайна
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайновой рамки, простирающейся от нижней до верхней точки.
lowPoint: Первая угловая точка
highPoint: Вторая угловая точка
xSpans: Количество пролетов по ширине
ySpans: Количество пролетов по длине
zSpans: Количество пролетов по высоте
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Кубоид Т-сплайна
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайновой тетрагональной сферы с центром в начале координат объекта CoordinateSystem и заданным радиусом
cs: Локальная система координат
radius: Радиус тетрагональной сферы
spans: Число пролетов в двух измерениях сторон тетрагональной сферы
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Т-сплайновая тетрагональная сфера
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайновой тетрагональной сферы с заданным центром и радиусом, выровненного по стандартной плоскости XY МСК
center: Центральная точка тетрагональной сферы
radius: Радиус тетрагональной сферы
spans: Число пролетов в двух измерениях сторон тетрагональной сферы
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Т-сплайновая тетрагональная сфера
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Построение Т-сплайновой поверхности на основе NURBS-поверхности методом равномерности.
Входная NURBS-поверхность перестраивается при помощи равномерных узлов, помещенных
на равных параметрических интервалах или интервалах длины дуги в зависимости от
соответствующего флага, и аппроксимируется по NURBS-поверхности в степени 3.
Выходной Т-сплайн делится на заданное количество участков в направлениях U и V.
nurbsSurface: Входная NURBS-поверхность
uSpans: Требуемое количество пролетов в направлении U
vSpans: Требуемое количество пролетов в направлении V
uUseArcLen: Использовать ли длину дуги или параметрические поздразделения в параметрическом направлении U
vUseArcLen: Использовать ли длину дуги или параметрические поздразделения в параметрическом направлении V
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
Построение Т-сплайновой поверхности на основе NURBS-поверхности методом подразделения
кривизны. Входная NURBS-поверхность преобразуется в степень 3. Количество участков
и положения выходного Т-сплайна распознаются автоматически, в зависимости от кривизны.
nurbsSurface: Входная NURBS-поверхность
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByExtrude(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Создание Т-сплайна путем выдавливания кривой вдоль заданного вектора.
curve: Кривая профиля
direction: Выдавливание вектора
frontDistance: Расстояние выдавливания в направлении вектора
backDistance: Расстояние выдавливания против направления вектора
frontSpans: Число пролетов в направлении вектора. При значении «0» выдавливание в направлении вектора не выполняется
backSpans: Число пролетов против направления вектора. При значении «0» выдавливание против направления вектора не выполняется
profileSpans: Число пролетов в профиле. Определяется автоматически, если задано значение 0 или меньше
uniform: Использовать стратегию равномерности или кривизны для распределения пролетов вдоль направления профиля
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
tspline,extrude,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Построение Т-сплайна путем сдвига кривой поперечного сечения вдоль траектории.
profile: Кривая профиля
path: Криволинейная траектория
parallel: Пролеты должны быть параллельны направлению траектории
pathSpans: Число пролетов на траектории
profileSpans: Число пролетов в профиле. Определяется автоматически, если задано значение 0 или меньше
pathUniform: Использовать стратегию равномерности или кривизны для распределения пролетов вдоль траектории
profileUniform: Использовать стратегию равномерности или кривизны для распределения пролетов вдоль профиля
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Создание Т-сплайновой поверхности путем сдвига кривой профиля вокруг оси,
сформированной по начальной точке и направлению оси, от значения
start_angle в градусах со сдвигом до значения sweep_angle в градусах.
profile: Кривая профиля
axisOrigin: Центр поворота
axisDirection: Ось вращения
startAngle: Угол для начала поворота
sweepAngle: Угол для завершения поворота
radialSpans: Число пролетов в радиусе
axialSpans: Число пролетов по высоте. Определяется автоматически, если задано значение 0 или меньше
uniform: Использовать стратегию равномерности или кривизны для распределения пролетов
symmetry: Параметры симметричности для Т-сплайновой поверхности
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Создание трубовидной поверхности на основе сети кривых или линий.
Для каждого пересечения кривых создано сглаженное соединение.
Для некоторых параметров используется одно значение или список — по два значения на кривую.
curves: Список кривых для создания труб
defaultRadius: Радиус по умолчанию для созданных труб
snappingTolerance: Допуск, используемый, чтобы определять пересечения кривых
segmentsCount: Количество сегментов в каждой трубе. Разрешено одно значение или список, длина которого в два раза превышает количество кривых
endRotations: Значения конечных поворотов для каждой трубы (в градусах). Разрешено одно значение или список, длина которого в два раза превышает количество кривых
endRadii: Значение конечных радиусов для каждой трубы. Разрешено одно значение или список, длина которого в два раза превышает количество кривых
endPercentage: Значения (от 0 до 1) от конечной точки каждой из входных кривых до начальной точки сети из труб. Разрешено одно значение или список, длина которого в два раза превышает количество кривых
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Создание трубовидной поверхности на основе сети кривых или линий.
Для каждого пересечения кривых создано сглаженное соединение.
Для некоторых параметров используется одно значение или список — по одному значению на кривую.
curves: Список кривых для создания труб
defaultRadius: Радиус по умолчанию для созданных труб
snappingTolerance: Допуск, используемый для определения пересечений кривых
segmentsCount: Количество сегментов для каждой кривой. Размер списка может быть равен количеству кривых, 1 для репликации либо 0 для автоматического определения.
autoHandleStart: Если задано значение true, параметры ручки в начале каждой кривой создаются автоматически, а пользовательские параметры rotationsAtStart, radiiAtStart и positionsAtStart игнорируются.
autoHandleEnd: Если задано значение true, параметры ручки в конце каждой кривой создаются автоматически, а пользовательские параметры rotationsAtEnd, radiiAtEnd и positionsAtEnd игнорируются.
startRotations: Пользовательский угол поворота в градусах для каждой ручки трубы в начале каждой кривой. Данный параметр игнорируется, если для параметра autoHandleStart задано значение true. Размер списка может быть равен количеству кривых или 1 для репликации.
endRotations: Пользовательский угол поворота в градусах для каждой ручки трубы в конце каждой кривой. Данный параметр игнорируется, если для параметра autoHandleEnd задано значение true. Размер списка может быть равен количеству кривых или 1 для репликации.
startRadii: Пользовательский радиус для каждой ручки трубы в начале каждой кривой. Данный параметр игнорируется, если для параметра autoHandleStart задано значение true. Размер списка может быть равен количеству кривых или 1 для репликации.
endRadii: Пользовательский радиус для каждой ручки трубы в конце каждой кривой. Данный параметр игнорируется, если для параметра autoHandleEnd задано значение true. Размер списка может быть равен количеству кривых или 1 для репликации.
startPositions: Пользовательское положение для каждой ручки трубы в начале каждой кривой в процентах от 0 до 1 вдоль длины дуги кривой. Данный параметр игнорируется, если для параметра autoHandleStart задано значение true. Размер списка может быть равен количеству кривых или 1 для репликации. Начальное и конечное положения не должны перекрывать друг друга на каждой кривой. В идеале начальное положение должно быть близко к 0, а конечное — к 1.
endPositions: Пользовательское положение для каждой ручки трубы в конце каждой кривой в процентах от 0 до 1 вдоль длины дуги кривой. Данный параметр игнорируется, если для параметра autoHandleEnd задано значение true. Размер списка может быть равен количеству кривых или 1 для репликации. Начальное и конечное положения не должны перекрывать друг друга на каждой кривой. В идеале начальное положение должно быть близко к 0, а конечное — к 1.
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
Объединение заданных Т-сплайновых поверхностей в одну.
Поверхности могут быть не соединены друг с другом.
Если хотя бы одна поверхность находится в режиме рамки, выходная поверхность получится также в режиме рамки.
tSplineSurfaces: Т-сплайновые поверхности для объединения
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
Создан ли Т-сплайн в режиме рамки или в режиме сглаживания
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
Является ли Т-сплайн открытым.
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Преобразование Т-сплайновой поверхности в тело или поверхность в зависимости от формы
matchTopology: Определяет, должно ли результирующее тело иметь такую же топологию, как Т-сплайн
Returns: Объект топологии (Solid или Surface)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
Преобразование T-сплайновой поверхности в сеть. Сети могут содержать как треугольники, так и квадраты.
minSegments: Минимальное количество сегментов в каждом направлении. Всегда создается по крайней мере один сегмент.
tolerance: Максимально допустимое расстояние от сети до поверхности. Если установить для параметра нулевое или отрицательное значение, ее невозможно будет использовать
Returns: Объект сети
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
Объединение заданного списка вершин в одну вершину.
vertices: Вершины для объединения
newPosition: Положение результирующей ручки вершины. Если передано значение NULL, используется среднее положение ручек.
keepSubdCreases: Сохранить сгибы Subd исходной топологии
Returns: Т-сплайновая поверхность со скрепленными вершинами
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Разъединение всех указанных ребер — каждая из вершин будет откреплена от всех ребер.
edges: Набор ребер для разъединения
Returns: Т-сплайновая поверхность с разъединенными ребрами
tspline,unweld,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Разъединение всех указанных вершин — все ребра будут откреплены от каждой вершины.
vertices: Набор вершин для разъединения
Returns: Т-сплайновая поверхность с разъединенными вершинами
tspline,unweld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Создание объекта для сопоставления Т-сплайна и замкнутого контура кривых
tsEdges: Замкнутый контур ребра Т-сплайна для создания соответствующего объекта
curves: Замкнутый контур кривой для создания соответствующего объекта
continuity: Непрерывность геометрии для сопоставления: G0, G1, G2
useArclength: Использовать ли трассу объекта arcLength при создании соответствия
useRefinement: Если задано значение true, на Т-сплайн будут добавлены дополнительные управляющие точки для соответствия поверхностям в пределах заданного допуска.
numRefinementSteps: Максимальное количество шагов уточнения. Игнорируется, если для параметра useRefinement задано значение false
refinementTolerance: Допуск по совпадениям. Игнорируется, если для параметра useRefinement задано значение false
usePropagation: Использовать ли распространение при создании соответствия
widthOfPropagation: Определяет, какая доля поверхности будет затронута при выполнении сопоставления. Игнорируется, если для параметра usePropagation задано значение false
tangentScale: Тангенциальный масштаб. Игнорируется, если не задано значение непрерывности G1
curvParamWeight: Вес параметра кривизны. Игнорируется, если для непрерывности не задано значение G2
flipSourceTargetAlignment: Следует ли обратить направление трассы
Returns: Т-сплайновая поверхность, расположенная между заданными ребрами границ Т-сплайна и контуром кривой
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Создание объекта для сопоставления Т-сплайна и замкнутого контура кривых
tsEdges: Замкнутый контур ребра Т-сплайна для создания соответствующего объекта
curves: Замкнутый контур кривой для создания соответствующего объекта
continuity: Непрерывность геометрии для сопоставления: G0, G1, G2
useArclength: Использовать ли трассу объекта arcLength при создании соответствия
useRefinement: Если задано значение true, на Т-сплайн будут добавлены дополнительные управляющие точки для соответствия поверхностям в пределах заданного допуска.
numRefinementSteps: Максимальное количество шагов уточнения. Игнорируется, если для параметра useRefinement задано значение false
refinementTolerance: Допуск по совпадениям. Игнорируется, если для параметра useRefinement задано значение false
usePropagation: Использовать ли распространение при создании соответствия
widthOfPropagation: Определяет, какая доля поверхности будет затронута при выполнении сопоставления. Игнорируется, если для параметра usePropagation задано значение false
scale: Тангенциальный масштаб для G1 или масштаб кривизны для G2. Игнорируется, если задано значение непрерывности G0.
flipSourceTargetAlignment: Следует ли обратить направление трассы
Returns: Т-сплайновая поверхность, расположенная между заданными ребрами границ Т-сплайна и контуром кривой
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Создание объекта для сопоставления Т-сплайна и замкнутого контура ребер BREP. Прежде всего
контур грани преобразуется в контур кривой, а затем выполняется сопоставление
tsEdges: Замкнутый контур ребра Т-сплайна для создания соответствующего объекта
brepEdges: Замкнутый контур ребра BRep для создания соответствующего объекта
continuity: Непрерывность геометрии для сопоставления: G0, G1, G2
useArclength: Использовать ли трассу объекта arcLength при создании соответствия
useRefinement: Если задано значение true, на Т-сплайн будут добавлены дополнительные управляющие точки для соответствия поверхностям в пределах заданного допуска.
numRefinementSteps: Максимальное количество шагов уточнения. Игнорируется, если для параметра useRefinement задано значение false
refinementTolerance: Допуск по совпадениям. Игнорируется, если для параметра useRefinement задано значение false
usePropagation: Использовать ли распространение при создании соответствия
widthOfPropagation: Определяет, какая доля поверхности будет затронута при выполнении сопоставления. Игнорируется, если для параметра usePropagation задано значение false
tangentScale: Тангенциальный масштаб. Игнорируется, если не задано значение непрерывности G1
curvParamWeight: Вес параметра кривизны. Игнорируется, если для непрерывности не задано значение G2
flipSourceTargetAlignment: Следует ли обратить направление трассы
Returns: Т-сплайновая поверхность, расположенная между заданными ребрами границ Т-сплайна и контуром ребра BRep
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Создание объекта для сопоставления Т-сплайна и замкнутого контура ребер BRep. Прежде всего
контур грани преобразуется в контур кривой, а затем выполняется сопоставление
tsEdges: Замкнутый контур ребра Т-сплайна для создания соответствующего объекта
brepEdges: Замкнутый контур ребра BRep для создания соответствующего объекта
continuity: Непрерывность геометрии для сопоставления: G0, G1, G2
useArclength: Использовать ли трассу объекта arcLength при создании соответствия
useRefinement: Если задано значение true, на Т-сплайн будут добавлены дополнительные управляющие точки для соответствия поверхностям в пределах заданного допуска.
numRefinementSteps: Максимальное количество шагов уточнения. Игнорируется, если для параметра useRefinement задано значение false
refinementTolerance: Допуск по совпадениям. Игнорируется, если для параметра useRefinement задано значение false
usePropagation: Использовать ли распространение при создании соответствия
widthOfPropagation: Определяет, какая доля поверхности будет затронута при выполнении сопоставления. Игнорируется, если для параметра usePropagation задано значение false
scale: Тангенциальный масштаб для G1 или масштаб кривизны для G2. Игнорируется, если задано значение непрерывности G0.
flipSourceTargetAlignment: Следует ли обратить направление трассы
Returns: Т-сплайновая поверхность, расположенная между заданными ребрами границ Т-сплайна и контуром ребра BRep
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
Изменение стиля визуализации Т-сплайна.
Сглаживание визуализации, если передано значение true, или без сглаживания, если передано значение false.
enable: Включение или отключение сглаживания при визуализации
Returns: Т-сплайн с выбранным стилем визуализации
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Создание перемычки между двумя наборами граней. Элементы первой группы
рассматриваются как дочерние элементы данной поверхности. Элементы второй
группы могут быть как дочерними элементами данной поверхности, так и относиться
к другой поверхности. Топология в каждой группе может не быть смежной, однако
посредством нее должно быть создано одно и то же количество отдельных контуров.
firstGroup: Первая группа граней для добавления перемычки
secondGroup: Вторая группа граней для добавления перемычки
followCurves: Замыкание кривых для каждого отдельного контура
топологии (прямые линии используются при передаче пустого списка; в случае передачи одной
кривой она дублируется при условии, если обнаружено более одного входного контура)
frameRotations: Количество полных поворотов вокруг
нормали ребер, расположенных вдоль кривой, для добавления перемычки для каждого отдельного контура
топологии (если передан пустой список, используется значение 0; если передано одно
значение, оно дублируется при условии, что обнаружено более одного входного контура)
spansCounts: Количество сегментов вдоль перемычки для каждого
отдельного контура топологии. Количество пролетов для каждой группы должно быть
больше соответствующего количества поворотов (если передан пустой список, используется
значение 1; если передано одно значение, оно дублируется при условии, что обнаружено
более одного входного контура)
cleanBorderBridges: Удалите перемычки между ребрами границ.
keepSubdCreases: Сохранить сгибы Subd
исходной топологии
firstAlignVertices: Список вершин ориентации для
каждого отдельного контура топологии из первой группы (количество вершин должно быть равно
количеству обнаруженных входных контуров; в противном случае список может быть пустым)
secondAlignVertices: Список вершин ориентации для
каждого отдельного контура топологии из второй группы (количество вершин должно быть равно
количеству обнаруженных входных контуров; в противном случае список может быть пустым)
flipAlignmentFlags: Список флагов, указывающих на то, следует ли
перевернуть трассу перемычки для контура соответствующей топологии
(если передан пустой список, устанавливается значение false; если передано одно значение,
оно дублируется для каждого обнаруженного входного контура)
Returns: Т-сплайновая поверхность, топология которой соединена перемычками
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Создание перемычки между набором граней и набором ребер. Элементы первой группы
рассматриваются как дочерние элементы данной поверхности. Элементы второй
группы могут быть как дочерними элементами данной поверхности, так и относиться
к другой поверхности. Топология в каждой группе может не быть смежной, однако
посредством нее должно быть создано одно и то же количество отдельных контуров.
firstGroup: Первая группа граней для добавления перемычки
secondGroup: Вторая группа ребер для добавления перемычки
followCurves: Замыкание кривых для каждого отдельного контура
топологии (прямые линии используются при передаче пустого списка; в случае передачи одной
кривой она дублируется при условии, если обнаружено более одного входного контура)
frameRotations: Количество полных поворотов вокруг
нормали ребер, расположенных вдоль кривой, для добавления перемычки для каждого отдельного контура
топологии (если передан пустой список, используется значение 0; если передано одно
значение, оно дублируется при условии, что обнаружено более одного входного контура)
spansCounts: Количество сегментов вдоль перемычки для каждого
отдельного контура топологии. Количество пролетов для каждой группы должно быть
больше соответствующего количества поворотов (если передан пустой список, используется
значение 1; если передано одно значение, оно дублируется при условии, что обнаружено
более одного входного контура)
cleanBorderBridges: Удалите перемычки между ребрами границ.
keepSubdCreases: Сохранить сгибы Subd
исходной топологии
firstAlignVertices: Список вершин ориентации для
каждого отдельного контура топологии из первой группы (количество вершин должно быть равно
количеству обнаруженных входных контуров; в противном случае список может быть пустым)
secondAlignVertices: Список вершин ориентации для
каждого отдельного контура топологии из второй группы (количество вершин должно быть равно
количеству обнаруженных входных контуров; в противном случае список может быть пустым)
flipAlignmentFlags: Список флагов, указывающих на то, следует ли
перевернуть трассу перемычки для контура соответствующей топологии.
(если передан пустой список, устанавливается значение false; если передано одно значение,
он дублируется для каждого обнаруженного входного контура)
Returns: Т-сплайновая поверхность, топология которой соединена перемычками
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Создание перемычки между набором ребер и набором граней. Элементы первой группы
рассматриваются как дочерние элементы данной поверхности. Элементы второй
группы могут быть как дочерними элементами данной поверхности, так и относиться
к другой поверхности. Топология в каждой группе может не быть смежной, однако
посредством нее должно быть создано одно и то же количество отдельных контуров.
firstGroup: Первая группа ребер для добавления перемычки
secondGroup: Вторая группа граней для добавления перемычки
followCurves: Замыкание кривых для каждого отдельного контура
топологии (прямые линии используются при передаче пустого списка; в случае передачи одной
кривой она дублируется при условии, если обнаружено более одного входного контура)
frameRotations: Количество полных поворотов вокруг
нормали ребер, расположенных вдоль кривой, для добавления перемычки для каждого отдельного контура
топологии (если передан пустой список, используется значение 0; если передано одно
значение, оно дублируется при условии, что обнаружено более одного входного контура)
spansCounts: Количество сегментов вдоль перемычки для каждого
отдельного контура топологии. Количество пролетов для каждой группы должно быть
больше соответствующего количества поворотов (если передан пустой список, используется
значение 1; если передано одно значение, оно дублируется при условии, что обнаружено
более одного входного контура)
cleanBorderBridges: Удалите перемычки между ребрами границ.
keepSubdCreases: Сохранить сгибы Subd
исходной топологии
firstAlignVertices: Список вершин ориентации для
каждого отдельного контура топологии из первой группы (количество вершин должно быть равно
количеству обнаруженных входных контуров; в противном случае список может быть пустым)
secondAlignVertices: Список вершин ориентации для
каждого отдельного контура топологии из второй группы (количество вершин должно быть равно
количеству обнаруженных входных контуров; в противном случае список может быть пустым)
flipAlignmentFlags: Список флагов, указывающих на то, следует ли
перевернуть трассу перемычки для контура соответствующей топологии.
(если передан пустой список, устанавливается значение false, если передается одно значение,
он дублируется для каждого обнаруженного входного контура)
Returns: Т-сплайновая поверхность, топология которой соединена перемычками
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Создание перемычки между двумя наборами ребер. Элементы первой группы
рассматриваются как дочерние элементы данной поверхности. Элементы второй
группы могут быть как дочерними элементами данной поверхности, так и относиться
к другой поверхности. Топология в каждой группе может не быть смежной, однако
посредством нее должно быть создано одно и то же количество отдельных контуров.
firstGroup: Первая группа ребер для добавления перемычки
secondGroup: Вторая группа ребер для добавления перемычки
followCurves: Замыкание кривых для каждого отдельного контура
топологии (прямые линии используются при передаче пустого списка; в случае передачи одной
кривой она дублируется при условии, если обнаружено более одного входного контура)
frameRotations: Количество полных поворотов вокруг
нормали ребер, расположенных вдоль кривой, для добавления перемычки для каждого отдельного контура
топологии (если передан пустой список, используется значение 0; если передано одно
значение, оно дублируется при условии, что обнаружено более одного входного контура)
spansCounts: Количество сегментов вдоль перемычки для каждого
отдельного контура топологии. Количество пролетов для каждой группы должно быть
больше соответствующего количества поворотов (если передан пустой список, используется
значение 1; если передано одно значение, оно дублируется при условии, что обнаружено
более одного входного контура)
cleanBorderBridges: Удалите перемычки между ребрами границ.
keepSubdCreases: Сохранить сгибы Subd
исходной топологии
firstAlignVertices: Список вершин ориентации для
каждого отдельного контура топологии из первой группы (количество вершин должно быть равно
количеству обнаруженных входных контуров; в противном случае список может быть пустым)
secondAlignVertices: Список вершин ориентации для
каждого отдельного контура топологии из второй группы (количество вершин должно быть равно
количеству обнаруженных входных контуров; в противном случае список может быть пустым)
flipAlignmentFlags: Список флагов, указывающих на то, следует ли
перевернуть трассу перемычки для контура соответствующей топологии.
(если передан пустой список, устанавливается значение false; если передано одно значение,
он дублируется для каждого обнаруженного входного контура)
Returns: Т-сплайновая поверхность, топология которой соединена перемычками
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
Заполнение отверстий в Т-сплайне
edges: Набор ребер с отверстием. Ребра должны представлять собой границы.
fillMethod: Метод для заполнения отверстий: 0 — Тесселяция, 1 — N-полигоны, 2 — Свернуть, 3 — Свернуть и скрепить
keepSubdCreases: Сохранить сгибы Subd исходной топологии
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
Сжатие всей топологии на поверхности, при этом индексы становятся смежными. Эта функция поддерживает относительный порядок индексов.
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
При помощи интерполяции вперед управляющие точки перемещаются к своим параметрическим местоположениям на поверхности. При обратной интерполяции для каждой исходной управляющей точки создается точка на поверхности, с помощью которой эти управляющие точки перемещаются к соответствующим точкам на поверхности.
reverse: Направление интерполяции: вперед, если задано значение false, в противном случае — обратно.
Returns: Интерполированный Т-сплайн в заданном направлении
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Копирование выбранных граней на новую поверхность. Новая поверхность не имеет симметрии
faces: Грани для копирования
Returns: Т-сплайновая поверхность только с выбранными гранями
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Перемещение заданных вершин вдоль определенного вектора
vertices: Список вершин для перемещения
vector: Направление для перемещения вдоль
onSurface: Флаг, указывающий на то, требуется ли использовать поверхность или управляющие точки вершин

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSS(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface},System.String)
Экспорт данного набора поверхностей Т-сплайна в файл T-Spline Scene
tSplineSurfaces: Набор Т-сплайновых поверхностей для экспорта
filePath: Путь к файлу, в который будут сохранены элементы
Returns: Путь к файлу, в котором сохранен набор Т-сплайна
tspline,export,save,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface,System.String)
Экспорт данной поверхности Т-сплайна в файл T-Spline Mesh
tSplineSurface: Т-сплайновая поверхность для экспорта
filePath: Путь к файлу, в который будут сохранены элементы
Returns: Путь к файлу, в котором сохранена поверхность Т-сплайна
tspline,export,save,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
Записать поверхность T-сплайна в строку в формате сетки Т-сплайна.
tSplineSurface: Поверхность T-сплайна для индексации
Returns: Строка, в которой индексируется поверхность Т-сплайна
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
Создание Т-сплайновой поверхности на основе строки в формате T-Spline Mesh.
content: Строчное представление файла T-Spline Mesh
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Новая загруженная Т-сплайновая поверхность в списке
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
Загрузка Т-сплайновой поверхности из данного файла T-Spline Mesh
filePath: Путь к файлу, из которого требуется загрузить элементы
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Вновь загруженная Т-сплайновая поверхность в списке
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.IO.FileInfo,System.Boolean)
Загрузка Т-сплайновой поверхности из данного файла T-Spline Mesh
file: Файл для загрузки из
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Вновь загруженная Т-сплайновая поверхность в списке
tspline,import,load,tsm,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
Загрузка набора Т-сплайновых поверхностей из данного файла T-Spline Scene
filePath: Путь к файлу, из которого требуется загрузить элементы
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Набор вновь загруженных Т-сплайновых поверхностей
tspline,import,load,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.IO.FileInfo,System.Boolean)
Загрузка набора Т-сплайновых поверхностей из данного файла T-Spline Scene
file: Файл для загрузки из
inSmoothMode: Показать визуализацию Т-сплайновой поверхности со сглаживанием или без
Returns: Набор вновь загруженных Т-сплайновых поверхностей
tspline,import,load,tss,file