Autodesk.DesignScript.Geometry.Cylinder.ToString
Получение строчного представления цилиндра

Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Построение твердотельного цилиндра определяется родительского элемента CoordinateSystem, радиуса и высоты цилиндра
coordinateSystem: Родительская система координат
radius: Radius size
height: Cylinder height
Returns: Cylinder created from radius and height
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Построение твердотельного цилиндра при условии наличия точки центра верхней и нижней окружностей цилиндра.
startPoint: Start point of cylinder
endPoint: End point of cylinder
radius: Radius  of cylinder
Returns: Cylinder created by points and radius
cylinder,tube,by center points