Autodesk.DesignScript.Geometry.PolySurface.ToString
Получение строчного представления объекта PolySurface

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Создать сложную поверхность путем сдвига кривой вдоль направляющей.
rail: Кривая для сдвига
profile: Профиль сдвига
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Поиск поверхностей по точке. Берется первое пересечение в прямом направлении. В результате выводится одна поверхность, если точка находится внутри нее, две, если точка находится на ребре, и множество поверхностей, если точка совпадает с вершиной
surfacesatpoint,findsurfaces,extractsurfaces

Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
Возврат количества граней сложной поверхности.
Returns: Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
Возврат количества ребер сложной поверхности.
Returns: Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
Возврат количества вершин сложной поверхности.
Returns: Number of vertices