Autodesk.DesignScript.Geometry.Solid.ToString
Получение строчного представления тела

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Создание тела посредством лофтинга между замкнутыми кривыми поперечного сечения с использованием направляющей кривой в качестве вспомогательной. Направляющая кривая должна пересекать все кривые поперечного сечения.
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Создание тела посредством лофтинга между замкнутыми кривыми поперечного сечения с использованием направляющих кривых в качестве вспомогательных. Направляющие кривые должны пересекать все кривые поперечного сечения.
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
Создание тела посредством лофтинга между входными поперечными сечениями, в которых содержатся замкнутые объекты PolyCurve. Эта операция оптимизирована для сечений, состоящих только из сегментов линий, с прежним порядком вершин. Если параметр проверки и восстановления включен, гарантируется корректность построенного тела. Если он отключен, повысится производительность.
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Сдвиг замкнутой кривой профиля вдоль двух кривых направляющей.
path: Путь ввода для сдвига.
guideRail: Направляющая для ориентации сдвига.
profile: The profile curve to sweep along the path
Brep,brep,sweep2,guides,sweepprofile

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Создание тела вращения путем сдвига кривой профиля вокруг луча оси, представляющего собой вектор оси с началом в точке значения начального угла в градусах, который заканчивается значением угла сдвига в градусах.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Solid created by revolve
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
Объединение списка тел с данным телом.
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
Логическая разность данного тела с другим

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
Получение твердой оболочки на основе граней этого тела
internalFaceThickness: Расстояния для удлинения оболочки внутрь
externalFaceThickness: Расстояния для удлинения оболочки наружу
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Проецирование входного объекта геометрии на текущее тело в направлении заданного вектора. В настоящее время этот метод проецирования поддерживает только точки и кривые.
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
Разделение тела на отдельные тела, если в нем содержится несколько несвязанных фрагментов. Возврат того же тела, если оно является непрерывным фрагментом.
Returns: разделение несвязанных тел
split,disjoint