Autodesk.DesignScript.Geometry.UV.ToString
Получение строчного представления UV

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
Сравнение двух UV:
other: Другое значение UV
Returns: Являются ли два объекта одинаковыми

Autodesk.DesignScript.Geometry.UV.GetHashCode
Получение хэш-кода для данного типа
Returns: Уникальный хэш-код для данного объекта

Autodesk.DesignScript.Geometry.UV.ByCoordinates(System.Double,System.Double)
Создание UV из двух двойных значений.
u: U value
v: V value
Returns: UV created by coordinates
surfaceparam,parameters,uv,uvs