Autodesk.DesignScript.Geometry.NurbsSurface.ToString
Получение строчного представления объекта NurbsSurface

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Создание NurbsSurface с заданными интерполированными точками значениями кривизны U и V.  Результирующая поверхность будет проходить через все точки.
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Создание NurbsSurface с заданными интерполированными точками значениями кривизны U и V.  Результирующая поверхность будет проходить через все точки. Количество прямых участков должно совпадать с количеством точек в соответствующем направлении. Значение кривизны результирующей поверхности в направлениях U и V будет составлять 3.
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Создание элемента NurbsSurface, удовлетворяющего условиям набора различных характеристик поверхности. Это наиболее продвинутый метод подбора поверхностей. Результирующая поверхность будет проходить через все точки. Количество прямых участков должно совпадать с количеством точек в соответствующем направлении. Для результирующей поверхности будет установлено значение кривизны 3 в направлении U и V. Угловые производные должны быть второго порядка (dP/dUdV) и должны быть указаны в данном порядке: [ lowU, lowV ], [ highU, lowV ],  [ lowU, highV ], [ highU, highV ].
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Создание объекта NurbsSurface по точным управляющим точкам с заданными значениями кривизны U и V.
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
Создание элемента NurbsSurface с заданными управляющими вершинами, узлами, весом и значениями кривизны U и V. Существует несколько ограничений на данные, повреждение которых может привести к сбою функции и выбрасыванию исключения. Кривизна: значения U и V должны быть > = 1 (кусочно-линейный сплайн) и меньше 26 (максимальное базовое значение кривизны B-сплайна, поддерживаемое ASM). Вес линий: Все значения веса (если указаны) должны быть только положительными. Вес меньше 1e-11 будет отклонен и выполнение функций будет невозможно.  Узлы: оба вектора узлов должны составлять неубывающую последовательность. Множество внутренних узлов не должно быть больше значения кривизны + 1 в начале/конце узла и кривизны внутреннего узла (таким образом, возможно представление поверхностей с точками разрыва G1). Обратите внимание на то, что несмотря на то что поддерживаются векторы узлов без фиксации, они будут преобразованы в фиксированные наряду с соответствующими изменениями применительно к данным управляющих точек/веса.
lines
0.4

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
Получение весов управляющих точек NurbsSurface. Веса определяют влияние каждой управляющей точки на форму поверхности.
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
Возврат узлов поверхности в направлении U. Узлы представляют собой серию значений параметров (двойных значений), используемых для определения места и способа воздействия управляющих точек на кривую.
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
Возврат узлов поверхности в направлении V. Узлы представляют собой серию значений параметров (двойных значений), используемых для определения места и способа воздействия управляющих точек на кривую.
Returns: Nurbs V knots of surface