Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
Получение строчного представления TSplineTopology

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
Получить вершину по заданному индексу
index: Индекс для получения вершины в
Returns: Вершина Т-сплайна
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
Получить ребро по заданному индексу
index: Индекс для получения ребра в
Returns: Ребро Т-сплайна
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
Получить грань по заданному индексу
index: Индекс для получения грани в
Returns: Грань Т-сплайна
tspline,face,byindex