Autodesk.DesignScript.Geometry.Ellipse.ToString
Получение строчного представления эллипса

Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Построение эллипса с центрированием по входной точке и выравниванием по плоскости XY МСК с заданными значениями радиуса X и Y.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by origin and radii
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Построение эллипса с центром во входной точке с двумя заданными осями. Оси должны быть под углом 90 градусов друг к другу.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from origin vectors
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Построение эллипса с центрированием и выравниванием по входному объекту CoordinateSystem, со значением радиуса x_radius в направлении оси X, и y_radius — в направлении оси Y.
origin: Origin coordinate system of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by coordinate system and radii
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Построение эллипса с центрированием и выравниванием по входной плоскости, со значением радиуса x_radius в направлении оси X, и y_radius — в направлении оси Y.
plane: Plane where ellipse arc is drawn
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from plane and radii
ellipse,aligned ellipse,ellipsebylengths