Autodesk.DesignScript.Geometry.Mesh.ToString
Получение строчного представления сетки

Autodesk.DesignScript.Geometry.Mesh.ByPointsFaceIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
Создание сетки на основе набора точек и набора элементов IndexGroups, ссылающихся на набор точек
vertexPositions: List of points that determine vertex positions
indices: Indices for vertices
Returns: Mesh created from points
mesh,meshes