Autodesk.DesignScript.Geometry.Arc.ToString
Получение строчного представления дуги

Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Построение дуги, максимально приближенной к коллекции точек
points: Список точек для оптимального вписывания дуги
Returns: Arc created by best fit through points
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Создание дуги или касательной двойной дуги по начальной и конечной точкам и точкам соприкосновения в начале и в конце
point1: Точка начала двойной дуги
vector1: Вектор касательной для начала двойной дуги
point2: Точка конца двойной дуги
vector2: Вектор касательной для конца двойной дуги
arc,tangent

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Построение дуги от начальной до конечной точки, начальная часть которой расположена по касательной к вектору
startPoint: Start point of arc
endPoint: End point of arc
startTangent: Start tangent direction vector
arc,tangent,arcs