Autodesk.DesignScript.Geometry.Point.ToString
Получение строчного представления точки

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Сравнение двух точек:
other: Другая точка
Returns: Являются ли два объекта одинаковыми

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
Получение хэш-кода для данного типа
Returns: Уникальный хэш-код для данного объекта

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
Построение точки в плоскости XY по заданным двум 2 декартовым координатам. Компонент Z равен 0.
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
Получение точки начала координат (0; 0; 0)
Returns: Origin point
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
Построение точки на основе трех заданных декартовых координат
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Построение точки в данной системе координат с тремя декартовыми координатами
coordinateSystem: Родительская система координат
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Построение точки в заданной системе координат на основе ее положения в цилиндрической системе координат.
coordinateSystem: Система координат для построения точки
angle: Угол -​ это поворот относительно оси X в системе координат вокруг оси Z (в градусах)
elevation: Отметка точки находится над плоскостью XY
radius: Расстояние от начала системы координат
Returns: Точка в цилиндрических координатах
point,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
Отсекать точки для исключения дублирования задействованных точек в пределах допуска
points: Список точек для отсечения дубликатов
tolerance: Допуск, используемый для отсечения
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near