Autodesk.DesignScript.Geometry.PolyCurve.ToString
Получение строчного представления объекта PolyCurve

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Создание элемента PolyCurve путем объединения кривых. Положение кривых изменяется для обеспечения возможности соединения. Выберите нужный допуск смыкания поверхности между элементами 1e-6 и 1e-3.
curves: Кривые для объединения в элемент PolyCurve
joinTolerance: Допуск для определения размера допустимого зазора между объединяемыми кривыми
Returns: Сложная кривая, созданная соединенными кривыми
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Создайте элемент PolyCurve, соединив точки. Чтобы замкнуть PolyCurve, задайте для параметра «connectLastToFirst» значение true.
points: Точки для создания PolyCurve
connectLastToFirst: Значение true — соединение последней точки с первой, false — без замыкания
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.Curves
Получение кривых в составе сложной кривой
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
Получение кривой в составе сложной кривой по индексу
index: Длина для определения местоположения точки
endOrStart: Значение true для подсчета от конца сложной кривой, false — от начала сложной кривой
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
Удлинение сложной кривой по касательной дуге
length: Длина дуги удлинения
radius: Радиус дуги
endOrStart: удлинение конца или начала PolyCurve

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
Смещение сложной кривой в своей плоскости.
signedDistance: Величина смещения
extendCircular: Переключатель для скругления углов
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Сложная кривая сопряжения на соответствующей плоскости.
radius: Радиус сопряжения
rightSide: Значение true для сопряжения справа относительно начала сложной кривой, false — слева
Returns: Filleted polyCurve
round,smooth,radius