Autodesk.DesignScript.Geometry.BoundingBox.ToString
Получение строчного представления объекта BoundingBox

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Сравнение двух объектов BoundingBox
other: Другой объект BoundingBox
Returns: Являются ли два объекта одинаковыми

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
Получение хэш-кода для данного типа
Returns: Уникальный хэш-код для данного объекта

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
Создание объекта BoundingBox с выравниванием по осям вокруг входной геометрии.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Создание объекта BoundingBox с выравниванием по осям вокруг входных элементов геометрии.
geom: Geometries to determine bounding box
Returns: Bounding box enclosing geometries
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
Создание объекта BoundingBox вокруг входной геометрии без выравнивания по оси, ориентированного на оси X, Y и Z объекта CoordinateSystem.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
Создание объекта BoundingBox вокруг входных элементов геометрии без выравнивания по оси, ориентированного на оси X, Y и Z объекта CoordinateSystem.
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
Построение объекта BoundingBox на основе количества координат от минимального (нижний, левый и задний углы рамки) до максимального (верхний, правый и передний угол рамки). Объект CoordinateSystem представляет собой результат превращения пространства координат рамки в пространство модели. Этот метод предназначен для сопоставления API Revit, позволяя извлекать из Revit BoundingBox параметры без необходимости преобразования.
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
Система координат, в которой определено BoundingBox

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Получение пересечения двух элементов BoundingBox
other: Other bounding box to intersect
Returns: Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Определите, пересекаются ли два элемента BoundingBoxes
other: Other bounding box
Returns: Do bounding boxes intersect
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
Определите, пуст ли элемент BoundingBox
Returns: Returns true if the bounding box is empty