Autodesk.DesignScript.Geometry.Edge.ToString
Получение строчного представления ребра

Autodesk.DesignScript.Geometry.Edge.CurveGeometry
Базовая кривая, образующая ребро

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
Грани, смежные с данным ребром

Autodesk.DesignScript.Geometry.Edge.StartVertex
Вершина, в которой начинается данное ребро

Autodesk.DesignScript.Geometry.Edge.EndVertex
Вершина, в которой заканчивается данное ребро