Autodesk.DesignScript.Geometry.Cuboid.ToString
Cuboid의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(System.Double,System.Double,System.Double)
WCS 원점을 중심으로 지정된 폭, 길이, 높이의 직육면체를 만듭니다.
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
입력 점을 중심으로 지정된 폭, 길이, 높이의 직육면체를 만듭니다.
origin: Origin point
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
WCS 원점을 중심으로 지정된 폭, 길이, 높이의 직육면체를 만듭니다.
coordinateSystem: 상위 좌표계(직육면체의 중심)
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created from lengths
box,cube,cubebysize,bycoord,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
낮은 점에서 높은 점에 걸치는 직육면체를 만듭니다.
lowPoint: Corner low point of cuboid
highPoint: Corner high point of cuboid
Returns: Cuboind created by corners
box,cube,byminmax,by corners,by points,cubes

Autodesk.DesignScript.Geometry.Cuboid.Length
길이 거리를 반환합니다.                         주: 이 함수는 실제 표준 공간 치수가 아니라 직육면체의 입력 치수를 반환합니다. 다시 말해, 폭(X축) 길이가 10인 직육면체를 만들어 X 축척을 두 배로 하여 CoordinateSystem으로 변환해도 폭은 여전히 10입니다. ASM에서는 예측 가능한 순서로 본체의 정점을 추출할 수 없으므로 변환 후 치수를 결정할 수 없습니다.

Autodesk.DesignScript.Geometry.Cuboid.Width
폭 거리를 반환합니다.                         주: 이 함수는 실제 표준 공간 치수가 아니라 직육면체의 입력 치수를 반환합니다. 다시 말해, 폭(X축) 길이가 10인 직육면체를 만들어 X 축척을 두 배로 하여 CoordinateSystem으로 변환해도 폭은 여전히 10입니다. ASM에서는 예측 가능한 순서로 본체의 정점을 추출할 수 없으므로 변환 후 치수를 결정할 수 없습니다.

Autodesk.DesignScript.Geometry.Cuboid.Height
높이 거리를 반환합니다.                         주: 이 함수는 실제 표준 공간 치수가 아니라 직육면체의 입력 치수를 반환합니다. 다시 말해, 폭(X축) 길이가 10인 직육면체를 만들어 X 축척을 두 배로 하여 CoordinateSystem으로 변환해도 폭은 여전히 10입니다. ASM에서는 예측 가능한 순서로 본체의 정점을 추출할 수 없으므로 변환 후 치수를 결정할 수 없습니다.