Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
TSplineSurface의 문자열 표현을 가져옵니다.

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
벡터 법선에 원점을 두고 특정한 X축 방향으로 "방향이 지정된" T-Spline 평면을 만듭니다.
분할, 교차, 투영 등의 작업에 영향을 미치지 않으며 입력 CoordinateSystem의 방향만 지정합니다.
origin: 평면의 루트 점
normal: 평면의 법선
xAxis: 평면의 X축
minCorner: 평면 좌표에서 최소 구석의 2D 점
maxCorner: 평면 좌표에서 최대 구석의 2D 점
xSpans: 폭 스팬 수
ySpans: 길이 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: 평면 T-Spline 표면
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
원점 및 X, Y축 기준으로 평면을 만듭니다.
Z축은 두 벡터의 외적입니다.
origin: 평면의 루트 점
xAxis: 평면의 X축
yAxis: 평면의 Y축
minCorner: 평면 좌표에서 최소 구석의 2D 점
maxCorner: 평면 좌표에서 최대 구석의 2D 점
xSpans: 폭 스팬 수
ySpans: 길이 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: 평면 T-Spline 표면
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
시작점에서 지정된 기준 반지름으로 끝점의 정점까지 연장되는
T-Spline 원추를 만듭니다.
startPoint: 원추의 시작점
endPoint: 원추의 끝점
radius: 원추의 기준 반지름
radiusSpans: 원주 스팬 수
heightSpans: 높이 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: 원추형 T-Spline 표면
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
시작점과 끝점의 지정된 반지름으로 시작점에서 끝점까지 축이 있는 T-Splines 원추를 만듭니다.
이 객체에는 정점이 없으며 절두체 모양입니다.
startPoint: 원추의 시작점
endPoint: 원추의 끝점
startRadius: 원추의 시작 반지름
endRadius: 원추의 끝 반지름
radiusSpans: 원주 스팬 수
heightSpans: 높이 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: 원추형 T-Spline 표면
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
기준점이 CoordinateSystem 원점에 있고, CoordinateSystem Z축 방향 길이만큼 연장되며,
CoordinateSystem XY 평면에 원형 기준이 있는 T-Spline 원추를 작성합니다.
cs: 원추의 중심 및 기준이 이 좌표계의 X-Y 평면에 맞춰집니다.
height: 원추의 높이
radius: 원추의 반지름
radiusSpans: 원주 스팬 수
heightSpans: 높이 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: 원추형 T-Spline 표면
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
기준점이 CoordinateSystem 원점에 있고, CoordinateSystem Z축 방향 길이만큼 연장되며,
CoordinateSystem XY 평면에 원형 기준이 있는 T-Spline 원추를 만듭니다.
cs: 중심 및 기준이 이 좌표계의 X-Y 평면에 맞춰집니다.
height: 원추의 높이
startRadius: 원추의 시작 반지름
endRadius: 원추의 끝 반지름
radiusSpans: 원주 스팬 수
heightSpans: 높이 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: 원추형 T-Spline 표면
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
입력점을 중심으로 지정된 반지름을 사용하여 T-Spline 구를 만듭니다.
centerPoint: 구의 중심점
radius: 구의 반지름
radiusSpans: 방사형 스팬 수
heightSpans: 높이 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: 구형 T-Spline 표면
tspline,sphere,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
표면의 네 입력 점이 포함된 T-Spline 구를 만듭니다.
points: 리스트에 있는 네 개의 점으로 구를 만들 수 있습니다. 점은 동일평면 상에 있어서는 안 됩니다.
radiusSpans: 방사형 스팬 수
heightSpans: 높이 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: 구형 T-Spline 표면
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
기본 표준 XY 평면에 정렬되는 지정된 중심과 반지름의 T-Spine 원환을 만듭니다.
center: 원환의 중심
innerRadius: 원환의 내부 반지름
outerRadius: 원환의 외부 반지름
innerRadiusSpans: 내부 방사형 스팬 수
outerRadiusSpans: 외부 방사형 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: 원환형 T-Spline 표면
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
입력 점을 중심으로 지정된 폭, 길이 및 높이의 T-Spline 상자를 만듭니다.
origin: 상자의 중심
width: 상자의 폭
length: 상자의 길이
height: 상자의 높이
xSpans: 폭 스팬 수
ySpans: 길이 스팬 수
zSpans: 높이 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: T-Spline 직육면체
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
입력 CoordinateSystem을 중심으로 방향을 가리키도록 지정된 폭, 길이 및 높이의 T-Spline 상자를 만듭니다.
cs: 상자의 X-Y 평면은 해당하는 X에 정렬됩니다.
width: 상자의 폭
length: 상자의 길이
height: 상자의 높이
xSpans: 폭 스팬 수
ySpans: 길이 스팬 수
zSpans: 높이 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: T-Spline 직육면체
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
낮음 점에서 높은 점에 걸치는 T-Spline 상자를 만듭니다.
lowPoint: 첫 번째 구석점
highPoint: 두 번째 구석점
xSpans: 폭 스팬 수
ySpans: 길이 스팬 수
zSpans: 높이 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: T-Spline 직육면체
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
CoordinateSystem 원점을 중심으로 지정된 반지름의 T-Spline 쿼드볼를 만듭니다.
cs: 로컬 좌표계
radius: 쿼드볼 반지름
spans: 쿼드볼 측면 2개 차수의 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: T-Spline 쿼드볼
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
기본 표준 XY 평면에 정렬되는 지정된 중심과 반지름의 T-Spine 쿼드볼을 만듭니다.
center: 쿼드볼 중심점
radius: 쿼드볼 반지름
spans: 쿼드볼 측면 2개 차수의 스팬 수
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: T-Spline 쿼드볼
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
균일한 전략으로 NURBS 표면에서 T-Spline 표면을 구성합니다.
입력 NURBS 표면은 해당 useArcLen 플래그에 따라 동일한 파라메트릭 또는 호 길이 간격으로
균일한 매듭과 함께 재생성되고, 차수 3 NURBS 표면에 근접합니다.
출력 T-Spline은 U 및 V 방향으로 지정된 스팬 개수로 나누어집니다.
nurbsSurface: 입력 NURBS 표면
uSpans: U 방향으로 필요한 스팬 수
vSpans: V 방향으로 필요한 스팬 수
uUseArcLen: 파라메트릭 방향으로 호 길이 또는 파라메트릭 세분화 사용 여부
vUseArcLen: V 파라메트릭 방향으로 호 길이 또는 파라메트릭 세분화 사용 여부
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
곡률 세분화 전략을 사용하여 NURBS 표면에서 T-Spline 표면을 구성합니다.
입력 NURBS 표면은 차수 3으로 재생성됩니다. 출력 T-Spline에는 곡률에 따라 자동으로
탐지되는 각 방향으로 스팬 개수 및 위치가 있습니다.
nurbsSurface: 입력 NURBS 표면
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
경로를 따라 횡단면 곡선을 스윕하여 T-Spline을 구성합니다.
profile: 종단 곡선
path: 경로 곡선
parallel: 스팬은 경로 방향으로 평행해야 합니다.
pathSpans: 경로 스팬 수
profileSpans: 종단 스팬 수입니다. 0 이하인 경우 자동으로 정의됩니다.
pathUniform: 경로에 따른 스팬 분배에 대해 균일 또는 곡률 전략을 사용합니다.
profileUniform: 종단에 따른 스팬 분배에 대해 균일 또는 곡률 전략을 사용합니다.
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
축 원점 및 축 방향을 기준으로 형성된 축 주위의 종단 곡선을 스윕하여
T-Spline 표면을 만듭니다(start_angle(도)에서 시작하고
sweep_angle(도) 스윕).
profile: 종단 곡선
axisOrigin: 회전 중심
axisDirection: 회전 축
startAngle: 회전이 시작되는 각도
sweepAngle: 회전이 종료되는 각도
radialSpans: 반지름 스팬 수
axialSpans: 높이의 스팬 수입니다. 0 이하인 경우 자동으로 정의됩니다.
uniform: 스팬 분배에 대해 균일 또는 곡률 전략을 사용합니다.
symmetry: T-Spline 표면의 대칭 옵션
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
곡선 또는 선의 네트워크 밖에 파이프 표면을 만듭니다.
부드러운 접합이 각 곡선 교차점에 작성됩니다.
일부 매개변수는 곡선당 두 개 값으로 단일 값 또는 리스트를 가져옵니다.
curves: 파이프를 작성하는 곡선의 리스트
defaultRadius: 작성된 파이프의 기본 반지름
snappingTolerance: 곡선 교차점을 탐지하는 데 사용되는 공차
segmentsCount: 각 파이프의 세그먼트 수입니다. 곡선 개수보다 2배 더 긴 단일 값 또는 리스트가 허용됩니다.
endRotations: 각 파이프의 끝 회전 값(도)입니다. 곡선 개수보다 2배 더 긴 단일 값 또는 리스트가 허용됩니다.
endRadii: 각 파이프의 끝 반지름 값입니다. 곡선 개수보다 2배 더 긴 단일 값 또는 리스트가 허용됩니다.
endPercentage: 각 입력 곡선의 끝에서 파이프 메쉬의 시작까지의 값입니다. 곡선 개수보다 2배 더 긴 단일 값 또는 리스트가 허용됩니다.
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
곡선 또는 선 네트워크 밖에 파이프 표면을 만듭니다.
부드러운 접합이 각 곡선 교차점에 작성됩니다.
일부 매개변수는 곡선당 1개 값으로 단일 값 또는 리스트를 가져옵니다.
curves: 파이프를 작성하는 곡선의 리스트
defaultRadius: 작성된 파이프의 기본 반지름
snappingTolerance: 곡선 교차점을 탐지하는 데 사용되는 공차
segmentsCount: 각 곡선의 세그먼트 수입니다. 리스트 크기는 곡선 개수이거나 복제의 경우 1, 자동 결정의 경우 0일 수 있습니다.
autoHandleStart: true이면 각 곡선 시작 부분의 핸들 매개변수가 자동으로 생성되고, rotationsAtStart, radiiAtStart 및 positionsAtStart의 사용자 매개변수는 무시됩니다.
autoHandleEnd: true이면 각 곡선 끝부분의 핸들 매개변수가 자동으로 생성되고, rotationsAtEnd, radiiAtEnd 및 positionsAtEnd의 사용자 매개변수는 무시됩니다.
startRotations: 각 곡선 시작 부분에 있는 각 파이프 핸들의 사용자 회전 각도(도)입니다. autoHandleStart가 true이면 이 매개변수는 무시됩니다. 리스트 크기는 곡선 개수이거나 복제의 경우 1일 수 있습니다.
endRotations: 각 곡선 끝부분에 있는 각 파이프 핸들의 사용자 회전 각도(도)입니다. autoHandleEnd가 true이면 이 매개변수는 무시됩니다. 리스트 크기는 곡선 개수이거나 복제의 경우 1일 수 있습니다.
startRadii: 각 곡선 시작 부분에 있는 각 파이프 핸들의 사용자 반지름입니다. autoHandleStart가 true이면 이 매개변수는 무시됩니다. 리스트 크기는 곡선 개수이거나 복제의 경우 1일 수 있습니다.
endRadii: 각 곡선 끝부분에 있는 각 파이프 핸들의 사용자 반지름입니다. autoHandleEnd가 true이면 이 매개변수는 무시됩니다. 리스트 크기는 곡선 개수이거나 복제의 경우 1일 수 있습니다.
startPositions: 각 곡선의 시작 부분에 있는 각 파이프 핸들의 사용자 위치를 곡선의 호 길이에 따라 0과 1 사이의 백분율로 나타낸 것입니다. autoHandleStart가 true이면 이 매개변수는 무시됩니다. 리스트의 크기는 곡선 개수이거나 복제의 경우 1일 수 있습니다. 각 곡선에서 시작 위치 및 끝 위치는 서로 겹치지 않아야 합니다. 시작 위치는 0에 가까울수록, 끝 위치는 1에 가까울수록 좋습니다.
endPositions: 각 곡선의 끝 부분에 있는 각 파이프 핸들의 사용자 위치를 곡선의 호 길이에 따라 0과 1 사이의 백분율로 나타낸 것입니다. autoHandleEnd가 true이면 이 매개변수는 무시됩니다. 리스트의 크기는 곡선 개수이거나 복제의 경우 1일 수 있습니다. 각 곡선에서 시작 위치 및 끝 위치는 서로 겹치지 않아야 합니다. 시작 위치는 0에 가까울수록, 끝 위치는 1에 가까울수록 좋습니다.
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
지정된 T-Spline 표면을 단일 표면으로 결합합니다.
표면은 서로 연결되지 않습니다.
최소 한 개 이상 표면이 상자 모드에 있으면 출력 표면 역시 상자 모드에 있습니다.
tSplineSurfaces: 결합할 T-Spline 표면
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
T-Spline이 상자 모드 또는 부드럽게 모드에 있는지 여부
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
T-Spline이 열려 있는지 여부입니다.
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
TSpline 표면을 모양에 따라 솔리드 또는 표면으로 변환합니다.
matchTopology: TSpline과 같은 위상이 결과 본체에 있는지 여부를 결정합니다.
Returns: 위상 도면요소(솔리드 또는 표면)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
T-Spline 표면을 메쉬로 변환합니다. 메쉬에는 삼각형과 쿼드 모두 있습니다.
minSegments: 각 방향으로 세그먼트의 최소 수입니다. 최소 1개 세그먼트가 항상 생성됩니다.
tolerance: 메쉬에서 표면까지 허용되는 최대 거리입니다. 0 또는 음수 값으로 설정하면 사용할 수 없게 됩니다.
Returns: 메쉬 도면요소
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
지정된 정점 리스트를 단일 정점으로 용접합니다.
vertices: 용접할 정점
newPosition: 결과 정점 그립의 위치입니다. 그립의 평균 위치는 null이 전달된 후 사용됩니다.
keepSubdCreases: 입력 위상의 하위 각진 부분을 유지합니다.
Returns: 용접된 정점이 있는 TSpline 표면
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
지정된 모든 정점을 용접 해제합니다. 각 정점의 모든 모서리가 용접 해제됩니다.
vertices: 용접 해제할 정점 세트
Returns: 용접 해제된 정점이 있는 TSpline 표면
tspline,unweld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
T-Spline 및 곡선의 닫힌 루프와 일치하게 만듭니다.
tsEdges: 일치하게 만드는 닫힌 T-Spline 모서리 루프
curves: 일치하게 만드는 닫힌 곡선 루프
continuity: G0, G1, G2와 일치하게 만드는 형상 연속성
useArclength: 일치하게 만드는 동안 arcLength 정렬 사용 여부
useRefinement: True이면 추가 제어점이 T-Spline에 추가되어 지정된 공차 이내로 표면을 일치시킵니다.
numRefinementSteps: 미세 조정 단계의 최대 수입니다. useRefinement가 False로 설정되어 있으면 무시됩니다.
refinementTolerance: 도달할 공차입니다. useRefinement가 False로 설정되어 있으면 무시됩니다.
usePropagation: 일치하게 만드는 동안 전파 사용 여부
widthOfPropagation: 일치에 영향을 받는 표면의 정도를 결정합니다. usePropagation이 False로 설정되어 있으면 무시됩니다.
tangentScale: 접선 축척입니다. 연속성이 G1로 설정되어 있지 않으면 무시됩니다.
curvParamWeight: 곡률 매개변수 가중치입니다. 연속성이 G2로 설정되어 있지 않으면 무시됩니다.
flipSourceTargetAlignment: 정렬 방향의 반향 여부
Returns: 지정된 T-Spline 경계 모서리와 곡선 루프 사이에 위치한 T-Spline 표면
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
T-Spline 및 곡선의 닫힌 루프와 일치하게 만듭니다.
tsEdges: 일치하게 만드는 닫힌 T-Spline 모서리 루프
curves: 일치하게 만드는 닫힌 곡선 루프
continuity: G0, G1, G2와 일치하게 만드는 형상 연속성
useArclength: 일치하게 만드는 동안 arcLength 정렬 사용 여부
useRefinement: true이면 추가 제어점이 T-Spline에 추가되어 지정된 공차 이내로 표면을 일치시킵니다.
numRefinementSteps: 미세 조정 단계의 최대 수입니다. useRefinement가 false로 설정되어 있으면 무시됩니다.
refinementTolerance: 도달할 공차입니다. useRefinement가 false로 설정되어 있으면 무시됩니다.
usePropagation: 일치하게 만드는 동안 전파 사용 여부
widthOfPropagation: 일치에 영향을 받는 표면의 정도를 결정합니다. usePropagation이 false로 설정되어 있으면 무시됩니다.
scale: G1의 경우 접선 축척이고, G2의 경우 곡률 축척입니다. 연속성이 G0이면 무시됩니다.
flipSourceTargetAlignment: 정렬 방향의 반향 여부
Returns: 지정된 T-Spline 경계 모서리와 곡선 루프 사이에 위치한 T-Spline 표면
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
T-Spline 및 BRep 모서리의 닫힌 루프와 일치하게 만듭니다.
먼저, 모서리 루프가 곡선 루프로 변환되고 일치가 수행됩니다.
tsEdges: 일치하게 만드는 닫힌 T-Spline 모서리 루프
brepEdges: 일치하게 만드는 닫힌 BRep 모서리 루프
continuity: G0, G1, G2와 일치하게 만드는 형상 연속성
useArclength: 일치하게 만드는 동안 arcLength 정렬 사용 여부
useRefinement: True이면 추가 제어점이 T-Spline에 추가되어 지정된 공차 이내로 표면을 일치시킵니다.
numRefinementSteps: 미세 조정 단계의 최대 수입니다. useRefinement가 False로 설정되어 있으면 무시됩니다.
refinementTolerance: 도달할 공차입니다. useRefinement가 False로 설정되어 있으면 무시됩니다.
usePropagation: 일치하게 만드는 동안 전파 사용 여부
widthOfPropagation: 일치에 영향을 받는 표면의 정도를 결정합니다. usePropagation이 False로 설정되어 있으면 무시됩니다.
tangentScale: 접선 축척입니다. 연속성이 G1로 설정되어 있지 않으면 무시됩니다.
curvParamWeight: 곡률 매개변수 가중치입니다. 연속성이 G2로 설정되어 있지 않으면 무시됩니다.
flipSourceTargetAlignment: 정렬 방향의 반향 여부
Returns: 지정된 T-Splie 경계 모서리와 BRep 모서리 루프 사이에 위치한 T-Spline 표면
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
T-Spline 시각화 스타일을 변경합니다.
True가 전달되면 부드러운 시각화가 적용되고 그렇지 않으면 상자 모드가 적용됩니다.
enable: 부드러운 시각화 활성화 또는 비활성화
Returns: 선택한 시각화 스타일이 적용된 T-Spline
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExtrudeEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},Autodesk.DesignScript.Geometry.Vector,System.Int32)
모서리 세트에서 단일 또는 다중 대칭 돌출을 수행하고 지정된 벡터를 따라 새 모서리를 이동합니다.
edges: 돌출할 모서리 세트
direction: 새 모서리를 이동시킬 벡터
spans: 작성될 새 세그먼트의 양
Returns: 돌출된 모서리가 있는 T-Spline
tspline,extrude,direction,vector,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
두 면 세트 사이에 브리지를 생성합니다. 첫 번째 그룹의 항목은
이 표면의 하위로 간주됩니다. 두 번째 그룹의  항목은
이 표면의 하위에 있거나 다른 표면에 속할 수 있습니다.
각 그룹 내의 위상은 인접하지 않을 수 있지만,
같은 개수의 개별 루프를 만들어야 합니다.
firstGroup: 브리지할 면의 첫 번째 그룹
secondGroup: 브리지할 면의 두 번째 그룹
followCurves: 각 별개의 위상 루프에 대해 곡선 브리지
(빈 리스트가 전달되면 직선이 사용되고 하나의 곡선이 전달되면
둘 이상 입력 루프가 탐지된 경우 곡선이 복제됨)
frameRotations: 위상의 각 별개의 루프에 대해 브리지되는 곡선을
따라 프레임의 법선 주위를 완전히 회전하는 수
(빈 리스트가 전달되면 0이 사용되고 하나의 값이 전달되면
둘 이상 입력 루프가 탐지된 경우 해당 값이 복제됨)
spansCounts: 각 별개의 위상 루프에 대한 브리지를 따라
따라 위치하는 세그먼트 수입니다. 각 그룹의 스팬 개수는
해당하는 회전 수보다 커야 합니다(빈 리스트가 전달되면 1이
사용되고 하나의 값이 전달되면 둘 이상 입력 루프가 탐지된 경우
해당 값이 복제됨).
cleanBorderBridges: 경계 모서리 사이의 브리지를 삭제합니다.
keepSubdCreases: 입력 위상의 하위 각진 부분을
유지합니다.
firstAlignVertices: 첫 번째 그룹에서 각 별개의
위상 루프에 대한 방향이 지정된 정점의 리스트입니다(정점 수는
비어 있을 수 있는 탐지된 입력 루프 또는 리스트와 같아야 함).
secondAlignVertices: 두 번째 그룹에서 각 별개의
위상 루프에 대한 방향이 지정된 정점의 리스트입니다(정점 수는
비어 있을 수 있는 탐지된 입력 루프 또는 리스트와 같아야 함).
flipAlignmentFlags: 해당하는 위상 루프에 대해
브리지의 정렬을 반전하는지 여부를 표시하는 플래그의 리스트입니다
(빈 리스트가 전달되면 False로 설정되고, 하나의 값이 전달되면
탐지된 각 입력 루프에 대해 해당 값이 복제됨).
Returns: 브리지에 의해 연결된 위상이 있는 TSpline 표면
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
면 세트와 모서리 세트 사이에 브리지를 만듭니다. 첫 번째
그룹의 항목은 이 표면의 하위로 간주됩니다. 두 번째
그룹의 항목은 이 표면의 하위이거나 다른 표면에 속할 수 있습니다.
각 그룹 내의 위상은 인접하지 않을 수 있지만
동일한 개수의 별개 루프를 만들어야 합니다.
firstGroup: 브리지할 면의 첫 번째 그룹
secondGroup: 브리지할 모서리의 두 번째 그룹
followCurves: 각 별개의 위상 루프에 대해 곡선 브리지
(빈 리스트가 전달되면 직선이 사용되고 하나의 곡선이 전달되면
둘 이상 입력 루프가 탐지된 경우 곡선이 복제됨)
frameRotations: 위상의 각 별개의 루프에 대해 브리지되는 곡선을
따라 프레임의 법선 주위를 완전히 회전하는 수
(빈 리스트가 전달되면 0이 사용되고 하나의 값이 전달되면
둘 이상 입력 루프가 탐지된 경우 해당 값이 복제됨)
spansCounts: 각 별개의 위상 루프에 대한 브리지를 따라
따라 위치하는 세그먼트 수입니다. 각 그룹의 스팬 개수는
해당하는 회전 수보다 커야 합니다(빈 리스트가 전달되면 1이
사용되고 하나의 값이 전달되면 둘 이상 입력 루프가 탐지된 경우
해당 값이 복제됨).
cleanBorderBridges: 경계 모서리 사이의 브리지를 삭제합니다.
keepSubdCreases: 입력 위상의 하위 각진 부분을
유지합니다.
firstAlignVertices: 첫 번째 그룹에서 각 별개의
위상 루프에 대한 방향이 지정된 정점의 리스트입니다(정점 수는
비어 있을 수 있는 탐지된 입력 루프 또는 리스트와 같아야 함).
secondAlignVertices: 두 번째 그룹에서 각 별개의
위상 루프에 대한 방향이 지정된 정점의 리스트입니다(정점 수는
비어 있을 수 있는 탐지된 입력 루프 또는 리스트와 같아야 함).
flipAlignmentFlags: 해당하는 위상 루프에 대해
브리지의 정렬을 반전하는지 여부를 표시하는 플래그의 리스트입니다
(빈 리스트가 전달되면 False로 설정되고, 하나의 값이 전달되면
탐지된 각 입력 루프에 대해 해당 값이 복제됨).
Returns: 브리지에 의해 연결된 위상이 있는 TSpline 표면
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
모서리 세트와 면 세트 사이에 브리지를 만듭니다. 첫 번째 그룹의
항목은 이 표면의 하위로 간주됩니다. 두 번째 그룹의
항목은  이 표면의 하위이거나 다른 표면에 속할 수 있습니다.
각 그룹 내의 위상은 인접하지 않을 수 있지만
동일한 개수의 별개 루프를 만들어야 합니다.
firstGroup: 브리지할 모서리의 첫 번째 그룹
secondGroup: 브리지할 면의 두 번째 면
followCurves: 각 별개의 위상 루프에 대해 곡선 브리지
(빈 리스트가 전달되면 직선이 사용되고
하나의 곡선이 전달되면 둘 이상 입력 루프가 탐지된 경우 곡선이 복제됨)
frameRotations: 위상의 각 별개의 루프에 대해 브리지되는 곡선을
따라 프레임의 법선 주위를 완전히 회전하는 수
(빈 리스트가 전달되면 0이 사용되고 하나의 값이 전달되면
둘 이상 입력 루프가 탐지된 경우 해당 값이 복제됨)
spansCounts: 각 별개의 위상 루프에 대한 브리지를 따라
따라 위치하는 세그먼트 수입니다. 각 그룹의 스팬 개수는
해당하는 회전 수보다 커야 합니다(빈 리스트가 전달되면 1이
사용되고 하나의 값이 전달되면 둘 이상 입력 루프가 탐지된 경우
해당 값이 복제됨).
cleanBorderBridges: 경계 모서리 사이의 브리지를 삭제합니다.
keepSubdCreases: 입력 위상의 하위 각진 부분을
유지합니다.
firstAlignVertices: 첫 번째 그룹에서 각 별개의
위상 루프에 대한 방향이 지정된 정점의 리스트입니다(정점 수는
비어 있을 수 있는 탐지된 입력 루프 또는 리스트와 같아야 함).
secondAlignVertices: 두 번째 그룹에서 각 별개의
위상 루프에 대한 방향이 지정된 정점의 리스트입니다(정점 수는
비어 있을 수 있는 탐지된 입력 루프 또는 리스트와 같아야 함).
flipAlignmentFlags: 해당하는 위상 루프에 대해
브리지의 정렬을 반전하는지 여부를 표시하는 플래그의 리스트입니다
(빈 리스트가 전달되면 False로 설정되고, 하나의 값이 전달되면
탐지된 각 입력 루프에 대해 해당 값이 복제됨).
Returns: 브리지에 의해 연결된 위상이 있는 TSpline 표면
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
모서리 세트 사이에 브리지를 만듭니다. 첫 번째
그룹의 항목은 이 표면의 하위로 간주됩니다. 두 번째
그룹의 항목은 이 표면의 하위이거나 다른 표면에 속할 수 있습니다.
각 그룹 내의 위상은 인접하지 않을 수 있지만
동일한 개수의 별개 루프를 만들어야 합니다.
firstGroup: 브리지할 모서리의 첫 번째 그룹
secondGroup: 브리지할 모서리의 두 번째 그룹
followCurves: 각 별개의 위상 루프에 대해 곡선 브리지
(빈 리스트가 전달되면 직선이 사용되고 하나의 곡선이 전달되면
둘 이상 입력 루프가 탐지된 경우 곡선이 복제됨)
frameRotations: 위상의 각 별개의 루프에 대해 브리지되는 곡선을
따라 프레임의 법선 주위를 완전히 회전하는 수
(빈 리스트가 전달되면 0이 사용되고 하나의 값이 전달되면
둘 이상 입력 루프가 탐지된 경우 해당 값이 복제됨)
spansCounts: 각 별개의 위상 루프에 대한 브리지를 따라
따라 위치하는 세그먼트 수입니다. 각 그룹의 스팬 개수는
해당하는 회전 수보다 커야 합니다(빈 리스트가 전달되면 1이
사용되고 하나의 값이 전달되면 둘 이상 입력 루프가 탐지된 경우
해당 값이 복제됨).
cleanBorderBridges: 경계 모서리 사이의 브리지를 삭제합니다.
keepSubdCreases: 입력 위상의 하위 각진 부분을
유지합니다.
firstAlignVertices: 첫 번째 그룹에서 각 별개의
위상 루프에 대한 방향이 지정된 정점의 리스트입니다(정점 수는
비어 있을 수 있는 탐지된 입력 루프 또는 리스트와 같아야 함).
secondAlignVertices: 두 번째 그룹에서 각 별개의
위상 루프에 대한 방향이 지정된 정점의 리스트입니다(정점 수는
비어 있을 수 있는 탐지된 입력 루프 또는 리스트와 같아야 함).
flipAlignmentFlags: 해당하는 위상 루프에 대해
브리지의 정렬을 반전하는지 여부를 표시하는 플래그의 리스트입니다
(빈 리스트가 전달되면 False로 설정되고, 하나의 값이 전달되면
탐지된 각 입력 루프에 대해 해당 값이 복제됨).
Returns: 브리지에 의해 연결된 위상이 있는 TSpline 표면
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
T-Spline의 구멍 채우기
edges: 안쪽에 구멍이 있는 모서리 세트입니다. 모서리는 반드시 경계여야 합니다.
fillMethod: 구멍 채우기 방법: 0 - 다듬기, 1 - 다각형, 2 - 축소, 3 - 축소 및 용접
keepSubdCreases: 입력 위상의 하위 각진 부분을 유지합니다.
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
표면의 모든 위상을 압축하고 색인을 연속하도록 만듭니다. 이 기능은 색인의 상대 순서를 유지합니다.
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
전향 보간법은 제어점을 표면에 해당하는 파라메트릭 위치로 이동시킵니다. 후향 보간법은 각각의 원래 제어점에 대한 표면에 점을 생성하고 이 제어점을 해당하는 표면 점으로 이동시킵니다.
reverse: 보간 방향: False인 경우 전향, 그렇지 않으면 후향
Returns: 지정된 방향으로 보간된 T-Spline
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
지정된 정점의 제어점을 단일 평면으로 평평하게 합니다.
이 명령은 최소 4개 이상 정점의 입력이 필요합니다.
vertices: 정점 리스트
Returns: 평평해진 정점이 있는 T-Spline 표면
tspline,flatten,vertices

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Plane)
지정된 정점의 제어점을 지정된 평면과 평행해지는
단일 평면으로 평평하게 합니다.
이 명령은 최소 4개 이상 정점의 입력이 필요합니다.
vertices: 정점 리스트
parallelPlane: 정점을 평행하게 맞출 평면
Returns: 평평해진 정점이 있는 T-Spline 표면
tspline,flatten,vertices,fitparallel

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
지정된 벡터를 따라 지정된 점을 이동합니다.
vertices: 이동할 정점 리스트
vector: 이동할 방향
onSurface: 표면 또는 정점의 제어점을 사용하는지 여부를 표시하는 플래그

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
T-스플라인 표면을 T-스플라인 메시 형식의 문자열로 씁니다.
tSplineSurface: 직렬화할 T-스플라인 표면
Returns: T-스플라인 표면이 직렬화되는 문자열
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
T-Spline 메쉬 형식의 문자열에서 T-Spline 표면을 작성합니다.
content: T-Spline 메쉬 파일의 문자열 표현
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: 리스트에서 새로 로드된 T-Spline 표면
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
지정된 T-Spline 메쉬 파일에서 T-Spline 표면을 로드합니다.
filePath: 로드할 파일의 경로
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: 리스트에서 새로 로드된 T-Spline 표면
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
지정된 T-Spline 장면 파일에서 T-Spline 표면 세트를 로드합니다.
filePath: 로드할 파일의 경로
inSmoothMode: 상자 또는 부드러운 시각화로 T-Spline 표면 보기
Returns: 새로 로드된 T-Spline 표면 세트
tspline,import,load,tss,path