Autodesk.DesignScript.Geometry.EllipseArc.ToString
EllipseArc의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
X 및 Y축을 따라 지정된 반지름 및 스윕 각도로 평면에 EllipseArc를 만듭니다
plane: 타원 호가 포함된 평면
xRadius: 평면의 X방향에 있는 EllipseArc의 반지름
yRadius: 평면의 Y방향에 있는 EllipseArc의 반지름
startAngle: 입력 평면의 양수 X축에서 측정된 호의 시작 각도
sweepAngle: 시작 각도 기준 스윕 각도(도)
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiStartAngleSweepAngle(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
X 및 Y축을 따라 지정된 반지름 및 스윕 각도로 평면에 EllipseArc를 만듭니다.
plane: EllipseArc가 포함된 평면
xRadius: 평면의 X방향에 있는 EllipseArc의 반지름
yRadius: 평면의 Y방향에 있는 EllipseArc의 반지름
startAngle: 입력 평면의 양수 X축에서 측정된 호의 시작 각도
sweepAngle: 시작 각도 기준 스윕 각도(도)
ellipsearc,arcs