Autodesk.DesignScript.Geometry.UV.ToString
UV의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
두 UV를 비교합니다
other: 다른 UV
Returns: 두 객체가 같은지 여부

Autodesk.DesignScript.Geometry.UV.GetHashCode
이 유형에 대한 hashcode를 가져옵니다
Returns: 이 객체 전용 hashcode

Autodesk.DesignScript.Geometry.UV.ByCoordinates(System.Double,System.Double)
두 double 값에서 UV를 만듭니다.
u: U value
v: V value
Returns: UV created by coordinates
surfaceparam,parameters,uv,uvs