Autodesk.DesignScript.Geometry.Curve.ToString
Curve의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
uv 공간에서 표면의 선으로 곡선을 만듭니다
baseSurface: 사용할 표면
startParams: 곡선이 시작되는 시작 UV
endParams: 곡선이 종료되는 끝 UV
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
두 곡선 사이에서 혼합되는 곡선을 만듭니다.
curve1: 혼합할 첫 번째 곡선
curve2: 혼합할 두 번째 곡선
endOrStart1: 혼합할 곡선1 끝을 나타내는 플래그
endOrStart2: 혼합할 곡선1 끝을 나타내는 플래그
isG2Continuous: 결과 곡선이 G1 연속성인지 또는 G2 연속성인지를 나타내는 플래그
Returns: 두 곡선을 혼합하여 생성된 곡선
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
표면의 등치선으로 곡선을 만듭니다
baseSurface: 기준 표면
direction: 0 등각선이 U 방향인 경우, 1 등각선이 V 방향인 경우
parameter: 기타 표면 매개변수의 곡선 값에 대해 고정
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
지정된 매개변수 위치의 점이 원점인 CoordinateSystem을 가져옵니다. XAxis는 곡선 법선에 정렬되고, YAxis는 이 점에서 접하는 곡선에 정렬되고, ZAxis는 이 점의 위쪽 벡터 또는 종법선에 정렬됩니다.
param: 매개변수 평가 위치
Returns: 곡선의 매개변수에 있는 CoordinateSystem
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
법선이 곡선의 접선에 정렬되는 평면을 반환합니다. 매개변수는 0이 항상 시작점, 1이 항상 끝점이 되도록 조정됩니다.
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtDistance(System.Double)
곡선을 따라 특정 호 길이의 점을 가져옵니다.
segmentLength: 평가할 곡선을 기준으로 하는 거리
Returns: 지정된 호 길이에 있는 점
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
분할 입력 수를 기준으로 곡선 길이를 따라 균등한 간격으로 있는 점을 반환합니다.
divisions: 분할 수
Returns: 곡선 길이를 따라 균등한 간격으로 있는 점

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
분할 입력 수를 기준으로 곡선을 딸 균등한 현 길이 간격으로 있는 점을 반환합니다.
divisions: 분할 수
Returns: 곡선에 있는 점 리스트

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
지정된 세그먼트 길이 및 지정된 점의 시작 위치에 있는 곡선을 따라 균등한 간격으로 있는 점을 반환합니다.
point: 측정할 위치에 있는 참조 점
segmentLength: 평가할 곡선을 기준으로 하는 거리
Returns: 곡선에 있는 점 리스트

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
지정된 점에서 시작하는 지정된 현 길이에 있는 곡선에 일정 간격으로 있는 점을 반환합니다.
point: 측정할 위치에 있는 참조 점
chordLength: 현 길이
Returns: 곡선에 있는 점 리스트

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
곡선 시작점에서 지정된 거리에 있는 CoordinateSystem을 반환합니다. Y축은 곡선에 접하며 X축은 곡률입니다.
segmentLength: 평가할 곡선을 기준으로 하는 거리
Returns: 곡선의 좌표계
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtDistance(System.Double)
곡선 시작점에서 지정된 거리에 있는 좌표계를 반환합니다. Y축은 곡선에 접하며 X축은 곡률입니다.
segmentLength: 평가할 곡선을 기준으로 하는 거리
Returns: 곡선의 좌표계
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
시작점에서 곡선을 따라 지정된 거리에 있는 평면을 반환합니다. 평면의 법선은 곡선의 접선에 정렬됩니다.
segmentLength: 평가할 곡선을 기준으로 하는 거리
Returns: 곡선에 있는 평면
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PlaneAtDistance(System.Double)
시작점에서 곡선을 따라 지정된 거리에 있는 평면을 반환합니다. 평면의 법선은 곡선의 접선에 정렬됩니다.
segmentLength: 평가할 곡선을 기준으로 하는 거리
Returns: 곡선에 있는 평면
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
곡선의 시작점에서 지정된 매개변수까지 측정된 세그먼트 길이를 가져옵니다.
param: 0~1 사이의 값
Returns: 세그먼트 길이
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtDistance(System.Double)
곡선을 따라 특정 호 길이의 매개변수를 가져옵니다.
segmentLength: 평가할 곡선을 기준으로 하는 거리
Returns: 매개변수
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.LengthBetweenParameters(System.Double,System.Double)
곡선의 두 매개변수 점 사이의 호 길이를 가져옵니다.
startParam: 도메인 시작 위치
endParam: 도메인 끝 위치
Returns: 두 매개변수 간의 호 길이
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
곡선을 따라 지정된 점에서 매개변수를 가져옵니다. 점이 곡선 위에 없으면 가장 가까운 매개변수를 가져옵니다. 입력 곡선이 PolyCurve이면 이 함수는 점이 PolyCurve에 있는 경우에만 유효한 매개변수를 반환합니다. 다른 곡선 유형의 경우 이 함수는 입력 점에서 가장 가까운 점에 있는 곡선을 따라 매개변수를 반환합니다.
point: 곡선을 따라 있는 점 또는 곡선 근처에 있는 점
Returns: PolyCurve 곡선에 대한 매개변수 또는 다른 곡선 유형의 곡선을 따라 있는 가장 가까운 매개변수.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.DivideEqually(System.Int32)
곡선을 길이가 같은 지정된 수의 곡선으로 분할합니다
divisions: 분할 수
Returns: 분할 후 곡선 배열
chopcurve,segment,slices

Autodesk.DesignScript.Geometry.Curve.DivideByDistance(System.Int32)
곡선을 각 곡선의 시작과 끝 사이(현)의 거리가 같은 지정된 수의 곡선으로 분할합니다.
divisions: 분할 수
Returns: 분할 후 곡선 배열
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByLengthFromParameter(System.Double,System.Double)
곡선을 지정된 매개변수 위치에서 측정되어 지정된 길이의 곡선으로 분할합니다.
length: 분할 후 곡선 길이
parameter: 측정 기준에 대한 매개변수 위치
Returns: 분할 후 곡선 배열
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByDistanceFromParameter(System.Double,System.Double)
곡선을 지정된 매개변수 위치에서 측정되어 지정된 현 길이의 곡선으로 분할합니다.
distance: 분할에서 가져온 각 곡선의 현 길이
parameter: 측정 기준에 대한 매개변수 위치
Returns: 분할 후 곡선 배열
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimStart(System.Double)
지정된 매개변수에서 곡선의 시작 부분을 제거합니다.
startParameter: 자르기를 시작할 매개변수 위치
Returns: 시작이 제거된 새 곡선
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimEnd(System.Double)
지정된 매개변수에서 곡선의 끝 부분을 제거합니다.
endParameter: 자르기를 시작할 매개변수 위치
Returns: 끝이 제거된 새 곡선
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrim(System.Double,System.Double)
지정된 매개변수에서 곡선의 시작과 끝 부분을 제거합니다.
startParameter: 자르기를 시작할 매개변수 위치
endParameter: 자르기를 시작할 매개변수 위치
Returns: 외부 세그먼트가 제거된 새 곡선
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.ParameterTrimInterior(System.Double,System.Double)
지정된 매개변수에서 곡선의 안쪽 부분을 제거합니다
startParameter: 자르기를 시작할 매개변수 위치
endParameter: 자르기를 시작할 매개변수 위치
Returns: 내부 세그먼트가 제거된 새 곡선
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimSegments(System.Double[])
곡선의 여러 세그먼트(첫 번째, 세 번째, 다섯 번째... 세그먼트 취소)를 제거합니다.
parameters: 곡선을 분할할 매개변수 위치 리스트
Returns: 첫 번째, 세 번째, 다섯 번째 ... 세그먼트를 무시하는 곡선 배열
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
부울이 true인 경우 곡선의 여러 세그먼트(두 번째, 네 번째, 여섯 번째... 세그먼트 무시)를 제거합니다.
parameters: 곡선을 분할할 매개변수 위치 리스트
discardEvenSegments: 세그먼트 무시 전환
Returns: 부울이 True인 경우 두 번째, 네 번째, 여섯 번째 ... 세그먼트를 무시하는 곡선 배열
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double)
지정된 매개변수에서 곡선을 두 조각으로 분할합니다
parameter: 분할할 매개변수 위치
Returns: 분할 후 남은 두 개의 곡선
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double)
지정된 매개변수에서 곡선을 두 조각으로 분할합니다.
parameter: 분할할 매개변수 위치
Returns: 분할 후 남은 두 개의 곡선
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double[])
지정된 매개변수에서 곡선을 여러 조각으로 분할합니다.
parameters: 곡선을 분할할 매개변수 위치 리스트
Returns: 분할로 인해 작성된 곡선
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
여러 개의 곡선을 polycurve 끝에 결합합니다. 연결을 보장하기 위해 곡선을 반전합니다.
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany

Autodesk.DesignScript.Geometry.Curve.Join(Autodesk.DesignScript.Geometry.Curve)
원래 곡선을 정확히 유지하면서 이 곡선과 입력 곡선을 새 PolyCurve로 결합합니다.
curve: 결합 대상 곡선
Returns: 두 개의 곡선으로 구성된 PolyCurve
convertcurve,curve2polycurve,joincurve,concat

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
곡선을 선택점에 의해 지정된 끝 부분에서 지정된 거리만큼 연장합니다. 선택된 쪽이 연장됩니다. 원 및 타원과 같이 닫힌 곡선은 연장할 수 없습니다.
distance: 연장할 거리
pickSide: 연장한 끝에 있는 점
Returns: 연장된 곡선
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
곡선을 시작 부분에서 지정된 거리만큼 연장합니다. 원 및 타원과 같이 닫힌 곡선은 연장할 수 없습니다.
distance: 연장할 거리
Returns: 연장된 곡선
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
곡선을 끝 부분에서 지정된 거리만큼 연장합니다. 원 및 타원과 같이 닫힌 곡선은 연장할 수 없습니다.
distance: 연장할 거리
Returns: 연장된 곡선
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
지정된 투영 방향을 따라 입력 곡선을 지정된 베이스 형상에 투영합니다. 베이스 형상에 투영할 형상의 ontoVectorList를 투영할 형상