Autodesk.DesignScript.Geometry.PolyCurve.ToString
PolyCurve의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
곡선을 결합하여 PolyCurve를 작성합니다. 연결이 필요한 경우 곡선을 반전합니다. 1e-6 ~ 1e-3 유닛 사이에서 기본 결합 공차를 선택합니다.
curves: PolyCurve에 결합할 곡선
joinTolerance: 결합할 곡선 간에 허용되는 간격 크기를 결정하는 공차
Returns: 결합된 곡선으로 작성된 Polycurve
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
점을 연결하여 PolyCurve를 만듭니다. 'connectLastToFirst' 입력을 True로 설정하고 PolyCurve를 닫습니다.
points: PolyCurve를 만들 점
connectLastToFirst: 마지막 점을 첫 번째 점을 연결하려면 True, 열린 상태로 유지하려면 false
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.Curves
polycurve의 곡선을 반환합니다
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
인덱스를 기준으로 polycurve의 곡선을 반환합니다
index: 점 찾기 길이
endOrStart: PolyCurve의 끝부터 개수를 세려면 True, PolyCurve의 시작부터 개수를 세려면 false
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
접하는 호로 polycurve를 연장합니다
length: 연장 호 길이
radius: 호 반지름
endOrStart: PolyCurve의 끝 또는 시작 연장

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
해당 평면에서 polycurve의 간격을 띄웁니다.
signedDistance: 간격띄우기 크기
extendCircular: 모서리를 원형으로 만들려면 전환
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
해당 평면에서 polycurve를 모깎기합니다.
radius: 모깎기 반지름
rightSide: PolyCurve의 시작에 대해 상대적으로 오른쪽 측면에서 모깎기를 하려면 True, 왼쪽에서 모깎기를 하려면 false
Returns: Filleted polyCurve
round,smooth,radius