Autodesk.DesignScript.Geometry.Ellipse.ToString
Ellipse의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
입력 점을 중심으로 WCS XY 평면과 일치하도록 지정된 X 및 Y축 반지름을 사용하여 타원을 만듭니다.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by origin and radii
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
입력 점을 중심으로 지정된 두 개의 축을 사용하여 타원을 만듭니다. 축은 서로 90도를 이뤄야 합니다.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from origin vectors
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
입력 CoordinateSystem을 중심으로 입력 CoordinateSystem과 일치하도록 CS X 방향의 x_radius 반지름 및 CS Y 방향의 y_radius 반지름을 사용하여 타원을 만듭니다.
origin: Origin coordinate system of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by coordinate system and radii
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
입력 평면을 중심으로 입력 평면과 일치하도록 평면 X축 방향의 x_radius 반지름 및 평면 Y축 방향의 y_radius 반지름을 사용하여 타원을 만듭니다.
plane: Plane where ellipse arc is drawn
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from plane and radii
ellipse,aligned ellipse,ellipsebylengths