Autodesk.DesignScript.Geometry.PolySurface.ToString
PolySurface의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
난간을 따라 곡선을 스윕하여 Polysurface를 만듭니다.
rail: 스윕할 곡선 방향
profile: 스윕 프로파일
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
점을 기준으로 표면을 찾습니다. 진행 방향으로 첫 번째 교차점을 가져옵니다. 표면 내부와 만나는 경우 하나의 표면, 모서리 내부와 만나는 경우 두 개의 표면, 정점과 만나는 경우 여러 개의 표면을 반환합니다
surfacesatpoint,findsurfaces,extractsurfaces

Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
Polysurface의 표면 수를 반환합니다.
Returns: Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
PolySurface의 모서리 수를 반환합니다.
Returns: Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
PolySurface의 정점 수를 반환합니다.
Returns: Number of vertices