Autodesk.DesignScript.Geometry.Sphere.ToString
Sphere의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Sphere.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
입력 점을 중심으로 지정된 반지름을 사용하여 솔리드 구를 만듭니다.
Brep,brep