Autodesk.DesignScript.Geometry.Line.ToString
Line의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Line.ByStartPointEndPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
두 입력 점 사이에 직선을 만듭니다.
startPoint: Line start point
endPoint: Line end point
Returns: Line from start and end point
line,linebypoints,lines

Autodesk.DesignScript.Geometry.Line.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
점의 산점도에 가장 가까운 선을 만듭니다.
bestFitPoints: List of points to best fit line
Returns: Line from fit through points
line,approximate,lines

Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
입력 곡선의 매개변수 점에서 입력 곡선에 접하는 선을 만듭니다.
curve: Base curve for tangent line
parameter: Parameter value
Returns: Tangent line
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
시작점에서 시작하여 벡터 방향으로 지정된 길이만큼 연장되는 직선을 만듭니다.
startPoint: Line start point
direction: Direction vector
length: Length of line
Returns: Line from start direction and length
linebyvector,lines