Autodesk.DesignScript.Geometry.NurbsSurface.ToString
NurbsSurface의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
지정된 보간 점과 U 및 V 각도를 사용하여 NurbsSurface를 만듭니다. 결과 표면은 모든 점을 통과합니다.
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
지정된 보간 점과 U 및 V 각도를 사용하여 NurbsSurface를 만듭니다. 결과 표면은 모든 점을 통과합니다. 접선의 수는 해당하는 방향의 점 수와 일치해야 합니다. 결과 표면은 U 및 V 방향으로 모두 3도가 됩니다.
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
여러 가지 표면 특성을 충족하는 NurbsSurface를 만듭니다. 이 방법은 가장 고급의 표면 작성 방법입니다. 결과 표면은 모든 점을 통과합니다. 접선의 수는 해당하는 방향의 점 수와 일치해야 합니다. 결과 표면은 U 및 V 방향으로 모두 3도가 됩니다. 모서리 도함수는 2차(dP/dUdV)여야 하며 [ lowU, lowV ], [ highU, lowV ],  [ lowU, highV ], [ highU, highV ] 순서로 제공되어야 합니다.
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
명시적 제어점과 지정된 U 및 V 각도를 사용하여 NurbsSurface를 만듭니다.
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
지정된 제어 정점, 노트, 가중치 및 U V 각도를 사용하여 NurbsSurface를 만듭니다. 데이터에는 위반할 경우 함수가 작동하지 않고 예외가 발생하는 여러 가지 제한 사항이 있습니다. 차수: u- 및 v- 각도 모두 1(구간적 선형 스플라인) 이상이고 26(ASM에 의해 지원되는 최대 B 스플라인 기본 각도)보다 작아야 합니다. 가중치: 모든 가중치 값은 양수여야 합니다(제공된 경우). 1e-11보다 작은 가중치는 거부되며 함수가 작동하지 않습니다. 노트: 두 노트 벡터 모두 감소하지 않는 시퀀스여야 합니다. 내부 노트 다중성은 시작/끝 노트의 차수 + 1 및 내부 노트의 차수보다 크지 않아야 합니다(이에 따라 G1 불연속성이 있는 표면을 나타낼 수 있습니다). 지정되지 않은 노트 벡터는 지원되지만 지정된 노트 벡터로 전환되며 해당되는 변경 사항은 제어점/가중치 데이터에 적용됩니다.
lines
0.4

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
NurbsSurface 제어점 가중치를 반환합니다. 가중치는 각 제어점이 곡선의 모양에 미치는 영향을 결정합니다.
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
U 방향의 표면 노트를 반환합니다. 노트는 제어점이 어디에서 어떻게 표면에 영향을 줄지 결정하는 데 사용되는 일련의 매개변수 값(double)입니다.
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
V 방향의 표면 노트를 반환합니다. 노트는 제어점이 어디에서 어떻게 표면에 영향을 줄지 결정하는 데 사용되는 일련의 매개변수 값(double)입니다.
Returns: Nurbs V knots of surface