Autodesk.DesignScript.Geometry.Edge.ToString
Edge의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Edge.CurveGeometry
모서리를 구성하는 기본 곡선

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
이 모서리에 인접한 면

Autodesk.DesignScript.Geometry.Edge.StartVertex
이 모서리가 시작하는 정점

Autodesk.DesignScript.Geometry.Edge.EndVertex
이 모서리가 끝나는 정점