Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
CoordinateSystem의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.CoordinateSystem.Identity
CoordinateSystem을 표준 좌표계로 만듭니다. 원점:
0, 0, 0, x축: 1, 0, 0, y축: 0, 1, 0, z축: 0, 0, 1
zero,wcs

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
입력 점을 원점으로 하고 X 및 Y축이 WCS X 및 Y축으로 설정된
CoordinateSystem을 만듭니다.
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByPlane(Autodesk.DesignScript.Geometry.Plane)
입력 평면 원점을 원점으로 하고 X 및 Y축이 평면에 배치되고 평면
X 및 Y축과 일치하는 CoordinateSystem을 만듭니다.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
원점에서 X 및 Y축으로 CoordinateSystem을 만듭니다.
입력 벡터는 CoordinateSystem을 만들기 전에 정규화됩니다.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
원점에서 X 및 Y축으로 CoordinateSystem을 만듭니다.
Z축은 완전히 무시됩니다. 입력 벡터는 CoordinateSystem을
만들기 전에 정규화됩니다.
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
지정된 좌표계를 기준으로 지정된 원통형 좌표 매개변수에서 CoordinateSystem을 만듭니다

Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
지정된 좌표계를 기준으로 지정된 구형 좌표 매개변수에서 CoordinateSystem을 만듭니다

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
이 CoordinateSystem의 역 좌표계를 가져올 수 있는지 여부 확인
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
축척이 직교인지, 즉 전단 구성요소가 있는지 테스트합니다.
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
축척이 직교이고 모든 벡터가 정규화되었는지 테스트합니다.
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
CoordinateSystem 원점을 나타내는 점을 만듭니다.
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
CoordinateSystem의 X축을 반환합니다.
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
CoordinateSystem의 Y축을 반환합니다.
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
CoordinateSystem의 Z축을 반환합니다.
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
CoordinateSystem의 X축 축척: X축 벡터의 길이를 반환합니다.

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
CoordinateSystem의 Y축 축척: Y축 벡터의 길이를 반환합니다.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
CoordinateSystem의 Z축 축척: Z축 벡터의 길이를 반환합니다.

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
이 CoordinateSystem의 역 좌표계를 가져옵니다. 이 CoordinateSystem을 형상의 조각에 적용하면 원래 조각의 반대가 됩니다.

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
이 항목 후 인수 CoordinateSystem 적용 - 결과 = 이 항목 * 다른 항목

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
이 항목 전 인수 CoordinateSystem 적용 - 결과 = 이 항목 * 다른 항목

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
X, Y 및 Z 축척 비율이 포함된 벡터를 반환합니다
Returns: 축척 조정된 벡터
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
두 CoordinateSystem이 같은지 확인합니다
other: 기타 좌표계
Returns: 좌표계가 같은 경우 true를 반환합니다.

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
지정된 CoordinateSystem을 각각 WCS에 정의된 x, y, z 방향으로 지정된
변위만큼 변환합니다.
xTranslation: X축 변위.
yTranslation: Y축 변위.
zTranslation: Z축 변위.
Returns: 변환된 CoordinateSystem.
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
입력 벡터의 방향 및 크기로 객체를 변환합니다.
direction: 변환 방향의 벡터
Returns: 변환된 좌표계
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
CoordinateSystem 유형을 지정된 방향으로 지정된 거리만큼 변환합니다.
direction: 변위 방향 벡터
distance: 지정된 방향의 변위 거리
Returns: 변환된 좌표계
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
이 CoordinateSystem을 소스 CoordinateSystem에서 새 컨텍스트
CoordinateSystem으로 변환합니다.
Returns: 변환된 CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
객체를 원점 및 축 주위로 지정된 각도만큼 회전합니다.
origin: 원점
axis: 회전을 위한 벡터 축
degrees: 회전할 각도
Returns: 회전된 좌표계
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
객체를 지정된 평면의 원점 및 법선 주위로 지정된 각도만큼 회전합니다.
plane: 법선을 가져올 평면
degrees: 회전 값(도)
Returns: 회전된 좌표계
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
원점 주위로 균일하게 축척 조정
amount: 축척 조정할 크기
Returns: 축척 조정된 좌표계
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
원점 주위로 균일하지 않게 축척 조정
xamount: X축에서 축척 조정할 크기
yamount: Y축에서 축척 조정할 크기
zamount: Z축에서 축척 조정할 크기
Returns: 축척 조정된 좌표계
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
지정된 평면 주위로 균일하지 않게 축척 조정
plane: 축척 조정할 기준 평면
xamount: X축에서 축척 조정할 크기
yamount: Y축에서 축척 조정할 크기
zamount: Z축에서 축척 조정할 크기
Returns: 축척 조정된 좌표계
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
다음을 사용하여 지정된 점 주위로 균일하게 축척 조정
basePoint: 축척 조정 기준점
from: 축척 조정 시작점
to: 축척 조정 끝점
Returns: 축척 조정된 좌표계
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
기준점, 시작점(출발) 및 끝점(도착)을 사용하여 하나의 치수로 축척을 조정합니다. 축척 조정 축은 기준점과 시작점 사이의 선에 의해 정의됩니다.
basePoint: 축척 조정 기준점
from: 축척 조정 시작점
to: 축척 조정 끝점
Returns: 축척 조정된 좌표계
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
기준 및 2개의 선택점에 의해 두 치수로 축척을 조정합니다. 두 선택점은 2D 축척 비율을 결정하기 위해 기준 평면에 투영됩니다
basePlane: 축척 조정 기준점
from: 축척 조정 시작점
to: 축척 조정 끝점
Returns: 축척 조정된 좌표계
resize,size,from,to,scale2d,2d