Autodesk.DesignScript.Geometry.Circle.ToString
Circle의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
표준 XY 평면의 입력 중심점과 반지름을 사용하고 표준 Z을 법선으로 사용하여 원을 만듭니다.
centerPoint: Center point of circle
radius: Radius
Returns: Circle created with center point and radius
circle

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadiusNormal(Autodesk.DesignScript.Geometry.Point,System.Double,Autodesk.DesignScript.Geometry.Vector)
지정된 중심점, 반지름 및 법선 방향을 사용하여 원을 만듭니다.
centerPoint: Center point of circle
radius: Radius
normal: Normal direction vector
Returns: Circle created with center point radius and normal
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
입력 평면 원점(루트)을 중심으로 지정된 반지름을 사용하여 입력 평면에 원을 만듭니다.
plane: Root of plane used to center circle
radius: Radius
Returns: Circle created with plane and radius
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
세 개의 입력 점을 통과하는 원을 만듭니다.
p1: 1st point of circle
p2: 2nd point of circle
p3: 3rd point of circle
circle

Autodesk.DesignScript.Geometry.Circle.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
점을 통과하는 최적 맞춤 원
points: 원을 맞출 점의 리스트
Returns: Circle created from points
circle,approximate