Autodesk.DesignScript.Geometry.Point.ToString
Point의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
두 Point를 비교합니다
other: 다른 Point
Returns: 두 객체가 같은지 여부

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
이 유형에 대한 hashcode를 가져옵니다
Returns: 이 객체 전용 hashcode

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
지정된 2개의 데카르트 좌표를 사용하여 XY 평면에 점을 형성합니다. Z 구성요소는 0입니다.
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
원점 (0,0,0) 가져오기
Returns: Origin point
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
지정된 3개의 데카르트 좌표를 사용하여 점을 형성합니다
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
3개의 데카르트 좌표를 사용하여 지정된 좌표계에서 점을 형성합니다
coordinateSystem: 상위 좌표계
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
포함된 점의 공차 내에서 중복을 제외하기 위해 점 삭제
points: 중복을 삭제할 점의 리스트
tolerance: 삭제에 사용되는 공차
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near