Autodesk.DesignScript.Geometry.Arc.ToString
Arc의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
점 모음에 가장 근접한 호 작성
points: 호를 맞추기 가장 적합한 점의 리스트
Returns: Arc created by best fit through points
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
시작점과 끝점 및 시작과 끝의 접촉 조건을 사용하여 호 또는 접선 이중 호를 만듭니다
point1: 이중 호 시작점
vector1: 이중 호 시작 접선 벡터
point2: 이중 호 끝점
vector2: 이중 호 끝 접선 벡터
arc,tangent

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
시작점에서 끝점까지 벡터의 시작 접선을 사용하여 호를 만듭니다
startPoint: Start point of arc
endPoint: End point of arc
startTangent: Start tangent direction vector
arc,tangent,arcs