Autodesk.DesignScript.Geometry.NurbsCurve.ToString
NurbsCurve의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
명시적 제어점을 사용하여 BSplineCurve를 만듭니다. 주 1: deg=1인 BSplineCurve에는 G1 불연속성이 있는데 이것은 돌출, 스윕 및 기타 작업에 문제를 일으키므로 사용을 피해야 합니다. 대신 PolyCurve를 사용하십시오.  주 2: 곡선이 주기적(닫힘)이면 첫 번째 점과 마지막 점이 동일해야 합니다.
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
명시적 제어점을 사용하여 BSplineCurve를 만듭니다. 주 1: deg=1인 BSplineCurve에는 G1 불연속성이 있는데 이것은 돌출, 스윕 및 기타 작업에 문제를 일으키므로 사용을 피해야 합니다. 대신 PolyCurve를 사용하십시오.  주 2: 곡선이 주기적(닫힘)이면 첫 번째 점과 마지막 점이 동일해야 합니다.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
명시적 제어점을 사용하여 BSplineCurve를 만듭니다. 주 1: deg=1인 BSplineCurve에는 G1 불연속성이 있는데 이것은 돌출, 스윕 및 기타 작업에 문제를 일으키므로 사용을 피해야 합니다. 대신 PolyCurve를 사용하십시오.  주 2: 곡선이 주기적(닫힘)이면 첫 번째 점과 마지막 점이 동일해야 합니다.
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
제어 정점, 가중치 및 노트에서 BSplineCurve를 만듭니다. ASM 문서: 차수: 1(구간적 선형 스플라인)보다 크고 26(ASM에 의해 지원되는 최대 B 스플라인 기본 각도)보다 작아야 합니다. 가중치: 모든 가중치 값은 양수여야 합니다(제공된 경우). 1e-11보다 작은 가중치는 거부되며 함수가 작동하지 않습니다. 노트: 노트 벡터는 감소하지 않는 시퀀스여야 합니다. 내부 노트 다중성은 시작/끝 노트의 차수 + 1 및 내부 노트의 차수보다 크지 않아야 합니다(이에 따라 G1 불연속성이 있는 곡선을 나타낼 수 있습니다). 지정되지 않은 노트 벡터는 지원되지만 지정된 노트 벡터로 전환되며 해당되는 변경 사항은 제어점/가중치 데이터에 적용됩니다. 노트 배열: 배열 크기는 num_control_points + 차수 + 1이어야 합니다
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
점 사이를 보간하여 BSplineCurve를 만듭니다.
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
점 사이를 보간하여 BSplineCurve를 만듭니다. 주 2: 곡선이 주기적인(닫힌) 경우 첫 번째와 마지막 점이 같아야 합니다.
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
점 사이를 지정된 각도로 보간하여 BSplineCurve를 만듭니다.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
점을 통과하는 BSplineCurve를 접선 방향과 함께 반환합니다.
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
NurbsCurve의 제어점을 가져옵니다. 이 점들은 곡선이 보간하는 점입니다.
Returns: 점의 배열

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
곡선의 노트. 노트는 제어점이 어디에서 어떻게 곡선에 영향을 줄지 결정하는 데 사용되는 일련의 매개변수 값(double)입니다.
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
NurbsCurve 제어점 가중치를 반환합니다. 가중치는 각 제어점이 곡선의 모양에 미치는 영향을 결정합니다.
Returns: Weights of nurbs curve
ptweight