Autodesk.DesignScript.Geometry.Vector.ToString
Vector의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
두 Vector를 비교합니다
other: 다른 Vector
Returns: 두 객체가 같은지 여부

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
이 유형에 대한 hashcode를 가져옵니다
Returns: 이 객체 전용 hashcode

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
3개의 유클리드 좌표로 벡터 형성
x: X 좌표
y: Y 좌표
z: Z 좌표
Returns: Vector created by coordinates
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
3개의 유클리드 좌표로 벡터를 형성하고 벡터 정규화
x: X 좌표
y: Y 좌표
z: Z 좌표
normalized: 벡터를 정규화하려면 True, 정규화하지 않으려면 false
Returns: Vector created by coordinates
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
두 개의 끝점으로 벡터를 형성합니다. 시작점에서 끝점까지 벡터가 형성됩니다.
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
표준 X축 벡터 (1,0,0) 가져오기
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
표준 Y축 벡터 (0,1,0) 가져오기
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
표준 Z축 벡터 (0,0,1) 가져오기
z,basis,up

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
두 벡터의 내적 형성
vec: a second vector
Returns: Resulting dot product
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
두 벡터가 평행한지 여부를 확인합니다.
otherVector: 기타 벡터
Returns: Returns True if the vectors are parallel; false otherwise.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
두 벡터가 거의 같은지 확인합니다. 정밀도 문제를 처리하기 위해 1e-5의 공차 값이 지정됩니다.
otherVector: 기타 벡터
Returns: Returns True if the vectors are almost equal; false otherwise.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
이 벡터를 입력 CoordinateSystem 매트릭스로 변환합니다.
coordinateSystem: 벡터를 변환하는 데 사용되는 좌표계
Returns: Transformed vector

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
벡터를 축 주위로 지정된 각도만큼 회전합니다
axis: Rotation axis vector
degrees: Number of degrees to rotate
Returns: Rotated vector
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
벡터를 평면 원점 및 법선 주위로 지정된 각도만큼 회전합니다
plane: 회전 평면
degrees: Number of degrees to rotate
Returns: Rotated vector
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
원점 주위로 벡터 축척을 균일하게 조정
scale_factor: Scale factor
Returns: Scaled vector
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
두 벡터 사이의 각도를 0~180도로 반환합니다.
otherVector: Other vector
Returns: Returns angle between the supplied vectors in degrees from 0 to 180.
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
두 벡터 사이의 각도를 [0, 180]도 범위에서 반환합니다.
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
두 벡터 사이의 각도를 0~360도로 반환합니다. 회전 축을 사용하여 각도 방향을 결정합니다.
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
두 벡터 사이의 각도를 [0, 360]도 범위에서 반환합니다. 회전 축을 사용하여 각도 방향을 결정합니다.
rotation angle