Autodesk.DesignScript.Geometry.Helix.ToString
Helix의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
나선을 만듭니다. 나선은 항상 제공된 축 주위를 시계 방향으로 회전합니다. 축 방향을 따라 표시되는 경우 뷰어는 점이 매개변수가 증가하는 방향으로 곡선을 따라 이동함에 따라 축 주위를 시계 방향으로 회전하는 점을 보게 됩니다. 피치는 한 번 회전할 때마다 나선이 축 방향으로 이동하는 거리입니다. 피치는 양수 또는 음수입니다.
axisPoint: Axis point
axisDirection: Axis direction vector
startPoint: Helix start point
pitch: Distance of the helix per each 360 degrees in the direction of the axis
angleTurns: How many turns in degrees
Returns: Helix created by axis
helix,screw,corkscrew,thread