Autodesk.DesignScript.Geometry.Rectangle.ToString
Rectangle의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
네 개의 모서리 점으로 직사각형을 만듭니다.
points: List of corner points of rectangle
Returns: Rectangle created by corner points
rectbypointarray

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
네 개의 모서리 점으로 직사각형을 만듭니다.
p1: 1st corner point of rectangle
p2: 2nd corner point of rectangle
p3: 3rd corner point of rectangle
p4: 4th corner point of rectangle
Returns: Rectangle created by corner points
rectbypoints

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
WCS XY 평면에 WCS 원점을 중심으로 지정된 폭(X축 길이)과 길이(Y축 길이)를 사용하여 직사각형을 작성합니다.
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
입력 평면 루트를 중심으로 입력 폭(평면 X축 길이)과 길이(평면 Y축 길이)를 사용하여 직사각형을 작성합니다.
plane: Plane used to center rectangle
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
좌표 시스템 XY 평면에 입력 원점을 중심으로 지정된 폭(X축 길이)과 길이(Y축 길이)를 사용하여 직사각형을 작성합니다.
coordinateSystem: 직사각형의 좌표계(직사각형의 중심)
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created from width and length
rectbylengths