Autodesk.DesignScript.Geometry.Properties.Resources.LowerModelerExtentExceeded
'입력이 허용되는 모델링 범위를 벗어났습니다. '설정 => 형상 작업 범위'에서 모델링 범위를 {1}에서 {2} 사이로 지정하여 {0} 설정을 선택해 보십시오.' 대화상자와 유사한 현지화된 문자열을 조회합니다.

Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
'허용되는 모델링 범위를 초과했습니다. 더 작은 값을 선택해 보십시오.'와 유사한 현지화된 문자열을 조회합니다.

Autodesk.DesignScript.Geometry.Properties.Resources.UpperModelerExtentExceeded
'입력이 허용되는 모델링 범위를 벗어났습니다. '설정 => 형상 작업 범위'에서 모델링 범위를 {1}에서 {2} 사이로 지정하여 {0} 설정을 선택해 보십시오.' 대화상자와 유사한 현지화된 문자열을 조회합니다.