Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
TSplineTopology의 문자열 표현을 가져옵니다.

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
지정된 색인의 정점 반환
index: 다음 위치의 정점을 가져오는 색인
Returns: T-Spline 정점
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
지정된 색인의 모서리 반환
index: 다음 위치의 모서리를 가져오는 색인
Returns: T-Spline 모서리
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
지정된 색인의 면 반환
index: 다음 위치의 면을 가져오는 색인
Returns: T-Spline 면
tspline,face,byindex