Autodesk.DesignScript.Geometry.IndexGroup.ToString
IndexGroup의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
두 IndexGroup을 비교합니다
other: 다른 IndexGroup
Returns: 두 객체가 같은지 여부

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
이 유형에 대한 hashcode를 가져옵니다
Returns: 이 객체 전용 hashcode

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
네 개의 인덱스를 저장하는 IndexGroup을 만듭니다
a: Index a
b: Index b
c: Index c
d: Index d
Returns: IndexGroup
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
세 개의 인덱스를 저장하는 IndexGroup을 만듭니다
a: Index a
b: Index b
c: Index c
Returns: IndexGroup
tri,polygon,mesh,meshes