Autodesk.DesignScript.Geometry.Solid.ToString
Solid의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
안내 곡선을 사용하여 입력 횡단면 닫힌 곡선 사이에서 로프트하여 솔리드를 만듭니다. 안내 곡선은 모든 횡단면 곡선과 교차해야 합니다.
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
안내 곡선을 사용하여 입력 횡단면 닫힌 곡선 사이에서 로프트하여 솔리드를 만듭니다. 안내 곡선은 모든 횡단면 곡선과 교차해야 합니다.
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
닫힌 PolyCurves를 구성하는 입력 횡단면 사이에서 로프트하여 솔리드를 만듭니다. 이 작업은 선 세그먼트로 구성된 단면에만 최적화되어 있으며 정점은 동일한 순서를 따릅니다. 확인 및 복구 옵션을 활성화하면 생성된 솔리드의 유효성이 보장되며, 비활성화하면 성능이 개선됩니다.
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
닫힌 프로파일 곡선을 두 개의 난간 곡선을 따라 스윕합니다.
path: 스윕할 입력 경로입니다.
guideRail: 스윕 방향을 안내하는 레일입니다.
profile: The profile curve to sweep along the path
Brep,brep,sweep2,guides,sweepprofile

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
회전의 솔리드를 만들고, 시작 각도(도)에서 스윕 각도(도)까지 원점에 의해 형성된 광선 축과 벡터 축 주위로 프로파일 곡선을 스윕합니다.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Solid created by revolve
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
솔리드의 리스트를 이 솔리드와 결합합니다.
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
이 솔리드와 다른 솔리드의 부울 차이

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
이 솔리드의 면에서 솔리드 쉘 가져오기
internalFaceThickness: 쉘 안쪽으로 확장할 거리
externalFaceThickness: 쉘 바깥쪽으로 확장한 거리
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
입력 형상을 입력 벡터 방향으로 이 솔리드에 투영합니다.  !!이 투영 방법은 현재 점 또는 곡선만 지원합니다!!
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
둘 이상의 분해된 럼프로 구성된 경우 솔리드를 개별 솔리드로 분리합니다. 하나의 연속된 럼프인 경우 동일한 솔리드를 반환합니다.
Returns: 분해된 솔리드 분리
split,disjoint