Autodesk.DesignScript.Geometry.BoundingBox.ToString
BoundingBox의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
두 BoundingBox를 비교합니다
other: 다른 BoundingBox
Returns: 두 객체가 같은지 여부

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
이 유형에 대한 hashcode를 가져옵니다
Returns: 이 객체 전용 hashcode

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
입력 형상 주위로 축에 정렬되는 BoundingBox를 만듭니다.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
입력 형상 주위로 축에 정렬되는 BoundingBox를 만듭니다.
geom: Geometries to determine bounding box
Returns: Bounding box enclosing geometries
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
입력 형상 주위에 CoordinateSystem의 X, Y 및 Z축 방향으로 축에 정렬되지 않는 BoundingBox를 만듭니다.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
입력 형상 주위에 CoordinateSystem의 X, Y 및 Z축 방향으로 축에 정렬되지 않는 BoundingBox를 만듭니다.
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
최소 좌표(상자의 왼쪽 하단 후면 모서리)에서 최대 좌표(상자의 오른쪽 상단 전면 모서리)까지 BoundingBox를 구성합니다. CoordinateSystem은 상자의 좌표 공간에서 모델 공간으로의 변환입니다. 이 방법은 Revit의 API와 일치하도록 설계되어, 아무 변환 없이 Revit BoundingBox에서 매개변수를 추출할 수 있습니다.
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
이 BoundingBox가 정의된 CoordinateSystem

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
두 BoundingBox의 교차점 가져오기
other: Other bounding box to intersect
Returns: Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
두 BoundingBox가 교차하는지 여부 확인
other: Other bounding box
Returns: Do bounding boxes intersect
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
BoundingBox가 비어 있는지 확인
Returns: Returns true if the bounding box is empty