Autodesk.DesignScript.Geometry.Polygon.ToString
Polygon의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
점이 자체 교차하지 않고 평면형 다각형 내에 있는지 확인합니다.