Autodesk.DesignScript.Geometry.Mesh.ToString
Mesh의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Mesh.ByPointsFaceIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
점 모음 및 점 모음을 참조하는 IndexGroup 모음에서 메쉬를 만듭니다
vertexPositions: List of points that determine vertex positions
indices: Indices for vertices
Returns: Mesh created from points
mesh,meshes