Autodesk.DesignScript.Geometry.Plane.ToString
Plane의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
루트 점을 중심으로 입력 법선 벡터를 사용하여 평면을 만듭니다.
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
벡터 법선에 원점을 두고 특정한 X축 방향으로 "방향이 지정된" 평면을 만듭니다. 분할, 교차, 투영 등의 작업에 영향을 미치지 않으며 입력 CoordinateSystem의 방향만을 지정합니다.
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
X 및 Y축은 평면에 있습니다. Z축은 두 벡터의 외적입니다.
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
평면을 입력 점에 맞춥니다. 기본적으로 3D 산점도 맞춤입니다.
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
입력 선 및 외부 점이 포함된 평면을 만듭니다. 점은 선 또는 선 축에 놓을 수 없습니다.
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
표준 XY 평면에 평면을 만듭니다
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
표준 XZ 평면에 평면을 만듭니다
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
표준 YZ 평면에 평면을 만듭니다
Returns: Plane at YZ plane of world

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
이 평면을 나타내는 새 CoordinateSystem을 생성합니다. 원점, X 및 Y축 기준을 기준으로 합니다.
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
이 평면에서 법선 방향으로 지정된 거리만큼 떨어진 새 평면을 만듭니다.
alongnormal,moveplane