Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
Geometry Type 등록 메커니즘.
hostType: IGeometryEntity 파생 인터페이스 유형.
contructor: Geometry를 구성하기 위한 대리자.

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
형상을 지정된 방향으로 벡터 길이만큼 변환
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
형상 유형을 지정된 방향으로 지정된 거리만큼 변환합니다.
direction: 변위 방향.
distance: 지정된 방향의 변위 거리.
Returns: 변환된 형상.
move,along vector,distance

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
형상을 지정된 CoordinateSystem의 변환으로 변환합니다.
Returns: 변환된 형상

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
이 형상을 소스 CoordinateSystem에서 새 컨텍스트
CoordinateSystem으로 변환합니다.
Returns: 변환된 형상.
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
객체를 원점 및 축 주위로 지정된 각도만큼 회전합니다
around,axis,degrees

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
객체를 평면 원점 및 법선 주위로 지정된 각도만큼 회전합니다
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
원점 주위로 균일하지 않게 축척 조정
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
지정된 평면 주위로 균일하지 않게 축척 조정
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
두 개의 선택점을 스칼라로 사용하여 지정된 점 주위로 균일하게 축척 조정
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
기준 및 2개의 선택점에 의해 하나의 치수로 축척을 조정합니다. 축척 축은 기준과 시작점 사이의 선에 의해 정의됩니다.
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
기준 및 2개의 선택점에 의해 두 치수로 축척을 조정합니다. 두 선택점은 2D 축척 비율을 결정하기 위해 기준 평면에 투영됩니다
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
이 형상에서 다른 형상까지의 거리 가져오기
other: 다른 형상
Returns: 거리
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
이 형상에서 다른 형상까지 가장 가까운 점 가져오기
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
다른 형상 객체가 이 객체와 교차하는지 확인
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
이 객체와 다른 객체의 교차 형상 가져오기
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
이 객체와 다른 형상 모음에 대한 교차 형상을 가져옵니다. 포함되는 모든 형상의 공통 형상을 찾습니다.
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
다른 형상을 절단 "도구"로 사용하여 이 형상을 분할
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
두 객체의 대표 형상 또는 숫자 값이 같은지 확인
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
지정된 형상 조각이 포함된 BoundingBox 기져오기
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
형상을 솔리드 정의 JSON으로 변환
Returns: JSON 형식 문자열

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
SAT 파일을 가져오고 가져온 형상의 배열을 반환합니다.
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
SAT 파일을 가져오고 가져온 형상의 배열을 반환합니다
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.FromSolidDef(System.String)
JSON 문자열을 가져와 가져온 형상의 배열을 반환
solidDefJson: 솔리드 정의 형식 형상을 포함하는 JSON 문자열
Returns: 변환된 형상 리스트

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
지정된 형상을 지정된 SAT 파일 경로로 내보냅니다
filePath: 형상을 내보낼 파일의 이름

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
지정된 형상을 지정된 SAT 파일 경로로 내보냅니다
filePath: 형상을 내보낼 파일의 이름
unitsMM: 사용할 단위

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String,System.Double)
지정된 형상의 리스트를 지정된 SAT 파일 경로로 내보냅니다

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
지정된 형상을 표준 ACIS 바이너리(SAB) 형식으로 직렬화하고 직렬화된 바이너리 스트림 데이터를 반환합니다

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
지정된 형상의 리스트를 표준 ACIS 바이너리(SAB) 형식으로 직렬화하고 직렬화된 바이너리 스트림 데이터를 반환합니다
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
이 형상을 만드는 데 사용된 컨텍스트/참조 좌표계를 가져옵니다.