Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
TSplineReflection의 문자열 표현을 가져옵니다.

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
지정된 세그먼트 수를 갖는 지정된 평면과 각 세그먼트 쌍 사이의 지정된 각도(도)를 기준으로 T-Spline 대칭에 대해 방사형 반사를 만듭니다.
plane: 법선이 T-Spline 방사형 반사에 대한 축인 평면입니다. 표준 좌표로 제공됩니다.
segmentsCount: 방사형 반사 세그먼트의 수
segmentAngle: 방사형 대칭 세그먼트의 각 쌍 사이 각도입니다(도). 0으로 설정된 경우 (360/세그먼트 개수)에 따라 정의됩니다.
Returns: T-Spline 방사형 반사
tspline,symmetry,reflection,radial