Autodesk.DesignScript.Geometry.Cylinder.ToString
Cylinder의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
상위 CoordinateSystem, 반지름 및 원통의 높이로 정의된 솔리드 원통을 구성합니다
coordinateSystem: 상위 좌표계
radius: Radius size
height: Cylinder height
Returns: Cylinder created from radius and height
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
지정된 원통의 하단 및 상단 중심점을 사용하여 솔리드 원통을 구성합니다.
startPoint: Start point of cylinder
endPoint: End point of cylinder
radius: Radius  of cylinder
Returns: Cylinder created by points and radius
cylinder,tube,by center points