Autodesk.DesignScript.Geometry.Surface.ToString
Surface의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
표면 모음을 하나의 표면에 결합합니다. 이 방법을 사용하면 결과 결합이 비복합 또는 다중 면인 경우 polySurface가 되돌려질 수 있습니다.
surfaces: 표면의 모음입니다.
Returns: 표면의 결합
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
입력 횡단면 곡선 사이에서 로프트하여 표면을 만듭니다.
crossSections: Curves to loft through
Returns: Surface created by loft
loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
입력 횡단면 선 사이에서 로프트하여 표면을 만듭니다. Surface.ByLoft보다 약간 더 빠르고 덜 매끄러운 결과를 생성합니다.
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
지정된 안내 곡선(난간이라고도 함)을 사용하여 횡단면을 통해 표면을 로프트합니다. 안내 곡선은 모든 횡단면 곡선과 교차해야 합니다.
loftbyrail

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
지정된 안내 곡선(난간이라고도 함)을 사용하여 횡단면을 통해 표면을 로프트합니다. 안내 곡선은 모든 횡단면 곡선과 교차해야 합니다.
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
경로를 따라 횡단면 곡선을 스윕하여 표면을 만듭니다.
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
닫힌 다각형의 입력 점을 연결하고 패칭하는 다각형 표면을 만듭니다.
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
횡단면 곡선을 두 개의 난간으로 표시되는 경로를 따라 스윕합니다
path: 스윕할 입력 경로입니다.
guideRail: 스윕 방향을 안내하는 레일입니다.
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
원점에 의해 형성된 광선 축 주위로 프로파일 곡선을 벡터 축 방향으로 스윕(start_angle(도)에서 시작하고, sweep_angle(도) 스윕)하여 표면을 만듭니다.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
입력 곡선에 의해 정의된 닫힌 경계의 내부를 채워 표면을 만듭니다.
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
이 표면 및 입력 표면 결합의 부울 차이입니다. 이 방법을 사용하면 결과 부울이 비복합 또는 다중 면인 경우 polySurface가 되돌려질 수 있습니다.
others: 뺄 다른 표면
Returns: 결과 부울 표면 또는 PolySurface
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
입력 표면의 하나 이상의 루프 모음을 사용하여 표면을 자릅니다.  루프 중 하나는 입력 표면의 경계 루프여야 합니다.  또한 구멍에 대해 하나 이상의 내부 루프를 추가해야 합니다.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
표면의 입력 점에서 표면 법선을 반환합니다.
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
표면의 Nurbs 표현을 가져옵니다. 이 방법은 특정 상황에서 표면과 거의 비슷할 수도 있습니다.

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
지정된 공차 내에서 표면의 Nurbs 표현을 가져옵니다. 이 방법은 특정 상황에서 표면과 거의 비슷할 수도 있습니다.
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
표면을 두껍게 하여 솔리드로 만들고, 표면의 양쪽에서 표면 법선 방향으로 돌출합니다.
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
표면을 두껍게 하여 솔리드로 만들고 표면 법선 방향으로 돌출합니다. both_sides 매개변수가 true인 경우 표면이 양쪽에서 두꺼워집니다.
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
표면의 간격을 표면 법선 방향으로 지정된 거리만큼 띄웁니다.
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
반환된 좌표계에서는 xAxis, yAxis 및 zAxis를 사용하여 uDir, vDir 및 법선을 표현합니다. xAxis, yAxis의 길이가 곡률을 나타냅니다.
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
주 곡률 방향으로 정렬된 CoordinateSystem을 반환합니다.
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
지정된 U 및 V 매개변수에서 U 접선 벡터를 반환합니다.
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
지정된 U 및 V 매개변수에서 V 접선 벡터를 반환합니다.
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
지정된 U 및 V 매개변수에서 법선 벡터를 반환합니다.
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
입력 U 및 V 좌표에서 도함수를 반환합니다.
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
U 및 V 매개변수에서 주 방향 벡터를 반환합니다.
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
지정된 표면에서 매개변수 선 곡선을 만듭니다. 표면의 u 또는 v 매개변수 선을 나타내는 곡선을 만듭니다. 매개변수 선은 일정한 반대 u 또는 v 매개변수에서 u 또는 v 매개변수가 증가하는 방향으로 이어집니다. 결과 곡선은 표면 매개변수화와 일치하며 표면 매개변수 범위에 의해 범위의 경계가 설정됩니다. 반환되는 곡선의 유형은 표면 유형에 따라 다릅니다.
isoDirection: 방향 == 0인 경우 U 매개변수 선을 작성하고, 방향 == 1인 경우 V 매개변수 선을 작성합니다.
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
법선이 반전된 새 표면을 반환합니다. 이 표면은 변경되지 않습니다.
Returns: Surface, which is the same as the input surface but with flipped normals

Autodesk.DesignScript.Geometry.Surface.Join(Autodesk.DesignScript.Geometry.Surface)
이 표면과 입력 표면을 PolySurface로 결합합니다
topolysurface

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
이 표면과 입력 표면을 PolySurface로 결합합니다
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
입력 형상을 입력 벡터 방향으로 이 표면에 투영합니다.  !!이 투영 방법은 현재 점 또는 곡선만 지원합니다!!
projecttosurface,projectonto