Autodesk.DesignScript.Geometry.Cone.ToString
Cone의 문자열 표현을 가져옵니다

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
시작점에서 지정된 기준 반지름으로 끝점의 정점까지 연장되는 원추를 만듭니다.
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
시작점과 끝점의 지정된 반지름으로 시작점에서 끝점까지 축이 있는 원추를 만듭니다. 이 객체에는 정점이 없으며 잘린 원추로 간주될 수 있습니다.
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
기준점이 CoordinateSystem 원점에 있고, CoordinateSystem Z축 방향 길이만큼 연장되며 CoordinateSystem XY 평면에 원형 기준이 있는 원추를 만듭니다.

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
기준점이 CoordinateSystem 원점에 있고, CoordinateSystem Z축 방향 길이만큼 연장되며 CoordinateSystem XY 평면에 원형 기준이 있는 원추를 만듭니다.
cone,cone by height,cones