DSCore.String.Split(System.String,System.String[])
Rozdělí jeden řetězec na seznam řetězců, s děleními
určenými podle daných oddělovacích řetězců.
string: Řetězec pro rozdělení
separators: Řetězce, které (pokud existují) určují konec a začátek rozdělení.
Seznam řetězců ze vstupního řetězce
divide,separator,delimiter,cut,csv,comma,