DSCore.DummyPythonEvaluator
Vyhodnocovač jazyka Python, který při vyhodnocování vyvolá chybu.
Používá se především k označení, že skutečný vyhodnocovač jazyka Python nemohl být nalezen.

DSCore.DummyPythonEvaluator.Evaluate(System.String,System.Collections.IList,System.Collections.IList)
Vyvolá výjimku s přiřazenou zprávou.