DSCore.List.IndexOf(System.Collections.IList,System.Object)
Vrací index prvku v daném seznamu. Shoda mezi daným seznamem a cílovým prvkem musí být striktní (tj. int k int, double k double, string ke string, object k object atd.)
list: Seznam, ve kterém má být prvek hledán
element: Prvek, jehož index chcete vrátit
Index prvku v seznamu. Pokud není nalezena striktní shoda, je vrácen neplatný index -1.
index,indexof

DSCore.List.Flatten(System.Collections.IList,System.Int32)
Vyrovná vnořený seznam seznamů o určitou hodnotu.
list: Seznam k vyrovnání
amount: Hladiny vnoření seznamu k odebrání (-1 odebere všechna vnoření seznamu)
Plochý seznam podle množství
flatten,completely