DSCore.Color.ByARGB(System.Int32,System.Int32,System.Int32,System.Int32)
Umožňuje vytvořit barvu pomocí alfa, červené, zelené a modré složky.
alpha: Hodnota alfa (mezi 0 a 255, včetně)
red: Červená hodnota pro barevný model RGB (mezi 0 a 255, včetně)
green: Zelená hodnota pro barevný model RGB (mezi 0 a 255, včetně)
blue: Modrá hodnota pro barevný model RGB (mezi 0 a 255, včetně)
Barva vytvořená z ARGB
color