DSCore.DateTime.Components(System.DateTime)
Extrahuje jednotlivé komponenty hodnoty DateTime.
dateTime: Položka DateTime k získání komponent
Numerická reprezentace roku (1–9999)
Numerická reprezentace měsíce (1–12)
Numerická reprezentace dne (1-[dní v měsíci])
Numerická reprezentace hodiny (0–23)
Numerické znázornění minut (0–59)
Numerická reprezentace sekund (0–59)
Numerická reprezentace sekund (0–999)