Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
Získat řetězcovou reprezentaci prvku TSplineReflection

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
Umožňuje vytvořit radiální odraz symetrie křivky t-spline podle dané roviny s daným počtem segmentů a daným úhlem (ve stupních) mezi každým párem segmentů.
plane: Rovina, jejíž normála je osa radiálního odrazu křivky t-spline. Uvedená v globálních souřadnicích
segmentsCount: Počet segmentů radiálního odrazu
segmentAngle: Úhel mezi každým párem segmentů radiální symetrie (ve stupních). Pokud je nastaven na hodnotu 0, je definován hodnotou (360 / segmentsCount).
Returns: Radiální odraz křivky t-spline
tspline,symmetry,reflection,radial