Autodesk.DesignScript.Geometry.Cylinder.ToString
Získat řetězcovou reprezentaci prvku Cylinder

Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Sestavit těleso (válec) definované nadřazeným systémem CoordinateSystem, poloměrem a výškou válce
coordinateSystem: Nadřazený souřadnicový systém
radius: Radius size
height: Cylinder height
Returns: Cylinder created from radius and height
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Vytvořte těleso (válec), když je zadán střed dolní a horní stěny válce.
startPoint: Start point of cylinder
endPoint: End point of cylinder
radius: Radius  of cylinder
Returns: Cylinder created by points and radius
cylinder,tube,by center points