Autodesk.DesignScript.Geometry.NurbsSurface.ToString
Získat řetězcovou reprezentaci prvku NurbsSurface

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Vytváří objekt NurbsSurface s určenými interpolovanými body a stupni U a V. Výsledný povrch bude procházet všemi body.
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Vytváří objekt NurbsSurface s určenými interpolovanými body a stupni U a V. Výsledný povrch bude procházet všemi body.  Počet tečen musí odpovídat počtu bodů v odpovídajícím směru. Výsledný povrch bude stupně 3 ve směru U i V.
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Vytváří objekt NurbsSurface vyhovujícího kolekci různých vlastností povrchu. Jedná se o nejpokročilejší způsob umístění povrchu. Výsledný povrch bude procházet všemi body. Počet tečen musí odpovídat počtu bodů v odpovídajícím směru. Výsledný povrch bude stupně 3 ve směru U i V. Derivace rohu by měly být druhého řádu (dP/dUdV) a měly by být obsaženy v tomto pořadí [lowU, lowV], [highU, lowV] ,  [lowU, highV], [highU, highV].
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Vytvořte objekt NurbsSurface pomocí explicitních řídicích bodů se zadanými stupni U a V.
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
Vytvoří objekt NurbsSurface pomocí zadaných řídicích vrcholů, uzlů, tloušťky čar a stupňů U V. Existuje několik omezení dat, které v případě porušení způsobí selhání funkce a výskyt výjimky. Stupeň: stupně U i V by měly být >= 1 (interpolace lineární po částech) a menší než 26 (maximální stupeň založený na B-spline, který podporuje ASM). Tloušťky čar: Všechny hodnoty tloušťky čar (pokud jsou zadány) by měly být zásadně kladné. Tloušťka čáry menší než 1e-11 bude zamítnuta a funkce se nezdaří.  Uzly: oba uzlové vektory by měly být nesestupné posloupnosti. Vnitřní různorodost uzlů by neměla být větší než stupeň + 1 na počátečním nebo koncovém uzlu a stupeň na interním uzlu (to umožňuje reprezentaci povrchů s přerušeními G1). Všimněte si, že jsou podporovány nesvázané vektory uzlů, ale takové budou převedeny na svázané tím, že u nich budou provedeny změny použité v datech řídicího bodu / tloušťky čar.
lines
0.4

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
Vrací váhy řídicích bodů objektu NurbsSurface. Váhy určují vliv, který jednotlivé řídicí body mají na tvar povrchu.
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
Vrací uzly povrchu ve směru U. Za uzly se považuje řada hodnot parametru (hodnoty double), pomocí nichž se určí, kde a jak řídicí body ovlivní povrch.
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
Vrací uzly povrchu ve směru V. Za uzly se považuje řada hodnot parametru (hodnoty double), pomocí nichž se určí, kde a jak řídicí body ovlivní povrch.
Returns: Nurbs V knots of surface