Autodesk.DesignScript.Geometry.Surface.ToString
Získat řetězcovou reprezentaci prvku Surface

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Sjednocení kolekce povrchů do jednoho povrchu. Tato metoda může vrátit objekt PolySurface v případě, že výsledné sjednocení je nerozložené nebo se skládá z více ploch.
surfaces: Kolekce povrchů.
Returns: Sjednocení povrchů
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Vytvořte povrch pomocí šablonování mezi křivkami vstupního příčného řezu.
crossSections: Curves to loft through
Returns: Surface created by loft
loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
Vytvořte povrch šablonováním mezi čarami vstupního příčného řezu. To je mírně rychlejší a vytváří méně hladký výsledek než operace Surface.ByLoft.
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Šablonujte povrch prostřednictvím průřezů s určenou vodicí křivkou (neboli trajektorií). Vodicí křivka musí protínat všechny křivky průřezů.
loftbyrail

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Šablonujte povrch prostřednictvím průřezů s určenými vodicími křivkami (neboli trajektoriemi). Vodicí křivka musí protínat všechny křivky průřezů.
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Vytvořte povrch tažením křivky průřezu podél trajektorie.
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Vytvořte povrch mnohoúhelníku spojující vstupní body v uzavřeném polygonu a opravující jej.
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Táhnout křivku příčného řezu podél trajektorie vedené dvěma kolejemi
path: Vstup k tažení podél trajektorie
guideRail: Trajektorie, podle které se řídí orientace tažení
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Vytvořte povrch tažením křivky profilu kolem paprsku osy vytvořeného pomocí bodu počátku ve směru vektoru osy, počínaje objektem start_angle ve stupních a pokračujíce tažením objektu sweep_angle ve stupních.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Vytvořte povrch vyplněním vnitřní části uzavřené hranice definované vstupními křivkami.
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Logický rozdíl tohoto povrchu a sjednocení vstupních povrchů. Tato metoda může vrátit objekt PolySurface v případě, že výsledný Booleovský objekt je nerozložený nebo se skládá z více ploch.
others: Další povrchy k odečtení
Returns: Výsledný booleovský povrch nebo objekt polySurface
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Ořízne povrch pomocí sady jedné nebo více smyček ve vstupním povrchu. Jedna ze smyček musí být hraniční smyčkou vstupního povrchu. Navíc je potřeba přidat jednu nebo více vnitřních smyček pro díry.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
Vraťte normálu povrchu ve vstupním bodu na povrchu.
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
Zobrazí se reprezentace NURBS povrchu. Tato metoda může v určitých případech aproximovat povrch.

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Zobrazí se reprezentace NURBS povrchu s určenou tolerancí. Tato metoda může v určitých případech aproximovat povrch.
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Zesilte plochu na těleso tím, že ji vysunete ve směru normály povrchu na obou stranách povrchu.
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Zesilte plochu na těleso tím, že ji vysunete ve směru normál povrchu. Pokud má parametr both_sides hodnotu true, povrch se zesílí na obou stranách.
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
Odsaďte povrch ve směru normály povrchu podle zadané vzdálenosti.
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
Vrácený souřadnicový systému využívá osy xAxis, yAxis a zAxis a pomocí nich reprezentuje uDir, vDir a normálu. Délka os xAxis, yAxis představuje zakřivení.
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
Vraťte objekt CoordinateSystem zarovnaný s hlavními směry křivosti.
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
Vraťte tečný vektor U v zadaných parametrech U a V.
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
Vraťte tečný vektor V v zadaných parametrech U a V.
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
Vraťte normálový vektor v zadaných parametrech U a V.
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
Vraťte odvozeniny při vstupních souřadnicích U a V.
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
Vrací hlavní směrové vektory v parametrech U a V.
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
Vytvořte křivku čáry parametru na zadaném povrchu. Vytvořte křivku, která představuje čáru parametru U nebo V na povrchu. Čára parametru vede ve směru vzrůstajícího parametru U nebo V v konstantním protějším parametru U nebo V. Výsledná křivka bude odpovídat parametrizaci povrchu a jeho rozsah bude ohraničen rozsahem parametru povrchu. Vrácený typ křivky závisí na typu povrchu.
isoDirection: Pokud směr == 0, vytvoří čáru parametru U, pokud směr == 1, vytvoří čáru parametru V.
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Vrací nový povrch s převrácenými normálami. Tento povrch ponechá beze změny.
Returns: Surface, which is the same as the input surface but with flipped normals

Autodesk.DesignScript.Geometry.Surface.Join(Autodesk.DesignScript.Geometry.Surface)
Kombinuje tento povrch a vstupní povrch do objektu PolySurface.
topolysurface

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Kombinuje tento povrch a vstupní povrch do objektu PolySurface.
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Promítne vstupní geometrii na tento povrch ve směru vstupního vektoru. !!Tato metoda promítání aktuálně podporuje pouze body nebo křivky!!
projecttosurface,projectonto