Autodesk.DesignScript.Geometry.NurbsCurve.ToString
Získat řetězcovou reprezentaci prvku NurbsCurve

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Vytvořte objekt BSplineCurve pomocí explicitních řídicích bodů. POZNÁMKA 1: Objekty BSplineCurve s hodnotou deg=1 mají přerušení G1, což může vést k problémům s vysunutím, tažením a jinými operacemi. Neměly by se používat. Místo nich použijte objekt PolyCurve. POZNÁMKA 2: Pokud je oblouk periodický (uzavřený), pak první a poslední bod MUSÍ být stejné.
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Vytvořte objekt BSplineCurve pomocí explicitních řídicích bodů. POZNÁMKA 1: Objekty BSplineCurve s hodnotou deg=1 mají přerušení G1, což může vést k problémům s vysunutím, tažením a jinými operacemi. Neměly by se používat. Místo nich použijte objekt PolyCurve. POZNÁMKA 2: Pokud je oblouk periodický (uzavřený), pak první a poslední bod MUSÍ být stejné.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Vytvořte objekt BSplineCurve pomocí explicitních řídicích bodů. POZNÁMKA 1: Objekty BSplineCurve s hodnotou deg=1 mají přerušení G1, což může vést k problémům s vysunutím, tažením a jinými operacemi. Neměly by se používat. Místo nich použijte objekt PolyCurve. POZNÁMKA 2: Pokud je oblouk periodický (uzavřený), pak první a poslední bod MUSÍ být stejné.
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
Vytvořte objekt BSplineCurve z řídicích vrcholů, tloušťek a uzlů. Z DOKUMENTŮ ASM: Stupeň: měl by být větší než 1 (aproximace lineární po částech) a menší než 26 (maximální stupeň na bázi B-spline podporovaný ASM). Tloušťky čar: Všechny hodnoty tloušťky čar (pokud jsou zadány) by měly být zásadně kladné. Tloušťka čar menší než 1e-11 bude zamítnuta a funkce se nezdaří. Uzly: vektor uzlu by měl být nesestupná posloupnost. Vnitřní různorodost uzlů by neměla být větší než stupeň + 1 na začátku nebo na konci uzlu a stupeň na vnitřním uzlu (to umožňuje reprezentaci oblouků s přerušeními G1). Všimněte si, že nesvázané vektory jsou podporovány, ale budou převedeny na svázané, s odpovídajícími změnami použitými na data řídicího bodu / tloušťky čar. Pole uzlu: velikost pole musí být num_control_points + stupeň + 1
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Vytvořte objekt BSplineCurve pomocí interpolace mezi body.
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Vytvořte objekt BSplineCurve pomocí interpolace mezi body. POZNÁMKA 2: Pokud je křivka periodická (uzavřená), MUSÍ být první a poslední bod stejné.
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Vytvořte objekt BSplineCurve pomocí interpolace mezi body s určeným stupněm.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Vrátí objekt BSplineCurve prostřednictvím bodů, s tečnými směry.
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
Získejte řídicí body objektu NurbsCurve. Jsou to body, u kterých oblouk provádí interpolaci.
Returns: Pole bodů

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
Uzly křivky. Za uzly se považuje řada hodnot parametru (hodnoty double), pomocí nichž se určí, kde a jak řídicí body ovlivní křivku.
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
Vrací váhy řídicích bodů objektu NurbsCurve. Váhy určují vliv jednotlivých řídicích bodů na tvar křivky.
Returns: Weights of nurbs curve
ptweight