Autodesk.DesignScript.Geometry.IndexGroup.ToString
Získat řetězcovou reprezentaci prvku IndexGroup

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
Umožňuje porovnat dva objekty IndexGroup.
other: Druhý objekt IndexGroup
Returns: Rozhodnutí, zda jsou dva objekty stejné

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
Umožňuje získat pro tento typ hodnotu hash.
Returns: Jedinečná hodnota hash pro tento objekt

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Vytvořit objekt IndexGroup pro ukládání tří indexů
a: Index a
b: Index b
c: Index c
Returns: IndexGroup
tri,polygon,mesh,meshes