Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
Mechanismus registrace typu geometrie
hostType: Typ rozhraní odvozených od entity IGeometryEntity
contructor: Delegát pro sestavení geometrie

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
Převést geometrii v daném směru podle délky vektoru
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Převede libovolný typ geometrie podle zadané vzdálenosti v daném
směru.
direction: Směr posunutí
distance: Vzdálenost posunutí v daném směru
Returns: Transformovaná geometrie
move,along vector,distance

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transformuje geometrii podle dané transformace souřadnicového systému
Returns: Transformovaná geometrie

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Transformuje tuto geometrii ze zdrojového systému CoordinateSystem do nového
kontextového systému CoordinateSystem.
Returns: Transformovaná geometrie
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Otočí objekt kolem počátku a osy o zadaný počet
stupňů
around,axis,degrees

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Otočí objekt kolem počátku roviny a normály podle zadaného stupně
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
Upravit měřítko nerovnoměrně kolem počátku
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Upravit měřítko nerovnoměrně kolem dané roviny
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Upravit měřítko rovnoměrně kolem zadaného bodu pomocí dvou vybraných bodů jako skalárů.
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Upravit měřítko v jednom rozsahu podle základny a 2 vybraných bodů. Osa změny měřítka je definována čárou mezi základnou a bodem od.
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Upravit měřítko ve dvou rozsazích podle základny a 2 vybraných bodů. Dva vybrané body jsou promítnuty na základní rovinu za účelem určení 2D faktorů měřítka.
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
Získat vzdálenost z této geometrie do jiné
other: Jiná geometrie
Returns: Vzdálenost
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
Získat nejbližší bod na této geometrii vzhledem k jiné geometrii
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
Určit, zda se jiný objekt geometrie protíná s tímto
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
Získat geometrii průsečíku pro tento objekt a jiný
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Získejte průsečík geometrie pro tento objekt a kolekci dalších geometrií. Najde společné geometrie všech účastníků.
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
Rozdělit tuto geometrii pomocí jiné geometrie jako „řezacího nástroje“
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
Zkontrolovat, zda dva objekty mají stejnou reprezentační geometrii nebo číselné hodnoty
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
Získat objekt BoundingBox obsahující danou část geometrie
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
Převede geometrii na definici tělesa Json.
Returns: Formátovaný řetězec Json

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
Importuje soubor SAT a vrátí pole importovaných geometrií.
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
Importuje soubor SAT a vrátí pole importovaných geometrií.
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
Exportuje vybranou geometrii do zadané cesty k souboru SAT.
filePath: Název souboru, do kterého chcete exportovat geometrii

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
Exportuje vybranou geometrii do zadané cesty k souboru SAT.
filePath: Název souboru, do kterého chcete exportovat geometrii
unitsMM: Jednotky, které mají být použity

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String,System.Double)
Exportuje seznam vybrané geometrie do zadané cesty k souboru SAT.

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
Serializuje určenou geometrii do formátu SAB (Standard ACIS Binary) a vrací data serializovaného binárního toku.

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Serializuje seznam určené geometrie do formátu SAB (Standard ACIS Binary) a vrací data serializovaného binárního toku.
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
Získejte kontextový/referenční souřadnicový systém, který byl použit pro vytvoření této geometrie.