Autodesk.DesignScript.Geometry.Face.ToString
Získat řetězcovou reprezentaci prvku Face

Autodesk.DesignScript.Geometry.Face.SurfaceGeometry
Základní povrch, který tvoří plochu
Returns: Surface representation of face