Autodesk.DesignScript.Geometry.Arc.ToString
Získat řetězcovou reprezentaci prvku Arc

Autodesk.DesignScript.Geometry.Arc.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Vytvořte oblouk pomocí tří postupných bodů podél obvodu.
firstPoint: První bod oblouku
secondPoint: Druhý bod oblouku
thirdPoint: Třetí bod oblouku
Returns: Oblouk vytvořený podle tří bodů
arc,arcs

Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Vytvořit oblouk, který nejlépe aproximuje kolekci bodů
points: Seznam bodů, podle kterých se má nejlépe přizpůsobit oblouk
Returns: Arc created by best fit through points
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Vytvořit oblouk nebo oblouk BI tečny pomocí počátečního a koncového bodu a tečen na počátku a na konci
point1: Bod počátku oblouku BI
vector1: Tečný vektor počátku oblouku BI
point2: Bod konce oblouku BI
vector2: Tečný vektor konce oblouku BI
arc,tangent

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Vytvořit oblouk z počátečního bodu do koncového bodu s počáteční tečnou k vektoru
startPoint: Start point of arc
endPoint: End point of arc
startTangent: Start tangent direction vector
arc,tangent,arcs