Autodesk.DesignScript.Geometry.PolySurface.ToString
Získat řetězcovou reprezentaci prvku PolySurface

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Vytvořte objekt Polysurface tažením křivek podél trajektorie.
rail: Křivka, podél které se má provést tažení
profile: Profil tažení
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Vyhledejte povrchy pomocí bodu. Využívá první průsečík v dopředném směru. Vrací jeden povrch, pokud dochází k zásahu povrchu, dva povrchy, pokud dochází k zásahu hrany vnitřní části, a mnoho povrchů, pokud dochází k zásahu vrcholu.
surfacesatpoint,findsurfaces,extractsurfaces

Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
Vrací počet povrchů objektu polysurface.
Returns: Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
Vrací počet hran objektu polysurface.
Returns: Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
Vrací počet vrcholů objektu polysurface.
Returns: Number of vertices