Autodesk.DesignScript.Geometry.Point.ToString
Získat řetězcovou reprezentaci prvku Point

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Umožňuje porovnat dva objekty Point.
other: Druhý objekt Point
Returns: Rozhodnutí, zda jsou dva objekty stejné

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
Umožňuje získat pro tento typ hodnotu hash.
Returns: Jedinečná hodnota hash pro tento objekt

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
Vytvořte bod v rovině XY daných dvou kartézských souřadnic.  Komponenta Z je 0.
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
Získat bod počátku (0,0,0).
Returns: Origin point
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
Vytvořit bod daný 3 kartézskými souřadnicemi
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Vytvořit bod v daném souřadnicovém systému pomocí 3 kartézských souřadnic
coordinateSystem: Nadřazený souřadnicový systém
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
Zredukovat body za účelem vyloučení duplikátů v rámci tolerance zahrnutých bodů
points: Seznam bodů, u kterých se budou redukovat duplikáty
tolerance: Tolerance použitá při redukování
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near