Autodesk.DesignScript.Geometry.BoundingBox.ToString
Získat řetězcovou reprezentaci prvku BoundingBox

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Umožňuje porovnat dva objekty BoundingBox.
other: Druhý objekt BoundingBox
Returns: Rozhodnutí, zda jsou dva objekty stejné

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
Umožňuje získat pro tento typ hodnotu hash.
Returns: Jedinečná hodnota hash pro tento objekt

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
Vytvořte osově souměrný objekt BoundingBox kolem vstupní geometrie.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Vytvořte osově souměrný objekt BoundingBox kolem vstupních geometrií.
geom: Geometries to determine bounding box
Returns: Bounding box enclosing geometries
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
Vytvořte osově nesouměrný objekt BoundingBox kolem vstupní geometrie, orientovaný na osy X, Y a Z systému CoordinateSystem.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
Vytvořte osově nesouměrný objekt BoundingBox kolem vstupních geometrií, orientovaný na osy X, Y a Z systému CoordinateSystem.
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
Sestaví objekt BoundingBox z minimálních souřadnic (levý dolní roh) a maximálních souřadnic (pravý horní roh). Systém CoordinateSystem je transformace ZE souřadnicového prostoru pole DO modelového prostoru. Tato metoda je navržena tak, aby odpovídala rozhraní API aplikace Revit, což vám umožňuje extrahovat parametry z objektu BoundingBox aplikace Revit bez nutnosti jakéhokoli převádění.
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
Systém CoordinateSystem, v němž je definován tento objekt BoundingBox

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Získat průsečík dvou objektů BoundingBox
other: Other bounding box to intersect
Returns: Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Určit, zda se dva objekty BoundingBox protínají
other: Other bounding box
Returns: Do bounding boxes intersect
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
Určit, zda je objekt BoundingBox prázdný
Returns: Returns true if the bounding box is empty