Autodesk.DesignScript.Geometry.PolyCurve.ToString
Získat řetězcovou reprezentaci prvku PolyCurve

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Vytvořte objekt PolyCurve spojením křivek. Obrátí křivku podle potřeby připojení. Vyberte preferovanou toleranci spojení od 1e-6 do 1e-3 jednotek.
curves: Křivky ke spojení do objektu PolyCurve
joinTolerance: Tolerance, která určuje velikost povolené mezery mezi spojovanými křivkami
Returns: Objekt Polycurve vytvořený podle spojených křivek
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Vytvořte objekt PolyCurve spojením bodů. Chcete-li objekt PolyCurve uzavřít, nastavte vstup 'connectLastToFirst' na hodnotu true.
points: Body, které mají vytvořit objekt PolyCurve
connectLastToFirst: Hodnota True k propojení posledního bodu s prvním bodem, hodnota false k ponechání otevřeným.
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.Curves
Vrací křivky objektu PolyCurve.
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
Vrací křivku objektu PolyCurve pomocí indexu.
index: Délka pro umístění bodu
endOrStart: Hodnota True znamená počítání od konce objektu polycurve, hodnota false označuje počítání od začátku objektu polycurve
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
Objekt PolyCurve odsazení v jeho rovině
signedDistance: Velikost odsazení
extendCircular: Přepínač k nastavení rohů na kruhové
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Objekt PolyCurve zaoblení v jeho rovině
radius: Poloměr zaoblení
rightSide: Hodnota True znamená zaoblení napravo vzhledem k počátku objektu polycurve, hodnota false označuje zaoblení na levé straně
Returns: Filleted polyCurve
round,smooth,radius