Autodesk.DesignScript.Geometry.Edge.ToString
Získat řetězcovou reprezentaci prvku Edge

Autodesk.DesignScript.Geometry.Edge.CurveGeometry
Základní křivka tvořící hranu

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
Plochy přilehlé k této hraně

Autodesk.DesignScript.Geometry.Edge.StartVertex
Vrchol, ve kterém začíná tato hrana

Autodesk.DesignScript.Geometry.Edge.EndVertex
Vrchol, ve kterém končí tato hrana