Autodesk.DesignScript.Geometry.Vector.ToString
Získat řetězcovou reprezentaci prvku Vector

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Umožňuje porovnat dva objekty Vector.
other: Druhý objekt Vector
Returns: Rozhodnutí, zda jsou dva objekty stejné

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
Umožňuje získat pro tento typ hodnotu hash.
Returns: Jedinečná hodnota hash pro tento objekt

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Vytvořit vektor pomocí 3 euklidovských souřadnic
x: Souřadnice X
y: Souřadnice Y
z: Souřadnice Z
Returns: Vector created by coordinates
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Vytvořit vektor pomocí 3 euklidovských souřadnic a normalizovat vektor
x: Souřadnice X
y: Souřadnice Y
z: Souřadnice Z
normalized: Hodnota True znamená normalizaci vektoru, hodnota false označuje neprovedení normalizace
Returns: Vector created by coordinates
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Vytvořit vektor pomocí dvou koncových bodů. Výsledkem je vektor z počátečního do koncového bodu
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
Získat kanonický vektor osy X (1,0,0)
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
Získat kanonický vektor osy Y (0,1,0)
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
Získat kanonický vektor osy Z (0,0,1)
z,basis,up

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Vytvořit skalární součin dvou vektorů
vec: a second vector
Returns: Resulting dot product
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Určit, zda jsou dva vektory rovnoběžné.
otherVector: Jiný vektor
Returns: Returns True if the vectors are parallel; false otherwise.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Určit, zda se dva vektory téměř rovnají. Kvůli správnému zpracování přesnosti je dána hodnota tolerance 1e-5.
otherVector: Jiný vektor
Returns: Returns True if the vectors are almost equal; false otherwise.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transformovat tento vektor pomocí vstupní matice systému CoordinateSystem
coordinateSystem: Souřadnicový systém použitý k transformaci vektoru
Returns: Transformed vector

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Otočí vektor kolem osy o zadaný počet stupňů.
axis: Rotation axis vector
degrees: Number of degrees to rotate
Returns: Rotated vector
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Otočí vektor kolem počátku roviny a normály podle zadaného stupně.
plane: Rovina otočení
degrees: Number of degrees to rotate
Returns: Rotated vector
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Upravit měřítko vektoru rovnoměrně kolem počátku
scale_factor: Scale factor
Returns: Scaled vector
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
Vrací úhel mezi dvěma vektory ve stupních od 0 do 180.
otherVector: Other vector
Returns: Returns angle between the supplied vectors in degrees from 0 to 180.
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
Vrací úhel mezi dvěma vektory v rozsahu [0, 180] stupňů.
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Vrací úhel mezi dvěma vektory ve stupních od 0 do 360. Prostřednictvím osy otáčení určuje směr úhlu.
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Vrací úhel mezi dvěma vektory v rozsahu [0, 360] stupňů. Používá osu rotace k určení směru úhlu.
rotation angle