Autodesk.DesignScript.Geometry.Curve.ToString
Získat řetězcovou reprezentaci prvku Curve

Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
Vytvořit křivku pomocí čáry povrchu v prostoru UV
baseSurface: Povrch k použití
startParams: Počáteční parametr UV, ve kterém bude počátek křivky
endParams: Koncový parametr UV, ve kterém bude konec křivky
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Vytvořit křivku, která přechází mezi dvěma křivkami
curve1: První křivka k přechodu
curve2: Druhá křivka k přechodu
endOrStart1: příznak, který určuje, který konec křivky1 se má použít k přechodu
endOrStart2: příznak, který určuje, který konec křivky1 se má použít k přechodu
isG2Continuous: příznak, který určuje, zda je typem výsledné křivky spojitost G1 nebo G2
Returns: Výsledná křivka z přechodu dvou křivek
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
Vytvořit křivku pomocí izočáry povrchu
baseSurface: Základní povrch
direction: pokud je izočára 0 podél směru U, pokud je 1 podél směru V
parameter: pevná pro hodnotu křivky jiného parametru povrchu
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
Získá systém CoordinateSystem s počátkem v bodě v zadaném parametru. Osa XAsis je zarovnána s normálou křivky, osa YAxis je zarovnána s tečnou křivky v tomto bodě a osa ZAxis je zarovnána s vektorem UP nebo binormálou v tomto bodě.
param: Parametr, ve kterém vyhodnocovat
Returns: Objekt CoordinateSystem v parametru křivky
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
Vrací rovinu, jejíž normála je zarovnána s tečnou křivky. Parametry jsou upraveny tak, aby bod 0 vždy byl počátečním bodem a bod 1 vždy byl koncovým bodem.
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtDistance(System.Double)
Načíst bod v určité délce oblouku podél křivky
segmentLength: Vzdálenost podél křivky, ve které má být provedeno vyhodnocení
Returns: Bod v dané délce oblouku
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
Vrátí body rovnoměrně rozmístěné podél délky křivky na základě vstupního počtu dělení.
divisions: Počet dělení
Returns: Body rovnoměrně rozmístěné podél délky křivky

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
Vrátí body rozmístěné podél křivky ve stejné délce tětivy na základě vstupního počtu dělení.
divisions: Počet dělení
Returns: Seznam bodů na křivce

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Vrátí body rovnoměrně rozmístěné podél křivky v dané délce segmentu a od daného bodu.
point: Referenční bod, od kterého měřit
segmentLength: Vzdálenost podél křivky, ve které má být provedeno vyhodnocení
Returns: Seznam bodů na křivce

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Vrátí body rozmístěné na křivce v dané délce tětivy od daného bodu.
point: Referenční bod, od kterého měřit
chordLength: Délka tětivy
Returns: Seznam bodů na křivce

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
Vrací prvek CoordinateSystem v zadané vzdálenosti od počátečního bodu křivky. Osa Y leží tečně ke křivce, osa X je zakřivení.
segmentLength: Vzdálenost podél křivky, ve které má být provedeno vyhodnocení
Returns: Systém CoordinateSystem na křivce
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtDistance(System.Double)
Vrací prvek CoordinateSystem v zadané vzdálenosti od počátečního bodu křivky. Osa Y leží tečně ke křivce, osa X je zakřivení.
segmentLength: Vzdálenost podél křivky, ve které má být provedeno vyhodnocení
Returns: Systém CoordinateSystem na křivce
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
Vrací rovinu v zadané vzdálenosti podél křivky od počátečního bodu. Normála roviny je zarovnána s tečnou křivky.
segmentLength: Vzdálenost podél křivky, ve které má být provedeno vyhodnocení
Returns: Rovina na křivce
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PlaneAtDistance(System.Double)
Vrací rovinu v zadané vzdálenosti podél křivky od počátečního bodu. Normála roviny je zarovnána s tečnou křivky.
segmentLength: Vzdálenost podél křivky, ve které má být provedeno vyhodnocení
Returns: Rovina na křivce
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
Získat délku segmentu měřenou od počátečního bodu křivky k danému parametru.
param: Hodnota mezi 0 a 1
Returns: Délka segmentu
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtDistance(System.Double)
Získejte parametr v určité délce oblouku podél křivky.
segmentLength: Vzdálenost podél křivky, ve které má být provedeno vyhodnocení
Returns: Parametr
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.LengthBetweenParameters(System.Double,System.Double)
Načíst délku oblouku mezi dvěma body parametru na křivce
startParam: Počátek domény
endParam: Konec domény
Returns: Délka oblouku mezi dvěma parametry
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Získat parametr v daném bodu podél křivky. Pokud bod není na křivce, získá nejbližší parametr. Pokud je vstupní křivka objektem PolyCurve, tato funkce vrátí platný parametr pouze v případě, že bod leží na objektu PolyCurve. U jiných typů křivek tato funkce vrátí parametr podél křivky, který leží v bodě nejbližším ke vstupnímu bodu.
point: Bod podél nebo poblíž křivky
Returns: Parametr na křivce pro polykřivky nebo nejbližší parametr podél křivky pro jiné typy křivek.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.DivideEqually(System.Int32)
Rozdělí křivku na zadaný počet křivek stejné délky.
divisions: Počet dělení
Returns: Pole křivek po rozdělení
chopcurve,segment,slices

Autodesk.DesignScript.Geometry.Curve.DivideByDistance(System.Int32)
Rozdělí křivky na zadaný počet křivek se stejnými vzdálenostmi mezi počátkem a koncem každé křivky (stejné tětivy).
divisions: Počet dělení
Returns: Pole křivek po rozdělení
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByLengthFromParameter(System.Double,System.Double)
Rozdělí křivku na křivky dané délky změřené od daného umístění parametru.
length: Délka křivek po rozdělení
parameter: Umístění parametru pro počátek měření
Returns: Pole křivek po rozdělení
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByDistanceFromParameter(System.Double,System.Double)
Rozdělí křivku na křivky dané délky tětivy změřené od daného umístění parametru.
distance: Délka tětivy každé křivky získané z rozdělení
parameter: Umístění parametru pro počátek měření
Returns: Pole křivek po rozdělení
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimStart(System.Double)
Odebere počátek křivky v zadaném parametru.
startParameter: Parametr, ve kterém začít ořezávat
Returns: Nová křivka s odebraným počátkem
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimEnd(System.Double)
Odstraní konec křivky v zadaném parametru.
endParameter: Parametr, ve kterém začít ořezávat
Returns: Nová křivka s odstraněným koncem
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrim(System.Double,System.Double)
Odebere začátek a konec křivky v zadaných parametrech.
startParameter: Parametr, ve kterém začít ořezávat
endParameter: Parametr, ve kterém začít ořezávat
Returns: Nová křivka s odstraněnými vnějšími segmenty
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.ParameterTrimInterior(System.Double,System.Double)
Odstraní vnitřní část křivky v zadaných parametrech.
startParameter: Parametr, ve kterém začít ořezávat
endParameter: Parametr, ve kterém začít ořezávat
Returns: Nová křivka s odstraněným vnitřním segmentem
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimSegments(System.Double[])
Odstraní několik segmentů křivky, přičemž vyřadí první, třetí, pátý... segment.
parameters: Seznam parametrů, ve kterých rozdělit křivku
Returns: Pole křivek s vyřazeným prvním, třetím, pátým... segmentem
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
Odebere několik segmentů křivky, přičemž odstraní druhý, čtvrtý, šestý... segment, pokud je hodnota bool true.
parameters: Seznam parametrů, ve kterých rozdělit křivku
discardEvenSegments: Přepínač k odstranění sudých segmentů
Returns: Pole křivek s vyřazeným druhým, čtvrtým, šestým ... segmentem, pokud je logická hodnota true.
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double)
Rozdělí křivku na dvě části v zadaném parametru.
parameter: Parametr, ve kterém provést rozdělení
Returns: Dvě křivky zbývající po rozdělení
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double)
Rozdělí křivku na dvě části v zadaném parametru.
parameter: Parametr, ve kterém provést rozdělení
Returns: Dvě křivky zbývající po rozdělení
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double[])
Rozdělit křivku na více částí v zadaných parametrech
parameters: Seznam parametrů, ve kterých rozdělit křivku
Returns: Křivky vytvořené z rozdělení
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Připojit sadu křivek ke konci objektu polycurve. Převrátí křivky kvůli zajištění konektivity.
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany

Autodesk.DesignScript.Geometry.Curve.Join(Autodesk.DesignScript.Geometry.Curve)
Spojte tuto křivku a vstupní křivku do nového objektu PolyCurve, přičemž přesně zachovejte původní křivky.
curve: Křivka, se kterou má být vytvořeno spojení
Returns: Objekt PolyCurve tvořený dvěma křivkami
convertcurve,curve2polycurve,joincurve,concat

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
Prodlužte křivku o zadanou vzdálenost v určitém konci určeném vybraným bodem. Vybraná strana se prodlouží. Uzavřené křivky, jako jsou kružnice a elipsy, nelze prodloužit.
distance: Vzdálenost prodloužení
pickSide: Bod na konci, který má být prodloužen
Returns: Prodloužená křivka
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
Prodlužte křivku o zadanou vzdálenost na jejím počátku. Uzavřené křivky, jako jsou kružnice a elipsy, nelze prodloužit.
distance: Vzdálenost prodloužení
Returns: Prodloužená křivka
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
Prodlužte křivku o zadanou vzdálenost na jejím konci. Uzavřené křivky, jako jsou kružnice a elipsy, nelze prodloužit.
distance: Vzdálenost prodloužení
Returns: Prodloužená křivka
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Promítne vstupní křivku podél daného směru promítnutí na určenou základní geometrii. Geometrie k promítnutí seznamu geometrií ontoVectorList promítnutého do základní geometrie