Autodesk.DesignScript.Geometry.Ellipse.ToString
Získat řetězcovou reprezentaci prvku Ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Vytvořte elipsu vystředěnou na vstupní bod, zarovnanou s rovinou XY GSS a s určenými poloměry osy X a Y.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by origin and radii
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Vytvořte elipsu vystředěnou na vstupní bod, se dvěma zadanými osami. Osy by navzájem měly svírat úhel 90 stupňů.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from origin vectors
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Vytvořte elipsu vystředěnou a zarovnanou se vstupním systémem CoordinateSystem, s poloměrem x_radius ve směru X systému CS a poloměrem y_radius ve směru Y systému CS.
origin: Origin coordinate system of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by coordinate system and radii
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Vytvořte elipsu vystředěnou a zarovnanou se vstupní rovinou, s poloměrem x_radius ve směru osy X roviny a s poloměrem y_radius ve směru osy Y roviny.
plane: Plane where ellipse arc is drawn
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from plane and radii
ellipse,aligned ellipse,ellipsebylengths