Autodesk.DesignScript.Geometry.Plane.ToString
Získat řetězcovou reprezentaci prvku Plane

Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Vytvoří rovinu vystředěnou na kořenový bod, s vstupním normálovým vektorem.
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Vytvoří „orientovanou“ rovinu umístěnou v počátku bodu s normálovým vektorem, ale se specifickou orientací osy X. Toto nastavení nemá žádný vliv na rozdělení, průsečíky, promítnutí a jiné podobné operace, pouze určuje orientaci vstupního souřadnicového systému.
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Osa X a Y leží v rovině. Osa Z je vektorový součin dvou vektorů.
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Umístí rovinu do vstupních bodů; v zásadě jde o 3D umístění bodového grafu.
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Vytvořte rovinu obsahující vstupní čáru a externí bod. Bod nemůže ležet na čáře nebo na ose čáry.
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
Vytvoří rovinu v prostoru XY.
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
Vytvoří rovinu v prostoru XZ.
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
Vytvoří rovinu v prostoru YZ.
Returns: Plane at YZ plane of world

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
Vytvoří nový systém CoordinateSystem, který představuje tuto rovinu. Je založena na počátku a osách X a Y.
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
Vytvořte nové odsazení roviny podle této roviny v normálovém směru, a to o zadanou vzdálenost.
alongnormal,moveplane