Autodesk.DesignScript.Geometry.Mesh.ToString
Získat řetězcovou reprezentaci prvku Mesh

Autodesk.DesignScript.Geometry.Mesh.ByPointsFaceIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
Vytvořit síť z kolekce bodů a kolekce objektů IndexGroup odkazujících na kolekci bodů
vertexPositions: List of points that determine vertex positions
indices: Indices for vertices
Returns: Mesh created from points
mesh,meshes