Autodesk.DesignScript.Geometry.Sphere.ToString
Získat řetězcovou reprezentaci prvku Sphere

Autodesk.DesignScript.Geometry.Sphere.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Vytvořte těleso (kouli) vystředěné na vstupní bod, se zadaným poloměrem.
Brep,brep