Autodesk.DesignScript.Geometry.EllipseArc.ToString
Získat řetězcovou reprezentaci prvku EllipseArc

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Vytvořit objekt EllipseArc v rovině pomocí daných poloměrů podél os X a Y a úhlů tažení
plane: Rovina obsahující oblouk elipsy
xRadius: Poloměr objektu EllipseArc ve směru osy X roviny
yRadius: Poloměr objektu EllipseArc ve směru osy Y roviny
startAngle: Počáteční úhel oblouku podle měření od kladné osy X vstupní roviny
sweepAngle: Úhel tažení od počátečního úhlu ve stupních
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiStartAngleSweepAngle(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Vytvořit objekt EllipseArc v rovině pomocí daných poloměrů podél os X a Y a úhlů tažení
plane: Rovina, ve které je obsažen objekt EllipseArc
xRadius: Poloměr objektu EllipseArc ve směru osy X roviny
yRadius: Poloměr objektu EllipseArc ve směru osy Y roviny
startAngle: Počáteční úhel oblouku podle měření od kladné osy X vstupní roviny
sweepAngle: Úhel tažení od počátečního úhlu ve stupních
ellipsearc,arcs