Autodesk.DesignScript.Geometry.UV.ToString
Získat řetězcovou reprezentaci prvku UV

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
Umožňuje porovnat dva objekty UV.
other: Druhý objekt UV
Returns: Rozhodnutí, zda jsou dva objekty stejné

Autodesk.DesignScript.Geometry.UV.GetHashCode
Umožňuje získat pro tento typ hodnotu hash.
Returns: Jedinečná hodnota hash pro tento objekt

Autodesk.DesignScript.Geometry.UV.ByCoordinates(System.Double,System.Double)
Vytvoření UV ze dvou hodnot typu double.
u: U value
v: V value
Returns: UV created by coordinates
surfaceparam,parameters,uv,uvs