Autodesk.DesignScript.Geometry.Solid.ToString
Získat řetězcovou reprezentaci prvku Solid

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Vytvořte těleso pomocí šablonování mezi uzavřenými křivkami vstupního příčného řezu, a to s pomocí vodicí křivky. Vodicí křivka musí protínat všechny křivky průřezů.
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Vytvořte těleso pomocí šablonování mezi uzavřenými křivkami vstupního příčného řezu, a to s pomocí vodicí křivky. Vodicí křivka musí protínat všechny křivky průřezů.
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
Vytvořte těleso pomocí šablonování mezi vstupními příčnými řezy uzavřenými křivkami PolyCurve. Tato operace je optimalizována pro řezy složené výhradně z úsečkových segmentů, přičemž vrcholy jsou ve stejném pořadí. Zaškrtnutí a oprava zaručují platnost vytvořeného tělesa, pokud je možnost povolena, zatímco deaktivování by mělo zvýšit výkon.
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Táhnout uzavřenou křivku profilu podél dvou křivek trajektorie.
path: Vstup k tažení podél trajektorie
guideRail: Trajektorie, podle které se řídí orientace tažení
profile: The profile curve to sweep along the path
Brep,brep,sweep2,guides,sweepprofile

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Vytvořte těleso rotace pomocí tažení křivky profilu kolem paprsku osy, který je tvořen počátkem a vektorem osy, a to z počátečního úhlu ve stupních do úhlu tažení ve stupních.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Solid created by revolve
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
Sjednocení seznamu těles s tímto tělesem
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
Logický rozdíl tohoto tělesa a jiného

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
Získat skořepinu tělesa z ploch tohoto tělesa
internalFaceThickness: Vzdálenost prodloužení skořepiny směrem dovnitř
externalFaceThickness: Vzdálenost prodloužení skořepiny směrem ven
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Promítne vstupní geometrii na toto těleso, ve směru vstupního vektoru. !!Tato metoda promítání aktuálně podporuje pouze body nebo křivky!!
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
Rozdělí těleso na jednotlivá tělesa, pokud obsahují více než jeden rozpojený celek. Vrátí stejné těleso, pokud je to jeden souvislý celek.
Returns: oddělit rozpojená tělesa
split,disjoint