Autodesk.DesignScript.Geometry.Helix.ToString
Získat řetězcovou reprezentaci prvku Helix

Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Vytvořte šroubovici. Šroubovice se vždy otáčí ve směru hodinových ručiček okolo zadaného směru osy. Při prohlížení podél směru osy se v prohlížeči zobrazí bod otáčející se ve směru pohybu hodinových ručiček kolem osy, protože se pohybuje po křivce ve směru vzrůstajícího parametru. Rozteč je vzdálenost, kterou šroubovice urazí ve směru osy za jedno otočení. Tato hodnota může být kladná nebo záporná.
axisPoint: Axis point
axisDirection: Axis direction vector
startPoint: Helix start point
pitch: Distance of the helix per each 360 degrees in the direction of the axis
angleTurns: How many turns in degrees
Returns: Helix created by axis
helix,screw,corkscrew,thread