Autodesk.DesignScript.Geometry.Rectangle.ToString
Získat řetězcovou reprezentaci prvku Rectangle

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Vytvořte obdélník pomocí čtyř rohových bodů.
points: List of corner points of rectangle
Returns: Rectangle created by corner points
rectbypointarray

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Vytvořte obdélník pomocí čtyř rohových bodů.
p1: 1st corner point of rectangle
p2: 2nd corner point of rectangle
p3: 3rd corner point of rectangle
p4: 4th corner point of rectangle
Returns: Rectangle created by corner points
rectbypoints

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Vytvořte obdélník vystředěný na počátek systému GSS v rovině XY systému GSS se zadanou šířkou (délka osy x) a délkou (délka osy Y).
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Vytvořte obdélník vystředěný na kořen vstupní roviny se vstupní šířkou (délka osy X roviny) a délkou (délka osy Y roviny).
plane: Plane used to center rectangle
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Vytvořte obdélník vystředěný na vstupní počátek v rovině XY systému CoordinateSystem se zadanou šířkou (délka osy x) a délkou (délka osy Y).
coordinateSystem: Souřadnicový systém obdélníku (střed obdélníku)
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created from width and length
rectbylengths