Autodesk.DesignScript.Geometry.Properties.Resources.LowerModelerExtentExceeded
Vyhledá lokalizovaný řetězec podobný řetězci „Vstup leží mimo povolený rozsah modelování, zvažte výběr nastavení {0} s rozsahem modelování mezi hodnotami {1} a {2} v dialogu Nastavení => Pracovní rozsah geometrie.“

Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
Vyhledá lokalizovaný řetězec podobný řetězci „Byl překročen povolený rozsah modelu, zvažte výběr menších hodnot.“

Autodesk.DesignScript.Geometry.Properties.Resources.UpperModelerExtentExceeded
Vyhledá lokalizovaný řetězec podobný řetězci „Vstup leží mimo povolený rozsah modelování, zvažte výběr nastavení {0} s rozsahem modelování mezi hodnotami {1} a {2} v dialogu Nastavení => Pracovní rozsah geometrie.“