Autodesk.DesignScript.Geometry.Polygon.ToString
Získat řetězcovou reprezentaci prvku Polygon

Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Kontroluje, zda je bod uvnitř rovinného mnohoúhelníku, aniž by protínal sám sebe.