Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
Získat řetězcovou reprezentaci prvku CoordinateSystem

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
Vytvořte systém CoordinateSystem s počátkem ve vstupním bodu, s
osami X a Y nastavenými jako osy X a Y v GSS.
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByPlane(Autodesk.DesignScript.Geometry.Plane)
Vytvořte systém CoordinateSystem s počátkem, který bude roven počátku vstupní roviny,
osami X a Y ležícími v rovině zarovnané s osami X a Y roviny.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Vytvořit systém CoordinateSystem v počátku s osami X a Y.
Vstupní vektory se normalizují před vytvořením systému CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Vytvořit systém CoordinateSystem v počátku s osami X a Y, přičemž osa Z
je kompletně ignorována. Vstupní vektory se normalizují před vytvořením
systému CoordinateSystem.
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
Určuje, zda je možné získat opak tohoto systému CoordinateSystem.
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
Testuje, zda je změna měřítka ortogonální, tj. zda obsahuje smykové komponenty.
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
Testuje, zda je změna měřítka ortogonální a zda jsou všechny vektory normalizované.
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
Vytvoří bod, který představuje počátek systému CoordinateSystem.
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
Vrací osu X systému CoordinateSystem.
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
Vrací osu Y systému CoordinateSystem.
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
Vrací osu Z systému CoordinateSystem.
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
Vrací změnu měřítka osy X systému CoordinateSystem: délka vektoru osy X.

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
Vrací změnu měřítka osy Y systému CoordinateSystem: délka vektoru osy Y.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
Vrací změnu měřítka osy Z systému CoordinateSystem: délka vektoru osy Z.

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
Získat inverzní systém k tomuto systému CoordinateSystem – přičemž se použije tento systém CoordinateSystem na část geometrie, což otočí původní systém.

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Použít systém CoordinateSystem argumentu po tomto – Výsledek = tento * jiný

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Použít systém CoordinateSystem argumentu před tímto – Výsledek = tento * jiný

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
Vrací vektor, který obsahuje faktory měřítka X, Y a Z.
Returns: Vektor s měřítkem
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
Určit, zda jsou dva systémy CoordinateSystems stejné
other: jiný souřadnicový systém
Returns: vrací hodnotu true, pokud jsou souřadnicové systémy shodné

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
Převádí libovolný daný systém CoordinateSystem podle zadaného posunutí ve směru X, Y
a Z definovaném v GSS.
xTranslation: Posunutí podél osy X
yTranslation: Posunutí podél osy Y
zTranslation: Posunutí podél osy Z
Returns: Transformovaný systém CoordinateSystem
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
Převést objekt ve směru a velikosti vstupního vektoru.
direction: Vektor směru převodu
Returns: Převedený souřadnicový systém
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Převede libovolný typ systému CoordinateSystem podle zadané vzdálenosti v daném
směru.
direction: Vektor směru posunutí
distance: Vzdálenost posunutí v daném směru
Returns: Převedený souřadnicový systém
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Transformuje tento systém CoordinateSystem ze zdrojového systému CoordinateSystem
do nového kontextového systému CoordinateSystem.
Returns: Transformovaný systém CoordinateSystem

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Otočí objekt kolem počátku a osy o zadaný počet stupňů
origin: Bod počátku
axis: Osa vektoru pro otočení
degrees: Otočení ve stupních
Returns: Otočený souřadnicový systém
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Otočí objekt kolem počátku a normály dané roviny o zadaný počet
stupňů.
plane: Rovina, ze které se má získat normála
degrees: Hodnota otočení ve stupních
Returns: Otočený souřadnicový systém
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
Upravit měřítko rovnoměrně kolem počátku
amount: Velikost měřítka
Returns: Souřadnicový systém s upraveným měřítkem
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
Upravit měřítko nerovnoměrně kolem počátku
xamount: Velikost měřítka v ose X
yamount: Velikost měřítka v ose Y
zamount: Velikost měřítka v ose Z
Returns: Souřadnicový systém s upraveným měřítkem
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Upravit měřítko nerovnoměrně kolem dané roviny
plane: Rovina, kolem které se má změnit měřítko
xamount: Velikost měřítka v ose X
yamount: Velikost měřítka v ose y
zamount: Velikost měřítka v ose z
Returns: Souřadnicový systém s upraveným měřítkem
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Změnit měřítko rovnoměrně kolem daného bodu pomocí
basePoint: Základní bod změny měřítka
from: Bod, od kterého má proběhnout změna měřítka
to: Bod, po který má proběhnout změna měřítka
Returns: Souřadnicový systém s upraveným měřítkem
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Upravit měřítko v jednom rozměru pomocí základního bodu, počátečního bodu (od) a koncového bodu (do). Osa změny měřítka je definována čarou mezi základním bodem a počátečním bodem.
basePoint: Základní bod změny měřítka
from: Bod, od kterého má proběhnout změna měřítka
to: Bod, po který má proběhnout změna měřítka
Returns: Souřadnicový systém s upraveným měřítkem
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Upravit měřítko ve dvou rozsazích podle základny a 2 vybraných bodů. Dva vybrané body jsou promítnuty na základní rovinu za účelem určení 2D faktorů měřítka.
basePlane: Základní bod změny měřítka
from: Bod, od kterého má proběhnout změna měřítka
to: Bod, po který má proběhnout změna měřítka
Returns: Souřadnicový systém s upraveným měřítkem
resize,size,from,to,scale2d,2d