Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
Získat řetězcovou reprezentaci prvku TSplineSurface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit „orientovanou“ rovinu T-Spline, umístěnou v počátečním bodu s normálou vektoru, ale s určitou orientací osy X.
Toto nemá vliv na operace rozdělení, průniku, promítání atd., pouze to určuje orientaci vstupního systému CoordinateSystem.
origin: Kořenový bod roviny
normal: Normála roviny
xAxis: Osa X roviny
minCorner: 2D bod minimálního rohu v souřadnicích roviny
maxCorner: 2D bod maximálního rohu v souřadnicích roviny
xSpans: Počet rozpětí v šířce
ySpans: Počet rozpětí v délce
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Povrch T-Spline roviny
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit rovinu podle počátku a osy X, Y.
Osa Z je vektorový součin dvou vektorů.
origin: Kořenový bod roviny
xAxis: Osa X roviny
yAxis: Osa Y roviny
minCorner: 2D bod minimálního rohu v souřadnicích roviny
maxCorner: 2D bod maximálního rohu v souřadnicích roviny
xSpans: Počet rozpětí v šířce
ySpans: Počet rozpětí v délce
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Povrch T-Spline roviny
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit kužely T-Spline s daným základním poloměrem v počátečním bodu,
s rozšířením na vrchol v koncovém bodu.
startPoint: Počáteční bod kužele
endPoint: Koncový bod kužele
radius: Poloměr základny kužele
radiusSpans: Počet rozpětí v obvodu
heightSpans: Počet rozpětí ve výšce
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Kuželový povrch T-Spline
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit kužely T-Spline s osou z počátečního bodu ke koncovému bodu, s danými poloměry na začátku a na konci.
Tento objekt nemá vrchol a má tvar komolého jehlanu.
startPoint: Počáteční bod kužele
endPoint: Koncový bod kužele
startRadius: Počáteční poloměr kužele
endRadius: Koncový poloměr kužele
radiusSpans: Počet rozpětí v obvodu
heightSpans: Počet rozpětí ve výšce
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Kuželový povrch T-Spline
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Vytvořit kužely T-Spline se základním bodem v počátku souřadnicového systému, s rozšířením ve směru osy Z souřadnicového systému,
s kruhovou základnou v rovině XY souřadnicového systému.
cs: Střed a základna kužele budou umístěny v rovině X-Y tohoto souřadnicového systému
height: Výška kužele
radius: Poloměr kužele
radiusSpans: Počet rozpětí v obvodu
heightSpans: Počet rozpětí ve výšce
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Kuželový povrch T-Spline
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit kužely T-Spline se základním bodem v počátku systému CoordinateSystem, s rozšířením ve směru osy Z systému CoordinateSystem,
s kruhovou základnou v rovině XY systému CoordinateSystem.
cs: Střed a základna budou umístěny v rovině X-Y tohoto souřadnicového systému
height: Výška kužele
startRadius: Počáteční poloměr kužele
endRadius: Koncový poloměr kužele
radiusSpans: Počet rozpětí v obvodu
heightSpans: Počet rozpětí ve výšce
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Kuželový povrch T-Spline
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit kouli T-Spline vystředěnou na vstupní bod, s daným poloměrem.
centerPoint: Střed koule
radius: Poloměr koule
radiusSpans: Počet radiálních rozpětí
heightSpans: Počet rozpětí ve výšce
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Kulový povrch T-Spline
tspline,sphere,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuj vytvořit kouli T-Spline obsahující čtyři vstupní body na povrchu.
points: Čtyři body v seznamu pro vytvoření koule. Body by neměly být v jedné rovině.
radiusSpans: Počet radiálních rozpětí
heightSpans: Počet rozpětí ve výšce
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Kulový povrch T-Spline
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit anuloidy T-Spline s daným středem a poloměry, zarovnané s výchozí globální rovinou XY.
center: Střed anuloidu
innerRadius: Vnitřní poloměr anuloidu
outerRadius: Vnější poloměr anuloidu
innerRadiusSpans: Počet vnitřních radiálních rozpětí
outerRadiusSpans: Počet vnějších radiálních rozpětí
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Prstencový povrch T-Spline
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit kvádr T-Spline vystředěný na vstupní bod, s určenou šířkou, délkou a výškou.
origin: Střed kvádru
width: Šířka kvádru
length: Délka kvádru
height: Výška kvádru
xSpans: Počet rozpětí v šířce
ySpans: Počet rozpětí v délce
zSpans: Počet rozpětí ve výšce
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Kvádr T-Spline
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit kvádr T-Spline vystředěný a orientovaný na vstupní systém CoordinateSystem, s určenou šířkou, délkou a výškou.
cs: Rovina X-Y kvádru bude zarovnána s odpovídající osou X
width: Šířka kvádru
length: Délka kvádru
height: Výška kvádru
xSpans: Počet rozpětí v šířce
ySpans: Počet rozpětí v délce
zSpans: Počet rozpětí ve výšce
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Kvádr T-Spline
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit kvádr T-Spline s rozsahem od dolního bodu po horní bod.
lowPoint: První rohový bod
highPoint: Druhý rohový bod
xSpans: Počet rozpětí v šířce
ySpans: Počet rozpětí v délce
zSpans: Počet rozpětí ve výšce
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Kvádr T-Spline
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit čtyřúhelníkové koule T-Spline se středem v počátku systému CoordinateSystem a daným poloměrem.
cs: Místní souřadnicový systém
radius: Poloměr čtyřúhelníkové koule
spans: Počet rozpětí ve dvou rozměrech stran čtyřúhelníkové koule
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Čtyřúhelníková koule T-Spline
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit čtyřúhelníkové koule T-Spline s daným středem a poloměrem, zarovnané s výchozí globální rovinou XY.
center: Střed čtyřúhelníkové koule
radius: Poloměr čtyřúhelníkové koule
spans: Počet rozpětí ve dvou rozměrech stran čtyřúhelníkové koule
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Čtyřúhelníková koule T-Spline
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Umožňuje sestavit povrch T-Spline z povrchu NURBS pomocí jednotné strategie.
Vstupní povrch NURBS je znovu sestaven s jednotnými uzly umístěnými ve stejných parametrických intervalech nebo
intervalech délky oblouku v závislosti na odpovídajícím příznaku useArcLen a aproximován
povrchem NURBS stupně 3. Výstupní křivka T-Spline je rozdělena podle daného počtu rozpětí
ve směrech U a V.
nurbsSurface: Vstupní povrch NURBS
uSpans: Požadovaný počet rozpětí ve směru U
vSpans: Požadovaný počet rozpětí ve směru V
uUseArcLen: Zda použít délku oblouku nebo parametrický úsek v parametrickém směru U
vUseArcLen: Zda použít délku oblouku nebo parametrický úsek v parametrickém směru V
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
Umožňuje sestavit povrch T-Spline z povrchu NURBS pomocí strategie úseku zakřivení.
Vstupní povrch NURBS je znovu sestaven na stupeň 3. Výstupní křivka T-Spline obsahuje počty a
polohy rozpětí v každém směru, které jsou zjištěny automaticky v závislosti na zakřivení.
nurbsSurface: Vstupní povrch NURBS
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Umožňuje sestavit křivku T-Spline tažením křivky průřezu podél trajektorie.
profile: Křivka profilu
path: Křivka trajektorie
parallel: Její rozpětí by mělo být rovnoběžné ve směru trajektorie.
pathSpans: Počet rozpětí v trajektorii
profileSpans: Počet rozpětí v profilu. Definováno automaticky, pokud je hodnota 0 nebo menší.
pathUniform: Použít jednotnou strategii nebo strategii zakřivení pro rozmístění rozpětí podél trajektorie
profileUniform: Použít jednotnou strategii nebo strategii zakřivení pro rozmístění rozpětí podél profilu
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Umožňuje vytvořit povrch T-Spline tažením křivky profilu kolem osy tvořené
počátkem osy a směrem osy, s počátkem v objektu start_angle ve stupních,
a tažením objektu sweep_angle ve stupních.
profile: Křivka profilu
axisOrigin: Střed otočení
axisDirection: Osa otočení
startAngle: Úhel zahájení otočení
sweepAngle: Úhel dokončení otočení
radialSpans: Počet rozpětí v poloměru
axialSpans: Počet rozpětí ve výšce. Definováno automaticky, pokud je hodnota 0 nebo menší.
uniform: Použít jednotnou strategii nebo strategii zakřivení pro rozmístění rozpětí
symmetry: Možnosti symetrie povrchu T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Umožňuje vytvořit potrubní povrch ze sítě křivek nebo čar.
V každém průsečíku křivky je vytvořen vyhlazený spoj.
Některé parametry přebírají jednu hodnotu nebo seznam – dvě hodnoty na křivku.
curves: Seznam křivek, kterých mají být vytvořena potrubí
defaultRadius: Výchozí poloměr pro vytvořené potrubí
snappingTolerance: Tolerance použitá ke zjištění průsečíků křivek
segmentsCount: Počet segmentů v každém potrubí. Je povolena jedna hodnota nebo seznam, a to dvakrát delší než počet křivek.
endRotations: Hodnoty koncových otočení každého potrubí (ve stupních). Je povolena jedna hodnota nebo seznam, a to dvakrát delší než počet křivek.
endRadii: Hodnoty koncových poloměrů každého potrubí. Je povolena jedna hodnota nebo seznam, a to dvakrát delší než počet křivek.
endPercentage: Hodnoty (0 až 1) od konce každé vstupní křivky po začátek potrubní sítě. Je povolena jedna hodnota nebo seznam, a to dvakrát delší než počet křivek.
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Umožňuje vytvořit potrubní povrch ze sítě křivek nebo čar.
V každém průsečíku křivky je vytvořen vyhlazený spoj.
Některý parametr přebírá jednu hodnotu nebo seznam – jednu hodnotu na křivku.
curves: Seznam křivek, kterých mají být vytvořena potrubí
defaultRadius: Výchozí poloměr pro vytvořené potrubí
snappingTolerance: Tolerance použitá ke zjištění průsečíků křivek
segmentsCount: Počet segmentů na každou křivku. Velikost seznamu může tvořit počet křivek nebo 1 pro replikaci nebo 0 pro automatické určení.
autoHandleStart: Pokud je hodnota true, vygenerují se automaticky parametry ovladače na začátku každé křivky a uživatelské parametry rotationsAtStart, radiiAtStart a positionsAtStart budou ignorovány.
autoHandleEnd: Pokud je hodnota true, vygenerují se automaticky parametry ovladače na koncí každé křivky a uživatelské parametry rotationsAtEnd, radiiAtEnd a positionsAtEnd budou ignorovány.
startRotations: Vlastní úhel otočení každého ovladače potrubí (ve stupních) na začátku každé křivky. Tento parametr je ignorován, když je hodnota autoHandleStart true. Velikost seznamu může být počet křivek nebo 1 pro replikaci.
endRotations: Vlastní úhel otočení každého ovladače potrubí (ve stupních) na konci každé křivky. Tento parametr je ignorován, když je hodnota autoHandleEnd true. Velikost seznamu může být počet křivek nebo 1 pro replikaci.
startRadii: Vlastní poloměr každého ovladače potrubí na začátku každé křivky. Tento parametr je ignorován, pokud je hodnota autoHandleStart true. Velikost seznamu může být počet křivek nebo 1 pro replikaci.
endRadii: Vlastní poloměr každého ovladače potrubí na konci každé křivky. Tento parametr je ignorován, pokud je hodnota autoHandleEnd true. Velikost seznamu může být počet křivek nebo 1 pro replikaci.
startPositions: Vlastní pozice každého ovladače trubky na počátku každé křivky (v procentech) mezi 0 a 1 podél délky oblouku křivky. Tento parametr je ignorován, pokud má objekt autoHandleStart hodnotu true. Velikost seznamu může být rovna počtu křivek nebo 1 v případě replikace. Počáteční a koncová pozice by se neměly vzájemně překrývat u žádné křivky. Ideálně by počáteční pozice měla být blízko k 0, zatímco koncová pozice blízko k 1.
endPositions: Vlastní pozice každého ovladače trubky na konci každé křivky (v procentech) mezi 0 a 1 podél délky oblouku křivky. Tento parametr je ignorován, pokud má objekt autoHandleEnd hodnotu true. Velikost seznamu může být rovna počtu křivek nebo 1 v případě replikace. Počáteční a koncová pozice by se neměly vzájemně překrývat u žádné křivky. Ideálně by počáteční pozice měla být blízko k 0, zatímco koncová pozice blízko k 1.
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
Umožňuje sloučit dané povrchy T-Spline do jednoho.
Povrchy nelze vzájemně propojit.
Pokud je alespoň jeden povrch v režimu kvádru – výstupní povrch bude také v režimu kvádru.
tSplineSurfaces: Povrchy T-Spline, které mají být sloučeny
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
Určuje, zda je křivka t-spline v režimu kvádru nebo vyhlazeném režimu.
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
Určuje, zda je křivka t-spline otevřená.
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Umožňuje převést povrch TSpline na těleso nebo povrch v závislosti na tvaru.
matchTopology: Určuje, zda by výsledné těleso mělo mít stejnou topologii jako křivka TSpline.
Returns: Entita topologie (těleso nebo povrch)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
Umožňuje převést povrch t-spline na síť. Síť může obsahovat trojúhelníky i čtyřúhelníky.
minSegments: Minimální počet segmentů v každém směru. Vždy bude vytvořen alespoň jeden segment.
tolerance: Maximální povolená vzdálenost od sítě k povrchu. Nastavení na nulovou nebo zápornou hodnotu zakáže její použití.
Returns: Entita sítě
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
Umožňuje svařit daný seznam vrcholů do jednoho vrcholu.
vertices: Vrcholy, které mají být svařeny
newPosition: Poloha výsledného uzlu vrcholu. Pokud je předána nulová hodnota, použije se střední poloha uzlů.
keepSubdCreases: Zachovat vyostření úseků vstupní topologie
Returns: Povrch TSpline se svařenými vrcholy
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Boolean)
Umožňuje svařit vrcholy první a druhé skupiny po dvou.
První skupina je považována za vrcholy této křivky t-spline.
Vrcholy druhé skupiny mohou být z tohoto povrchu nebo z libovolného jiného povrchu.
V případě různých křivek t-spline je před svařováním provedeno sloučení.
firstGroup: První skupina vrcholů, které mají být svařeny
secondGroup: Druhá skupina vrcholů, které mají být svařeny
keepSubdCreases: Zachovat vyostření úseků vstupní topologie
Returns: Povrch TSpline se svařenými vrcholy
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Umožňuje zrušit svary všech zadaných hran. Budou zrušeny svary každého vrcholu na všech hranách.
edges: Sada hran, jejichž svary mají být zrušeny
Returns: Povrch TSpline s hranami se zrušenými svary
tspline,unweld,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Umožňuje zrušit svary všech zadaných vrcholů. Budou zrušeny svary všech hran na každém vrcholu.
vertices: Sada vrcholů, jejichž svary mají být zrušeny
Returns: Povrch TSpline s vrcholy se zrušenými svary
tspline,unweld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Umožňuje vytvořit shodu s křivkou T-Spline a uzavřenou smyčkou křivek.
tsEdges: Uzavřená smyčka hrany T-Spline, se kterou má být vytvořena shoda
curves: Uzavřená smyčka křivky, se kterou má být vytvořena shoda
continuity: Kontinuita geometrie, se kterou má být proveden pokus o shodu: G0, G1, G2
useArclength: Zda použít zarovnání objektu arcLength při vytváření shody
useRefinement: Pokud je hodnota true, ke křivce T-spline budou přidány další řídicí body, aby se shodovala s povrchy v dané toleranci.
numRefinementSteps: Maximální počet kroků upřesnění. Ignorováno, pokud je možnost useRefinement nastavena na hodnotu false.
refinementTolerance: Tolerance, které je třeba dosáhnout. Ignorováno, pokud je možnost useRefinement nastavena na hodnotu false.
usePropagation: Zda použít rozšíření při vytváření shody
widthOfPropagation: Určuje, jak velká část povrchu je ovlivněna shodou. Ignorováno, pokud je možnost usePropagation nastavena na hodnotu false.
tangentScale: Měřítko tečny. Ignorováno, pokud není kontinuita nastavena na hodnotu G1.
curvParamWeight: Váha parametru zakřivení. Ignorováno, pokud není kontinuita nastavena na hodnotu G2.
flipSourceTargetAlignment: Zda obrátit směr zarovnání
Returns: Povrch T-Spline umístěný mezi danými hraničními hranami křivky T-Spline a smyčkou křivky
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Umožňuje vytvořit shodu s křivkou T-Spline a uzavřenou smyčkou křivek.
tsEdges: Uzavřená smyčka hrany T-Spline, se kterou má být vytvořena shoda
curves: Uzavřená smyčka křivky, se kterou má být vytvořena shoda
continuity: Kontinuita geometrie, se kterou má být proveden pokus o shodu: G0, G1, G2
useArclength: Zda použít zarovnání objektu arcLength při vytváření shody
useRefinement: Pokud je hodnota true, ke křivce T-spline budou přidány další řídicí body, aby se shodovala s povrchy v dané toleranci.
numRefinementSteps: Maximální počet kroků upřesnění. Ignorováno, pokud je možnost useRefinement nastavena na hodnotu false.
refinementTolerance: Tolerance, které je třeba dosáhnout. Ignorováno, pokud je možnost useRefinement nastavena na hodnotu false.
usePropagation: Zda použít rozšíření při vytváření shody
widthOfPropagation: Určuje, jak velká část povrchu je ovlivněna shodou. Ignorováno, pokud je možnost usePropagation nastavena na hodnotu false.
scale: Měřítko tečny pro G1 nebo měřítko zakřivení pro G2. Ignorováno, pokud je spojitost G0.
flipSourceTargetAlignment: Zda obrátit směr zarovnání
Returns: Povrch T-Spline umístěný mezi danými hraničními hranami křivky T-Spline a smyčkou křivky
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Umožňuje vytvořit shodu s křivkou T-Spline a uzavřenou smyčkou hran BRep. Nejprve
je smyčka hrany převedena na smyčku křivky a poté je provedena shoda.
tsEdges: Uzavřená smyčka hrany T-Spline, se kterou má být vytvořena shoda
brepEdges: Uzavřená smyčka hrany BRep, se kterou má být vytvořena shoda
continuity: Kontinuita geometrie, se kterou má být proveden pokus o shodu: G0, G1, G2
useArclength: Zda použít zarovnání objektu arcLength při vytváření shody
useRefinement: Pokud je hodnota true, ke křivce T-spline budou přidány další řídicí body, aby se shodovala s povrchy v dané toleranci.
numRefinementSteps: Maximální počet kroků upřesnění. Ignorováno, pokud je možnost useRefinement nastavena na hodnotu false.
refinementTolerance: Tolerance, které je třeba dosáhnout. Ignorováno, pokud je možnost useRefinement nastavena na hodnotu false.
usePropagation: Zda použít rozšíření při vytváření shody
widthOfPropagation: Určuje, jak velká část povrchu je ovlivněna shodou. Ignorováno, pokud je možnost usePropagation nastavena na hodnotu false.
tangentScale: Měřítko tečny. Ignorováno, pokud není kontinuita nastavena na hodnotu G1.
curvParamWeight: Váha parametru zakřivení. Ignorováno, pokud není kontinuita nastavena na hodnotu G2.
flipSourceTargetAlignment: Zda obrátit směr zarovnání
Returns: Povrch T-Spline umístěný mezi danými hraničními hranami křivky T-Spline a smyčkou hrany BRep
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
Umožňuje změnit styl vizualizace křivky t-spline.
Pokud je předána hodnota true, použije se hladká vizualizace. V opačném případě se použije kvádrová.
enable: Povolit nebo zakázat hladkou vizualizaci
Returns: Křivka t-spline s vybraným stylem vizualizace
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExtrudeEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},Autodesk.DesignScript.Geometry.Vector,System.Int32)
Umožňuje provést jedno nebo více symetrických vysunutí u sady hran a přesunout nové hany podle daného vektoru.
edges: Sada hran, které mají být vysunuty
direction: Vektor, podle kterého mají být přesunuty nové hrany
spans: Množství nových segmentů, které budou vytvořeny
Returns: Křivka t-spline s vysunutými hranami
tspline,extrude,direction,vector,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Umožňuje vytvořit přemostění mezi dvěma sadami ploch. Položky první skupiny
jsou považovány za podřazené položky tohoto povrchu. Položky druhé
skupiny mohou být podřazené položky tohoto povrchu nebo patří
k jinému povrchu. Topologie v každé skupině nemusí být přilehlá,
ale měla by vytvořit stejný počet různých smyček.
firstGroup: První skupina ploch, které mají být přemostěny
secondGroup: Druhá skupina ploch, které mají být přemostěny
followCurves: Křivky přemostění pro každou různou smyčku
topologie (v případě předání prázdného seznamu jsou použity přímky, v případě předání
jedné křivky a zjištění více než jedné vstupní smyčky je křivka replikována)
frameRotations: Počet úplných otočení okolo
normály rámových konstrukcí podél křivky přemostění pro každou různou
smyčku topologie (v případě předání prázdného seznamu se použije hodnota 0,
v případě předání jedné hodnoty a zjištění více než jedné vstupní smyčky je hodnota replikována)
spansCounts: Počet segmentů podél přemostění pro
každou různou smyčku topologie. Počet rozpětí pro každou skupinu by měl být
větší než odpovídající počet otočení (v případě předání prázdného seznamu
se použije hodnota 1, v případě předání jedné hodnoty a zjištění více než
jedné vstupní smyčky je hodnota replikována).
cleanBorderBridges: Odstranit přemostění mezi hraničními hranami
keepSubdCreases: Zachovat vyostření úseků
vstupní topologie
firstAlignVertices: Seznam orientovaných vrcholů pro
jednotlivé odlišné smyčky topologie z první skupiny (počet vrcholů by měl
být stejný jako počet zjištěných vstupních smyček, případně může být seznam prázdný)
secondAlignVertices: Seznam orientovaných vrcholů pro
jednotlivé odlišné smyčky topologie z druhé skupiny (počet vrcholů by měl
být stejný jako počet zjištěných vstupních smyček, případně může být seznam prázdný)
flipAlignmentFlags: Seznam příznaků označujících, zda
obrátit zarovnání přemostění pro odpovídající smyčku topologie
(v případě předání prázdného seznamu je nastavena hodnota false,
v případě předání jedné hodnoty je hodnota replikována pro každou zjištěnou vstupní smyčku)
Returns: Povrch TSpline s topologií, připojený pomocí přemostění
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Umožňuje vytvořit přemostění mezi sadou ploch a sadou hran. Položky
první skupiny jsou považovány za podřazené položky tohoto povrchu. Položky
druhé skupiny mohou být podřazené položky tohoto povrchu nebo patří
k jinému povrchu. Topologie v každé skupině nemusí být přilehlá,
ale měla by vytvořit stejný počet různých smyček.
firstGroup: První skupina ploch, které mají být přemostěny
secondGroup: Druhá skupina hran, které mají být přemostěny
followCurves: Křivky přemostění pro každou různou smyčku
topologie (v případě předání prázdného seznamu jsou použity přímky, v případě předání
jedné křivky a zjištění více než jedné vstupní smyčky je křivka replikována)
frameRotations: Počet úplných otočení okolo
normály rámových konstrukcí podél křivky přemostění pro každou různou
smyčku topologie (v případě předání prázdného seznamu se použije hodnota 0,
v případě předání jedné hodnoty a zjištění více než jedné vstupní smyčky je hodnota replikována)
spansCounts: Počet segmentů podél přemostění pro
každou různou smyčku topologie. Počet rozpětí pro každou skupinu by měl být
větší než odpovídající počet otočení (v případě předání prázdného seznamu
se použije hodnota 1, v případě předání jedné hodnoty a zjištění více než
jedné vstupní smyčky je hodnota replikována).
cleanBorderBridges: Odstranit přemostění mezi hraničními hranami
keepSubdCreases: Zachovat vyostření úseků
vstupní topologie
firstAlignVertices: Seznam orientovaných vrcholů pro
jednotlivé odlišné smyčky topologie z první skupiny (počet vrcholů by měl
být stejný jako počet zjištěných vstupních smyček, případně může být seznam prázdný)
secondAlignVertices: Seznam orientovaných vrcholů pro
jednotlivé odlišné smyčky topologie z druhé skupiny (počet vrcholů by měl
být stejný jako počet zjištěných vstupních smyček, případně může být seznam prázdný)
flipAlignmentFlags: Seznam příznaků označujících, zda
obrátit zarovnání přemostění pro odpovídající smyčku topologie
(v případě předání prázdného seznamu je nastavena hodnota false,
v případě předání jedné hodnoty je hodnota replikována pro každou zjištěnou vstupní smyčku)
Returns: Povrch TSpline s topologií, připojený pomocí přemostění
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Umožňuje vytvořit přemostění mezi sadou hran a sadou povrchů. Položky
první skupiny jsou považovány za podřazené položky tohoto povrchu. Položky
druhé skupiny mohou být podřazené položky tohoto povrchu nebo patří
k jinému povrchu. Topologie v každé skupině nemusí být přilehlá,
ale měla by vytvořit stejný počet různých smyček.
firstGroup: První skupina hran, které mají být přemostěny
secondGroup: Druhá skupina ploch, které mají být přemostěny
followCurves: Křivky přemostění pro každou různou smyčku
topologie (v případě předání prázdného seznamu jsou použity přímky, v případě předání
jedné křivky a zjištění více než jedné vstupní smyčky je křivka replikována)
frameRotations: Počet úplných otočení okolo
normály rámových konstrukcí podél křivky přemostění pro každou různou
smyčku topologie (v případě předání prázdného seznamu se použije hodnota 0,
v případě předání jedné hodnoty a zjištění více než jedné vstupní smyčky je hodnota replikována)
spansCounts: Počet segmentů podél přemostění pro
každou různou smyčku topologie. Počet rozpětí pro každou skupinu by měl být
větší než odpovídající počet otočení (v případě předání prázdného seznamu
se použije hodnota 1, v případě předání jedné hodnoty a zjištění více než
jedné vstupní smyčky je hodnota replikována).
cleanBorderBridges: Odstranit přemostění mezi hraničními hranami
keepSubdCreases: Zachovat vyostření úseků
vstupní topologie
firstAlignVertices: Seznam orientovaných vrcholů pro
jednotlivé odlišné smyčky topologie z první skupiny (počet vrcholů by měl
být stejný jako počet zjištěných vstupních smyček, případně může být seznam prázdný)
secondAlignVertices: Seznam orientovaných vrcholů pro
jednotlivé odlišné smyčky topologie z druhé skupiny (počet vrcholů by měl
být stejný jako počet zjištěných vstupních smyček, případně může být seznam prázdný)
flipAlignmentFlags: Seznam příznaků označujících, zda
obrátit zarovnání přemostění pro odpovídající smyčku topologie
(v případě předání prázdného seznamu je nastavena hodnota false,
v případě předání jedné hodnoty je hodnota replikována pro každou zjištěnou vstupní smyčku)
Returns: Povrch TSpline s topologií, připojený pomocí přemostění
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Umožňuje vytvořit přemostění mezi dvěma sadami hran. Položky
první skupiny jsou považovány za podřazené položky tohoto povrchu. Položky
druhé skupiny mohou být podřazené položky tohoto povrchu nebo patří
k jinému povrchu. Topologie v každé skupině nemusí být přilehlá,
ale měla by vytvořit stejný počet různých smyček.
firstGroup: První skupina hran, které mají být přemostěny
secondGroup: Druhá skupina hran, které mají být přemostěny
followCurves: Křivky přemostění pro každou různou smyčku
topologie (v případě předání prázdného seznamu jsou použity přímky, v případě předání
jedné křivky a zjištění více než jedné vstupní smyčky je křivka replikována)
frameRotations: Počet úplných otočení okolo
normály rámových konstrukcí podél křivky přemostění pro každou různou
smyčku topologie (v případě předání prázdného seznamu se použije hodnota 0,
v případě předání jedné hodnoty a zjištění více než jedné vstupní smyčky je hodnota replikována)
spansCounts: Počet segmentů podél přemostění pro
každou různou smyčku topologie. Počet rozpětí pro každou skupinu by měl být
větší než odpovídající počet otočení (v případě předání prázdného seznamu
se použije hodnota 1, v případě předání jedné hodnoty a zjištění více než
jedné vstupní smyčky je hodnota replikována)
cleanBorderBridges: Odstranit přemostění mezi hraničními hranami
keepSubdCreases: Zachovat vyostření úseků
vstupní topologie
firstAlignVertices: Seznam orientovaných vrcholů pro
jednotlivé odlišné smyčky topologie z první skupiny (počet vrcholů by měl
být stejný jako počet zjištěných vstupních smyček, případně může být seznam prázdný)
secondAlignVertices: Seznam orientovaných vrcholů pro
jednotlivé odlišné smyčky topologie z druhé skupiny (počet vrcholů by měl
být stejný jako počet zjištěných vstupních smyček, případně může být seznam prázdný)
flipAlignmentFlags: Seznam příznaků označujících, zda
obrátit zarovnání přemostění pro odpovídající smyčku topologie
(v případě předání prázdného seznamu je nastavena hodnota false,
v případě předání jedné hodnoty je hodnota replikována pro každou zjištěnou vstupní smyčku)
Returns: Povrch TSpline s topologií, připojený pomocí přemostění
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
Umožňuje vyplnit otvory v křivce v T-spline.
edges: Množina hran s otvorem uvnitř. Hrany musí být hraniční.
fillMethod: Metoda vyplnění otvoru: 0 – mozaika, 1 – polygony, 2 – sbalit, 3 – sbalit a svařit
keepSubdCreases: Zachovat vyostření úseků vstupní topologie
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
Umožňuje zkomprimovat veškerou topologii na povrchu a vytvoří souvislé indexy. Tato funkce zachová relativní pořadí indexů.
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
Interpolace vpřed (forward interpolation) přesune řídicí body na jejich parametrická umístění na povrchu. Obrácená interpolace (reverse interpolation) vytvoří bod na povrchu pro každý původní řídicí bod a přesune tento řídicí bod na jeho odpovídající bod povrchu.
reverse: Směr interpolace: vpřed v případě hodnoty false, v opačném případě obrácený
Returns: Interpolovaná křivka T-Spline v daném směru
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Umožňuje vyrovnat řídicí body daných vrcholů do jedné roviny.
Tento příkaz vyžaduje zadání alespoň čtyř vrcholů.
vertices: Seznam vrcholů
Returns: Povrch T-SPline s vyrovnanými vrcholy
tspline,flatten,vertices

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Plane)
Umožňuje vyrovnat řídicí body daných vrcholů do jedné roviny,
která bude rovnoběžná s danou rovinou.
Tento příkaz vyžaduje zadání alespoň čtyř vrcholů.
vertices: Seznam vrcholů
parallelPlane: Rovina, na které budou umístěny s ní rovnoběžné vrcholy
Returns: Povrch T-SPline s vyrovnanými vrcholy
tspline,flatten,vertices,fitparallel

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Umožňuje zkopírovat vybrané plochy do nového povrchu. Nový povrch nemá žádnou symetrii.
faces: Plochy, které mají být duplikovány
Returns: Povrch T-Spline pouze s vybranými plochami
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Umožňuje přesunout dané vrcholy podél daného vektoru.
vertices: Seznam vrcholů, které mají být přesunuty
vector: Směr, podél kterého se má provést přesun
onSurface: Příznak označující, zda použít body povrchu nebo řídicí body vrcholů

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSS(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface},System.String)
Umožňuje exportovat danou sadu povrchů T-Spline do souboru scény T-Spline.
tSplineSurfaces: Sada povrchů T-Spline, které mají být exportovány
filePath: Cesta k souboru, do kterého bude provedeno uložení
Returns: Cesta k souboru, do kterého se ukládá sada křivek T-Spline
tspline,export,save,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface,System.String)
Umožňuje exportovat daný povrch T-Spline do souboru sítě T-Spline.
tSplineSurface: Povrch T-Spline, který má být exportován
filePath: Cesta k souboru, do kterého bude provedeno uložení
Returns: Cesta k souboru, do kterého se ukládá povrch T-Spline
tspline,export,save,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
Zapište povrch T-spline do řetězce ve formátu sítě T-spline.
tSplineSurface: Povrch T-Spline, který má být serializován
Returns: Řetězec, kde je povrch T-Spline serializován
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
Umožňuje vytvořit povrch T-Spline z řetězce ve formátu sítě T-Spline.
content: Řetězcová reprezentace souboru sítě T-Spline
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Nově načtený povrch T-Spline v seznamu
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
Umožňuje načíst povrch T-Spline z daného souboru sítě T-Spline.
filePath: Cesta k souboru, ze kterého bude provedeno načtení
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Nově načtený povrch T-Spline v seznamu
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.IO.FileInfo,System.Boolean)
Umožňuje načíst povrch T-Spline z daného souboru sítě T-Spline.
file: Soubor, ze kterého bude provedeno načtení
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Nově načtený povrch T-Spline v seznamu
tspline,import,load,tsm,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
Umožňuje načíst sadu povrchů T-Spline z daného souboru scény T-Spline.
filePath: Cesta k souboru, ze kterého bude provedeno načtení
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Sada nově načtených povrchů T-Spline
tspline,import,load,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.IO.FileInfo,System.Boolean)
Umožňuje načíst sadu povrchů T-Spline z daného souboru scény T-Spline.
file: Soubor, ze kterého bude provedeno načtení
inSmoothMode: Zobrazit povrch T-Spline v kvádrové nebo hladké vizualizaci
Returns: Sada nově načtených povrchů T-Spline
tspline,import,load,tss,file