Autodesk.DesignScript.Geometry.Cone.ToString
Získat řetězcovou reprezentaci prvku Cone

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Vytvořte kužel s daným základním poloměrem v počátečním bodu, s rozšířením na vrchol v koncovém bodu.
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Vytvořte kužel s osou z počátečního bodu ke koncovému bodu, s danými poloměry na začátku a na konci. Tento objekt nemá vrchol a může být považován za oříznutý kužel.
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Vytvoří kužel se základním bodem v počátku systému CoordinateSystem, s rozšířením v délce vykreslení osy Z systému CoordinateSystem, s kruhovou základnou v rovině XY systému CoordinateSystem.

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Vytvoří kužel se základním bodem v počátku systému CoordinateSystem, s rozšířením v délce vykreslení osy Z systému CoordinateSystem, s kruhovými základnami v rovině XY systému CoordinateSystem.
cone,cone by height,cones