Autodesk.DesignScript.Geometry.Cuboid.ToString
Získat řetězcovou reprezentaci prvku Cuboid

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(System.Double,System.Double,System.Double)
Vytvořte kvádr vystředěný na počátek GSS, se šířkou, délkou a výškou.
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Vytvořte kvádr vystředěný na vstupní bod, s určenou šířkou, délkou a výškou.
origin: Origin point
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Vytvořit kvádr vystředěný na počátek GSS, se šířkou, délkou a výškou.
coordinateSystem: Nadřazený souřadnicový systém (střed kvádru)
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created from lengths
box,cube,cubebysize,bycoord,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Vytvořte kvádr s rozsahem od dolního bodu po horní bod.
lowPoint: Corner low point of cuboid
highPoint: Corner high point of cuboid
Returns: Cuboind created by corners
box,cube,byminmax,by corners,by points,cubes

Autodesk.DesignScript.Geometry.Cuboid.Length
Vrací vzdálenost délky. Poznámka: Tento příkaz vrátí vstupní kóty kvádru, NIKOLI skutečné kóty globálního prostoru. Jinými slovy, pokud vytvoříte kvádr, šířka (osa X), délka 10 a transformujete jej do systému CoordinateSystem se změnou měřítka 2x v ose X, šířka bude stále 10. ASM vám neumožňuje extrahovat vrcholy tělesa v libovolném předvídatelném pořadí, takže není možné určit kóty po transformaci.

Autodesk.DesignScript.Geometry.Cuboid.Width
Vrací vzdálenost šířky. Poznámka: Tento příkaz vrátí vstupní kóty kvádru, NIKOLI skutečné kóty globálního prostoru. Jinými slovy, pokud vytvoříte kvádr, šířka (osa X), délka 10 a transformujete jej do systému CoordinateSystem se změnou měřítka 2x v ose X, šířka bude stále 10. ASM vám neumožňuje extrahovat vrcholy tělesa v libovolném předvídatelném pořadí, takže není možné určit kóty po transformaci.

Autodesk.DesignScript.Geometry.Cuboid.Height
Vrací vzdálenost výšky. Poznámka: Tento příkaz vrátí vstupní kóty kvádru, NIKOLI skutečné kóty globálního prostoru. Jinými slovy, pokud vytvoříte kvádr, šířka (osa X), délka 10 a transformujete jej do systému CoordinateSystem se změnou měřítka 2x v ose X, šířka bude stále 10. ASM vám neumožňuje extrahovat vrcholy tělesa v libovolném předvídatelném pořadí, takže není možné určit kóty po transformaci.