Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
Získat řetězcovou reprezentaci prvku TSplineTopology

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
Vrací vrchol v daném indexu.
index: Index získání vrcholu
Returns: Vrchol T-Spline
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
Vrací hranu v daném indexu.
index: Index získání hrany
Returns: Hrana T-Spline
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
Vrací plochu v daném indexu.
index: Index získání plochy
Returns: Plocha T-Spline
tspline,face,byindex