Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
中心をルート点に持ち、入力された法線ベクトルを持つ平面を作成します。
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
指定された基準点に配置され、指定されたベクトル法線を持ち、指定された X 軸で方向付けられた平面を作成します。この X 軸によって分割、交差、投影などの操作に影響が生じることはなく、単に入力座標系の方向が指定されます。
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
X 軸と Y 軸が存在する平面。Z 軸は 2 本のベクトルの外積になります。
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
入力された点に合わせて平面を調整します。基本的に 3D 散布図による調整です。
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
入力された線分と外部の点を含む平面を作成します。点を線分上または線分軸内に配置することはできません。
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
ワールド座標系の XY に平面を作成します。
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
ワールド座標系の XZ 平面に平面を作成します
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
ワールド座標系の YZ に平面を作成します。
Returns: Plane at YZ plane of world