Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
4 つのインデックスを格納する IndexGroup を作成します
a: Index a
b: Index b
c: Index c
d: Index d
Returns: IndexGroup
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
3 つのインデックスを格納する IndexGroup を作成します
a: Index a
b: Index b
c: Index c
Returns: IndexGroup
tri,polygon,mesh,meshes