Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
らせんを作成します。らせんは、指定した軸の向きに対して常に時計回りに回転します。軸の向きに沿って表示すると、パラメータが増加する方向に、曲線に沿って点が移動するように、軸を中心に点が時計回りに回転するように見えます。Pitch はらせんが軸の向きに回転移動する Distance です。正または負の値を設定できます。
axisPoint: Axis point
axisDirection: Axis direction vector
startPoint: Helix start point
pitch: Distance of the helix per each 360 degrees in the direction of the axis
angleTurns: How many turns in degrees
Returns: Helix created by axis
helix,screw,corkscrew,thread