Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
UV 空間内のサーフェスの線分によって曲線を作成
baseSurface: 使用するサーフェス
startParams: 曲線を開始する UV 開始点
endParams: 曲線を終了する UV 終了点
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
サーフェスの面分割線によって曲線を作成
baseSurface: 基準面
direction: 面分割線が 0 本の場合は U 方向に、1 本の場合は V 方向に
parameter: 他のサーフェス パラメータの曲線の値で決定
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
ポリカーブの終点に一連の曲線を結合します。接続性を保証するために曲線を反転します。
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany