Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
入力された中心点と半径をワールド座標系の XY 平面に持ち、ワールド座標系の Z 軸を法線とする円を作成します。
centerPoint: Center point of circle
radius: Radius
Returns: Circle created with center point and radius
circle

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadiusNormal(Autodesk.DesignScript.Geometry.Point,System.Double,Autodesk.DesignScript.Geometry.Vector)
中心点、半径、法線方向を指定して円を作成します。
centerPoint: Center point of circle
radius: Radius
normal: Normal direction vector
Returns: Circle created with center point radius and normal
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
入力された平面の基準点(ルート)を中心として、指定された半径を持つ円を平面上に作成します。
plane: Root of plane used to center circle
radius: Radius
Returns: Circle created with plane and radius
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
3 つの入力点を通過する円を作成します。
p1: 1st point of circle
p2: 2nd point of circle
p3: 3rd point of circle
circle

Autodesk.DesignScript.Geometry.Circle.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
点群を通過する最適な円
points: 円を合わせる点のリスト
Returns: Circle created from points
circle,approximate