Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
入力された複数の T スプライン サーフェスを 1 つに結合します。
サーフェス同士を互いに接続することはできません。
1 つ以上のサーフェスがボックス モードになっている場合、出力されるサーフェスもボックス モードになります。
tSplineSurfaces: 結合する T スプライン サーフェス
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
T スプライン サーフェスを、その形状に応じてソリッドかサーフェスに変換します。
matchTopology: 作成される本体のトポロジを T スプラインと同じトポロジにするかどうかを決定します
Returns: トポロジ エンティティ(ソリッドまたはサーフェス)
tspline,brep,solid,surface