Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
入力されたジオメトリの周囲に、軸に位置合わせされた BoundingBox を作成します。
geom: Geometries to determine bounding box
Returns: Bounding box enclosing geometries
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
2 つの BoundingBox の交点を取得します
other: Other bounding box to intersect
Returns: Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
2 つの BoundingBox が交差しているかどうかを判断します
other: Other bounding box
Returns: Do bounding boxes intersect
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
BoundingBox が空かどうかを判断します
Returns: Returns true if the bounding box is empty