Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
補間した点、U、V 次数を指定して NURBS サーフェスを作成します。作成されるサーフェスはすべての点を通過します。
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
明示的な制御点と指定された U 次数と V 次数を使用して、NURBS サーフェス を作成します。
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
NURBS サーフェスの制御点の重みを返します。重みによって、各制御点がサーフェス形状に与える影響を判断します。
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
U 方向のサーフェス ノットを返します。ノットは、制御点がサーフェスに影響を与える位置とその影響の程度を判断するために使用される、一連のパラメータ値(倍精度浮動小数点数)です。
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
V 方向のサーフェス ノットを返します。ノットは、制御点がサーフェスに影響を与える位置とその影響の程度を判断するために使用される、一連のパラメータ値(倍精度浮動小数点数)です。
Returns: Nurbs V knots of surface