Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
XY 軸上の平面内に、半径とスイープする角度を指定して、楕円弧を作成します。
plane: 楕円弧が含まれる平面
xRadius: 平面 X 方向に延びる楕円弧の半径
yRadius: 平面 Y 方向に延びる楕円弧の半径
startAngle: 入力平面の正の X 軸を計測基準とする円弧の開始角
sweepAngle: 開始角からの開きの角度(度単位)
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs