Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
読み込まれたジオメトリのリスト
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
SAT ファイルを読み込み、読み込んだジオメトリの配列を返します
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
一連の指定したジオメトリを標準 ACIS バイナリ(SAB)形式にシリアル化し、シリアル化されたバイナリ ストリーム データを返します
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes