Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
入力された断面曲線間をロフトしてサーフェスを作成します。
crossSections: Curves to loft through
Returns: Surface created by loft
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
ガイド曲線(レール)を指定し、断面にサーフェスをロフトします。ガイド曲線は、断面のすべての曲線と交差する必要があります。
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
断面曲線をパスに沿ってスイープすることにより、サーフェスを作成します。
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
閉じた ポリゴン内の入力された点群をつなぐポリゴン サーフェスを作成します。
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
2 つのレールをガイドとするパスに沿って、断面をスイープします
path: スイープの基準とする入力パス。
guideRail: スイープの方向をガイドするレール。
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
基準点によって形成される軸の配列要素を中心に、プロファイル曲線を軸ベクトルの向きにスイープすることにより、サーフェスを作成します。開始角度 startAngle から開始し、スイープ角度 sweepAngle までスイープします。
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
入力された曲線で設定される閉じた境界の内部を塗り潰してサーフェスを作成します。
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
サーフェス上の入力された点でサーフェスの法線を返します。
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
指定した許容値内でサーフェスの Nurbs 表現を取得します。特定の状況では、このメソッドは近似のサーフェスを取得します。
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
サーフェスに厚みを持たせてソリッドを作成します。サーフェスを法線の方向に両側に押し出します。
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
サーフェスに厚みを持たせてソリッドを作成します。サーフェスを法線の方向に押し出します。both_sides パラメータが true の場合は、サーフェスの厚さが両側に設定されます。
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
サーフェスの法線の方向に指定された距離だけサーフェスをオフセットします。
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
返される座標系では、uDir、vDir、法線を表すのに xAxis、yAxis、zAxis を使用します。xAxis、yAxis の長さが曲率を表します。
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
主曲率の方向で位置合わせされた座標系を返します。
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
指定された U および V パラメータの U 接線ベクトルを返します。
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
指定した U および V パラメータの V 接線 Vector を返します。
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
指定した U および V パラメータの法線 Vector を返します。
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
入力 U 座標と入力 V 座標の導関数を返します。
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
U と V パラメータでの主方向ベクトルを返します。
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
法線を反転させた新しいサーフェスを返します。このサーフェスは変更されません。
Returns: Surface, which is the same as the input surface but with flipped normals