Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
3 つのユークリッド座標でベクトルを形成します。
x: X 座標
y: Y 座標
z: Z 座標
Returns: Vector created by coordinates
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
3 つのユークリッド座標でベクトルを形成し、ベクトルを正規化します。
x: X 座標
y: Y 座標
z: Z 座標
normalized: ベクトルを正規化する場合は true、正規化しない場合は false
Returns: Vector created by coordinates
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
2 つのベクトルの内積を形成します
vec: a second vector
Returns: Resulting dot product
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
2 つのベクトルが平行かどうかを判断します。
otherVector: もう一方のベクトル
Returns: Returns True if the vectors are parallel; false otherwise.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
2 つのベクトルがほぼ等しいかどうかを判断します。精度の問題を処理するために、許容差の値 1e-5 が指定されています。
otherVector: もう一方のベクトル
Returns: Returns True if the vectors are almost equal; false otherwise.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
このベクトルを入力された座標系マトリックスによって変換します。
coordinateSystem: ベクトルの変換に使用する座標系
Returns: Transformed vector

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
角度を指定し、軸を中心にベクトルを回転します
axis: Rotation axis vector
degrees: Number of degrees to rotate
Returns: Rotated vector
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
角度を指定し、平面の基準点と法線を中心にベクトルを回転します
plane: 回転平面
degrees: Number of degrees to rotate
Returns: Rotated vector
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
基準点を中心にベクトルを均等に調整します
scale_factor: Scale factor
Returns: Scaled vector
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
0 ～ 180 度の範囲で、2 つのベクトル間の角度を返します。
otherVector: Other vector
Returns: Returns angle between the supplied vectors in degrees from 0 to 180.
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
0 ～ 360 度の範囲で、2 つのベクトル間の角度を返します。角度の方向の決定には回転軸が使用されます。
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,