Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
点群の集合に最も近似する円弧を作成します
points: 円弧を最適フィットさせる点のリスト
Returns: Arc created by best fit through points
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
開始接線を Vector にし、開始 Point から終了 Point までの Arc を作成
startPoint: Start point of arc
endPoint: End point of arc
startTangent: Start tangent direction vector
arc,tangent,arcs