Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
点を接続してポリカーブを作成します。「connectLastToFirst」入力を true に設定してポリカーブを閉じます。
points: ポリカーブを作成する点群
connectLastToFirst: 最後の点を最初の点に接続する場合は true、開いたままにする場合は false
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
インデックスごとのポリカーブの曲線を返します。
index: 点を配置する長さ
endOrStart: ポリカーブの終点からカウントする場合は true、ポリカーブの始点からカウントする場合は false
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
平面でポリカーブをオフセットします。
signedDistance: オフセットする量
extendCircular: コーナーに丸みを付けるかどうかを切り替え
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
平面内のポリカーブにフィレット。
radius: フィレットの半径
rightSide: ポリカーブの始点に対して右側でフィレットする場合は true、左側でフィレットする場合は false
Returns: Filleted polyCurve
round,smooth,radius