Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
ポリサーフェスのサーフェスの数を返します。
Returns: Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
ポリサーフェスのエッジの数を返します。
Returns: Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
ポリサーフェスの頂点の数を返します。
Returns: Number of vertices