Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
4 つのコーナー点により長方形を作成します。
points: List of corner points of rectangle
Returns: Rectangle created by corner points
rectbypointarray

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
4 つのコーナー点により長方形を作成します。
p1: 1st corner point of rectangle
p2: 2nd corner point of rectangle
p3: 3rd corner point of rectangle
p4: 4th corner point of rectangle
Returns: Rectangle created by corner points
rectbypoints

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
入力された幅(平面の X 軸の長さ)と高さ(平面の Y 軸の長さ)を持ち、ワールド座標系の基準点を中心とする長方形を、ワールド座標系の XY 平面に作成します。
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
入力された幅(平面の X 軸の長さ)と高さ(平面の Y 軸の長さ)を持ち、平面のルートを中心とする長方形を作成します。
plane: Plane used to center rectangle
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
指定した幅(X 軸の長さ)と長さ(Y 軸の長さ)を持ち、座標系内の入力された原点を中心とする長方形を作成します。
coordinateSystem: 長方形の座標系(長方形の中心)
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created from width and length
rectbylengths