Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
明示的な制御点を使用して B スプライン曲線を作成します。注 1: deg = 1 の B スプライン曲線には G1 不連続が発生し、押し出し、スイープ、その他の操作に問題が生じます。これらの問題は回避する必要があります。代わりにポリカーブを使用します。注 2: 曲線が周期曲線である(閉じている)場合、最初の点と最後の点を同じにする必要があります。
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
明示的な制御点を使用して B スプライン曲線を作成します。注 1: deg = 1 の B スプライン曲線には G1 不連続が発生し、押し出し、スイープ、その他の操作に問題が生じます。これらの問題は回避する必要があります。代わりにポリカーブを使用します。注 2: 曲線が周期曲線である(閉じている)場合、最初の点と最後の点を同じにする必要があります。
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
明示的な制御点を使用して B スプライン曲線を作成します。注 1: deg = 1 の B スプライン曲線には G1 不連続が発生し、押し出し、スイープ、その他の操作に問題が生じます。これらの問題は回避する必要があります。代わりにポリカーブを使用します。注 2: 曲線が周期曲線である(閉じている)場合、最初の点と最後の点を同じにする必要があります。
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
点間を補間して B スプライン曲線を作成します。
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
点間を補間することにより B スプライン曲線を作成します。注 2: 曲線が周期曲線である(閉じている)場合、最初の点と最後の点を同じにする必要があります。
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
指定した角度で点間を補間することにより、B スプライン曲線を作成します。
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
接線の方向で、点を通過する B スプライン曲線を返します。
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
曲線のノット。ノットは、制御点が曲線に影響を与える位置とその影響の程度を判断するために使用される、一連のパラメータ値(倍精度浮動小数点数)です。
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
NURBS 曲線の制御点の重みを返します。重みによって、各制御点が曲線形状に与える影響を判断します。
Returns: Weights of nurbs curve
ptweight