Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
指定された 2 つのデカルト座標を使用して、XY 平面に点を作成します。Z コンポーネントは 0 です。
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
基準点(0,0,0)を取得
Returns: Origin point
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
指定された 3 つのデカルト座標を使用して、点を作成します。
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
指定された座標系と 3 つのデカルト座標を使用して、点を作成します。
coordinateSystem: 親座標系
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
含まれる点の許容値内の重複を除外するための点を削除します
points: 重複を削除する点のリスト
tolerance: 削除に使用される許容範囲
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near