Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
入力された点を中心とする楕円を作成します。作成される楕円はワールド座標系 XY Pl平面に位置合わせされ、指定された X 軸半径と Y 軸半径を持ちます。
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by origin and radii
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
入力された点を中心とする楕円を作成します。2 つの軸を指定します。軸は互いに直交する必要があります。
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from origin vectors
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
入力された座標系に中心点を持ち、位置合わせされた楕円を作成します。x_radius 半径を X 軸方向に、y_radius 半径を Y 軸方向に指定します。
origin: Origin coordinate system of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by coordinate system and radii
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
入力された平面に中心点を持ち、位置合わせされた楕円を作成します。x_radius 半径を平面 X 軸方向に、y_radius 半径を平面 Y 軸方向に指定します。
plane: Plane where ellipse arc is drawn
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from plane and radii
ellipse,aligned ellipse,ellipsebylengths