Autodesk.DesignScript.Geometry.Properties.Resources.LowerModelerExtentExceeded
「入力した値が使用可能なモデリング範囲内にありません。[設定] => [ジオメトリの動作範囲]ダイアログで、{0} 設定(モデリング範囲内が {1} から {2})を選択してください」に類似するローカライズされた文字列を検索します。

Autodesk.DesignScript.Geometry.Properties.Resources.UpperModelerExtentExceeded
「入力した値が使用可能なモデリング範囲内にありません。[設定] => [ジオメトリの動作範囲]ダイアログで、{0} 設定(モデリング範囲内が {1} から {2})を選択してください」に類似するローカライズされた文字列を検索します。