DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Schreibt das Bild unter Verwendung des angegebenen Dateinamens in einen Pfad.
image: Das zu schreibende Bild
Keine Ausgabe
write image,image,file,filepath