DSCore.DummyPythonEvaluator
Python-Auswertung, die nur bei der Auswertung einen Fehler ausgibt.
Wird primär verwendet, um anzugeben, dass eine echte Python-Auswertung nicht gefunden werden konnte.

DSCore.DummyPythonEvaluator.Evaluate(System.String,System.Collections.IList,System.Collections.IList)
Gibt eine Ausnahme mit der zugewiesenen Meldung aus