DSCore.DateTime.Components(System.DateTime)
Extrahiert die einzelnen Komponenten eines DateTime-Werts.
dateTime: DateTime-Wert, von dem Komponenten abgerufen werden sollen
Numerische Darstellung des Jahres (1–9999)
Numerische Darstellung des Monats (1–12)
Numerische Darstellung des Tages (1–[Tage im Monat])
Numerische Darstellung der Stunde (0–23)
Numerische Darstellung der Minuten (0–59)
Numerische Darstellung der Sekunden (0–59)
Numerische Darstellung der Sekunden (0–999)