Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Erstellt einen an der Achse ausgerichteten BoundingBox um die eingegebenen Geometrien.
geom: Geometries to determine bounding box
Returns: Bounding box enclosing geometries
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Ruft den Schnittbereich zweier BoundingBoxes ab.
other: Other bounding box to intersect
Returns: Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Bestimmt, ob zwei BoundingBoxes einander schneiden.
other: Other bounding box
Returns: Do bounding boxes intersect
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
Bestimmt, ob der BoundingBox leer ist.
Returns: Returns true if the bounding box is empty