Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
Kombiniert gegebene T-Spline-Oberflächen zu einer einzigen.
Die Oberflächen dürfen nicht miteinander verbunden sein.
Falls mindestens eine der Oberflächen sich im Quadermodus befindet, gilt dies auch für die ausgegebene Oberfläche.
tSplineSurfaces: Zu kombinierende T-Spline-Oberflächen
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Konvertiert die TSpline-Oberfläche gemäß ihrer Form in einen Volumenkörper oder eine Oberfläche.
matchTopology: Legt fest, ob der resultierende Körper dieselbe Topologie wie der TSpline aufweisen soll.
Returns: Topologieobjekt (Volumenkörper oder Oberfläche)
tspline,brep,solid,surface