Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Bildet einen Vektor durch 3 euklidische Koordinaten.
x: X-Koordinate
y: Y-Koordinate
z: Z-Koordinate
Returns: Vector created by coordinates
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Bildet einen Vektor durch 3 euklidische Koordinaten, und normalisiert ihn.
x: X-Koordinate
y: Y-Koordinate
z: Z-Koordinate
normalized: True für normalisierten Vektor, false für nicht normalisierten Vektor
Returns: Vector created by coordinates
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Bildet das Punktprodukt aus zwei Vektoren.
vec: a second vector
Returns: Resulting dot product
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Bestimmt, ob zwei Vektoren parallel sind.
otherVector: Anderer Vektor
Returns: Returns True if the vectors are parallel; false otherwise.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Bestimmt, ob zwei Vektoren beinahe gleich sind. Ein Toleranzwert von 1e-5 wird für die Handhabung von Genauigkeitsproblemen verwendet.
otherVector: Anderer Vektor
Returns: Returns True if the vectors are almost equal; false otherwise.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transformiert diesen Vektor mithilfe der eingegebenen CoordinateSystem-Matrix.
coordinateSystem: Koordinatensystem für die Vektortransformation
Returns: Transformed vector

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Dreht einen Vektor um den angegebenen Winkel in Grad um eine Achse.
axis: Rotation axis vector
degrees: Number of degrees to rotate
Returns: Rotated vector
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Dreht einen Vektor um den angegebenen Winkel in Grad um den Ursprungspunkt und die Normale der Ebene.
plane: Drehungsebene
degrees: Number of degrees to rotate
Returns: Rotated vector
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Skaliert einen Vektor gleichmäßig vom Ursprung aus.
scale_factor: Scale factor
Returns: Scaled vector
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
Gibt den Winkel zwischen den beiden Vektoren in Grad in einem Bereich von 0 bis 180 zurück.
otherVector: Other vector
Returns: Returns angle between the supplied vectors in degrees from 0 to 180.
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Gibt den Winkel zwischen den beiden Vektoren in Grad in einem Bereich von 0 bis 360 zurück. Die Richtung des Winkels wird anhand der Drehachse bestimmt.
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,