Autodesk.DesignScript.Geometry.UV.ByCoordinates(System.Double,System.Double)
Erstellt UV aus zwei double-Werten.
u: U value
v: V value
Returns: UV created by coordinates
surfaceparam,parameters,uv,uvs