Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Erstellt eine Oberfläche durch Erhebung zwischen den eingegebenen Querschnittskurven.
crossSections: Curves to loft through
Returns: Surface created by loft
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Erhebung einer Oberfläche durch die Querschnitte mithilfe angegebener Führungskurven. Die Führungskurven müssen alle Querschnittskurven schneiden.
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Erstellt eine Oberfläche als Sweep einer Querschnittskurve an einem Pfad entlang.
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Erstellt eine Polygonoberfläche durch Verbinden der eingegebenen Punkte zu einem geschlossenen Polygon und Auffüllen des Polygons.
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Führt die Querschnittskurve unter Verwendung zweier Führungskurven als Sweep an einem Pfad entlang.
path: Der eingegebene Pfad für das Sweep.
guideRail: Führungskurve für die Ausrichtung des Sweep.
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Erstellt eine Oberfläche als Sweep der Profilkurve um den vom Ursprungspunkt in Richtung des Achsenvektors ausgehenden Achsenstrahl vom start_angle in Grad bis zum sweep_angle in Grad.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Erstellt eine Oberfläche durch Ausfüllen des Bereichs innerhalb einer durch die eingegebenen Kurven definierten geschlossenen Begrenzung.
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
Gibt die Oberflächennormale am eingegebenen Punkt auf der Oberfläche zurück.
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Ruft eine Nurbs-Darstellung der Oberfläche innerhalb des angegebenen Toleranzbereichs ab. Mithilfe dieser Methode können in bestimmten Fällen Annäherungen an Oberflächen erstellt werden.
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Wandelt eine Oberfläche durch Extrusion in Richtung ihrer Normalen auf beiden Seiten in einen Volumenkörper um.
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Wandelt eine Oberfläche durch Extrusion in Richtung ihrer Normalen in einen Volumenkörper um. Wenn der Parameter both_sides den Wert true hat, wird die Oberfläche auf beiden Seiten verstärkt.
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
Versetzt die Oberfläche in Richtung ihrer Normalen um den angegebenen Abstand.
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
Im zurückgegebenen Koordinatensystem werden xAxis, yAxis und zAxis zur Darstellung von uDir, vDir und normal verwendet. Die Länge von xAxis, yAxis steht für die Krümmung.
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
Gibt ein an den Hauptkrümmungsrichtungen ausgerichtetes CoordinateSystem zurück.
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
Gibt den U-Tangentenvektor für die angegebenen U- und V-Parameter zurück.
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
Gibt den V-Tangentenvektor für die angegebenen U- und V-Parameter zurück.
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
Gibt den Normalenvektor für die angegebenen U- und V-Parameter zurück.
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
Gibt die Ableitungen an den eingegebenen U- und V-Koordinaten zurück.
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
Gibt die Hauptrichtungsvektoren für die U- und V-Parameter zurück.
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Gibt eine neue Oberfläche mit umgekehrter Normaler zurück. Diese Oberfläche bleibt unverändert.
Returns: Surface, which is the same as the input surface but with flipped normals