Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Erstellt einen zylindrischen Volumenkörper, definiert durch ein übergeordnetes CoordinateSystem, den Radius und die Höhe des Zylinders.
coordinateSystem: Übergeordnetes Koordinatensystem
radius: Radius size
height: Cylinder height
Returns: Cylinder created from radius and height
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Erstellt einen zylindrischen Volumenkörper nach Angabe des unteren und oberen Mittelpunkts des Zylinders.
startPoint: Start point of cylinder
endPoint: End point of cylinder
radius: Radius  of cylinder
Returns: Cylinder created by points and radius
cylinder,tube,by center points