Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Erstellt eine am Ursprungspunkt zentrierte Ebene mit eingegebenem Normalenvektor.
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Erstellt eine "ausgerichtete" Ebene, positioniert am Punktursprung mit der Vektornormalen, aber mit einer bestimmten X-Achsenausrichtung. Dies hat keine Auswirkungen auf Teilungen, Überschneidungen, Projektionen und andere Vorgänge, sondern gibt lediglich die Ausrichtung des Eingabekoordinatensystems an.
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Die X- und Y-Achse liegen in der Ebene. Die Z-Achse ist das Kreuzprodukt der beiden Vektoren.
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Passt eine Ebene in die eingegebenen Punkte ein; im Wesentlichen eine Anpassung an ein 3D-Streudiagramm.
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Erstellt eine Ebene, in der die eingegebene Linie und der externe Punkt liegen. Der Punkt kann nicht auf der Linie oder ihrer Achse liegen.
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
Erstellt eine Ebene in der Welt-XY-Ebene.
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
Erstellt eine Ebene in der Welt-XZ-Ebene.
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
Erstellt eine Ebene in der Welt-YZ-Ebene.
Returns: Plane at YZ plane of world