Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Erstellt eine NurbsSurface mit angegebenen interpolierten Punkten und U- und V-Graden. Die resultierende Oberfläche verläuft durch alle Punkte.
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Erstellt eine NurbsSurface über explizite Steuerpunkte mit angegebenem U- und V-Grad.
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
Gibt die Gewichtungen des NurbsSurface-Kontrollpunkts zurück. Gewichtungen bestimmen den Einfluss jedes Kontrollpunkts auf die Form der Kurve.
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
Gibt die Oberflächenknoten in U-Richtung zurück. Knoten sind eine Reihe von Parameterwerten (doubles), die verwendet werden, um festzulegen, wo und wie die Kontrollpunkte sich auf die Oberfläche auswirken.
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
Gibt die Oberflächenknoten in V-Richtung zurück. Knoten sind eine Reihe von Parameterwerten (doubles), die verwendet werden, um festzulegen, wo und wie die Kontrollpunkte sich auf die Oberfläche auswirken.
Returns: Nurbs V knots of surface