Autodesk.DesignScript.Geometry.Solid.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Sweep einer geschlossenen Profilkurve an zwei Führungskurven entlang
path: Der eingegebene Pfad für das Sweep
guideRail: Führungskurve für die Ausrichtung des Sweep
profile: The profile curve to sweep along the path
Brep,brep,sweep2,guides,sweepprofile

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Erstellt einen Rotationsvolumenkörper als Sweep der Profilkurve um den durch den Ursprung und den Achsenvektor gebildeten Achsenstrahl vom Startwinkel in Grad bis zum Sweep-Winkel in Grad.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Solid created by revolve
Brep,brep,lathe,revolveprofile