Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Erstellt eine am eingegebenen Punkt zentrierte und an der XY-Ebene des WKS ausgerichtete Ellipse mit den angegebenen Radien für die X- und Y-Achse.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by origin and radii
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Erstellt eine am eingegebenen Punkt zentrierte Ellipse mit zwei angegebenen Achsen. Die Achsen müssen im Winkel von 90 Grad zueinander liegen.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from origin vectors
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Erstellt eine am eingegebenen CoordinateSystem zentrierte und ausgerichtete Ellipse mit Radius x_radius in X-Richtung des KS und Radius y_radius in Y-Richtung des KS.
origin: Origin coordinate system of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by coordinate system and radii
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Erstellt eine an der eingegebenen Ebene zentrierte und ausgerichtete Ellipse mit Radius x_radius in Richtung der X-Achse der Ebene und Radius y_radius in Richtung der Y-Achse der Ebene.
plane: Plane where ellipse arc is drawn
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from plane and radii
ellipse,aligned ellipse,ellipsebylengths