Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
Legt einen Punkt in der XY-Ebene nach Angabe zweier kartesischer Koordinaten fest. Die Z-Komponente hat den Wert 0.
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
Ruft den Ursprung ab (0,0,0).
Returns: Origin point
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
Legt einen Punkt nach Angabe dreier kartesischer Koordinaten fest.
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Legt einen Punkt im angegebenen Koordinatensystem mithilfe dreier kartesischer Koordinaten fest.
coordinateSystem: Übergeordnetes Koordinatensystem
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
Schneidet Punkte aus, um Duplikate im Toleranzbereich der einzubeziehenden Punkte auszuschließen.
points: Liste von Punkten, aus der Duplikate ausgeschnitten werden sollen
tolerance: Ausschneidetoleranz
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near