Autodesk.DesignScript.Geometry.Properties.Resources.LowerModelerExtentExceeded
Sucht eine lokalisierte Zeichenfolge ähnlich wie Ihre Eingaben liegen außerhalb des zulässigen Modellbereichs. Wählen Sie unter Einstellungen => Dialogfeld Arbeitsbereich für Geometrie die Einstellung {0} mit einem Modellbereich zwischen {1} und {2}.

Autodesk.DesignScript.Geometry.Properties.Resources.UpperModelerExtentExceeded
Sucht eine lokalisierte Zeichenfolge ähnlich wie Ihre Eingaben liegen außerhalb des zulässigen Modellbereichs. Wählen Sie unter Einstellungen => Dialogfeld Arbeitsbereich für Geometrie die Einstellung {0} mit einem Modellbereich zwischen {1} und {2}.