Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Erstellt ein BSplineCurve über explizite Steuerpunkte. Anmerkung 1: BSplineCurves mit Grad=1 weisen G1-Diskontinuitäten auf, die Probleme bei Extrusionen, Sweeps und anderen Vorgängen verursachen. Sie sollten daher vermieden werden. Verwenden Sie stattdessen eine PolyCurve. Anmerkung 2: Bei periodischen (geschlossenen) Kurven muss der letzte Punkt unbedingt mit dem ersten zusammenfallen.
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Erstellt ein BSplineCurve über explizite Steuerpunkte. Anmerkung 1: BSplineCurves mit Grad=1 weisen G1-Diskontinuitäten auf, die Probleme bei Extrusionen, Sweeps und anderen Vorgängen verursachen. Sie sollten daher vermieden werden. Verwenden Sie stattdessen eine PolyCurve. Anmerkung 2: Bei periodischen (geschlossenen) Kurven muss der letzte Punkt unbedingt mit dem ersten zusammenfallen.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Erstellt ein BSplineCurve über explizite Steuerpunkte. Anmerkung 1: BSplineCurves mit Grad=1 weisen G1-Diskontinuitäten auf, die Probleme bei Extrusionen, Sweeps und anderen Vorgängen verursachen. Sie sollten daher vermieden werden. Verwenden Sie stattdessen eine PolyCurve. Anmerkung 2: Bei periodischen (geschlossenen) Kurven muss der letzte Punkt unbedingt mit dem ersten zusammenfallen.
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Erstellt eine BSplineCurve durch Interpolation zwischen Punkten.
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Erstellt eine BSplineCurve durch Interpolation zwischen Punkten. Anmerkung 2: Bei periodischen (geschlossenen) Kurven muss der letzte Punkt unbedingt mit dem ersten zusammenfallen.
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Erstellt eine BSplineCurve durch Interpolation zwischen Punkten mit dem angegebenen Grad.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Gibt eine BSplineCurve durch die Punkte mit tangentialen Richtungen aus.
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
Die Knoten der Kurve. Knoten sind eine Reihe von Parameterwerten (doubles), die verwendet werden, um festzulegen, wo und wie die Kontrollpunkte sich auf die Kurve auswirken.
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
Gibt die Gewichtungen des NurbsCurve-Kontrollpunkts zurück. Gewichtungen bestimmen den Einfluss jedes Kontrollpunkts auf die Form der Kurve.
Returns: Weights of nurbs curve
ptweight