Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
Erstellt eine Kurve nach Linie auf Oberfläche im UV-Raum.
baseSurface: Zu verwendende Oberfläche
startParams: Start-UV für die Kurve
endParams: End-UV für die Kurve
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
Erstellt eine Kurve nach Isoline von Oberfläche.
baseSurface: Basisoberfläche
direction: Wenn 0-Isoline in U-Richtung, wenn 1 in V-Richtung
parameter: fest für Kurvenwert des anderen Oberflächenparameters
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Verbindet eine Gruppe von Kurven mit dem Ende der Polykurve. Kehrt Kurven um, um Verbindungen sicherzustellen.
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany