Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
Gibt die Anzahl der Oberflächen der Polyoberfläche zurück.
Returns: Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
Gibt die Anzahl der Kanten der Polyoberfläche zurück.
Returns: Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
Gibt die Anzahl der Scheitelpunkte der Polyoberfläche zurück.
Returns: Number of vertices