Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
Importiert eine SAT-Datei und gibt ein Array importierter Geometrien zurück
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
Importiert eine SAT-Datei, und gibt ein Array importierter Geometrien aus.
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Serialisiert eine Liste mit angegebener Geometrie im Standard-ACIS-Binärformat (SAB-Datei), und gibt serialisierte Binär-Stream-Daten zurück.
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes