Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Erstellt einen EllipseArc in einer Ebene mit den angegebenen Radien entlang der X- und Y-Achse und den Sweep-Winkeln.
plane: Ebene mit dem Ellipsenbogen
xRadius: Radius des EllipseArc in Richtung der X-Achse der Ebene
yRadius: Radius des EllipseArc in Richtung der Y-Achse der Ebene
startAngle: Startpunkt des Bogens, gemessen von der positiven X-Achse in der eingegebenen Ebene
sweepAngle: Der vom Startwinkel aus zu überstreichende Winkel in Grad
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs