Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Erstellt eine PolyCurve durch Verbinden von Punkten. Indem Sie für die 'connectLastToFirst'-Eingabe True festlegen, schließen Sie die PolyCurve.
points: Punkte zum Erstellen von PolyCurve
connectLastToFirst: True, um letzten Punkt mit erstem Punkt zu verbinden, false, um offenzulassen
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
Gibt die Kurve der Polykurve nach Index zurück.
index: Länge für Position des Punkts
endOrStart: True, um ab dem Ende der Polykurve zu zählen, false, um ab dem Start der Polykurve zu zählen
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
Versatz für Polykurve in ihrer Ebene
signedDistance: Angegebener Versatz
extendCircular: Umschalten, um Ecken kreisförmig zu gestalten
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Abrundung für Polykurve in ihrer Ebene
radius: Radius für Abrundung
rightSide: True für Abrundung auf der rechten Seite in Bezug auf den Start der Polykurve, false für Abrundung auf der linken Seite
Returns: Filleted polyCurve
round,smooth,radius