Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
获取两个 BoundingBox 的交点
other: 要相交的其他边界框
Returns: 基于边界框的相交获得的边界框

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
确定两个 BoundingBox 是否相交
other: 其他边界框
Returns: 边界框是否相交
get overlap