Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
通过使用明确的控制点创建 BSplineCurve。注意 1:  阶数为 1 的 BSplineCurve 具有 G1 不连续性，这会导致拉伸、扫掠和其他操作问题。这应该尽可能避免。使用 PolyCurve 替代。注意 2: 如果曲线具有周期性(闭合)， 则第一个点和最后一个点必须相同。
points: NURBS 曲线的点
Returns: 基于点创建的 NURBS 曲线
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
通过使用明确的控制点创建 BSplineCurve。注意 1:  阶数为 1 的 BSplineCurve 具有 G1 不连续性，这会导致拉伸、扫掠和其他操作问题。这应该尽可能避免。使用 PolyCurve 替代。注意 2: 如果曲线具有周期性(闭合)， 则第一个点和最后一个点必须相同。
points: NURBS 曲线的点
degree: 曲线的阶数
Returns: 基于点创建的 NURBS 曲线
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
通过使用明确的控制点创建 BSplineCurve。注意 1:  阶数为 1 的 BSplineCurve 具有 G1 不连续性，这会导致拉伸、扫掠和其他操作问题。这应该尽可能避免。使用 PolyCurve 替代。注意 2: 如果曲线具有周期性(闭合)， 则第一个点和最后一个点必须相同。
points: NURBS 曲线的点
degree: 曲线的阶数
closeCurve: 切换为闭合曲线
Returns: 基于点创建的 NURBS 曲线
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
通过在各点之间插值创建 BSplineCurve。注意 2: 如果曲线具有周期性(闭合)，则第一个点和最后一个点必须相同。
points: NURBS 曲线的点
closeCurve: 切换为闭合曲线
Returns: 基于点创建的 NURBS 曲线
fit,approximate,spline,lines
0.5,0.5,0.5,0.45