Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
创建与输入曲线相切的直线，定位于输入曲线的参数点处。
curve: 切线的基准曲线
parameter: 参数值
Returns: 切线
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
从起点开始创建直线，朝向量方向延伸指定长度。
startPoint: 线起点
direction: 方向向量
length: 线的长度
Returns: 基于起始方向和长度的线
linebyvector,lines