Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
创建具有指定插入点以及 U 和 V 阶数的 NurbsSurface。生成的曲面将通过所有的点。
points: NURBS 曲面的点网格
uDegree: U 方向的阶数
vDegree: V 方向的阶数
Returns: 由点创建的 NURBS 曲面
fit,topoints