Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
以输入点为中心使用特定宽度、长度和高度创建立方体。
origin: 原点
width: 长方体的宽度
length: 长方体的长度
height: 长方体的高度
Returns: 由长度创建的长方体
box,cube,cubebysize,bycenter,cubes