Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
在 WCS 的 XY 平面上以 WCS 原点为中心按指定宽度 (X 轴长度)和长度 (Y 轴长度)创建矩形。
width: 矩形的宽度
length: 矩形的长度
Returns: 由宽度和长度创建的矩形
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
以输入平面原点为中心按输入宽度(平面 X 轴长度)和长度(平面 Y 轴长度)创建矩形。
plane: 用于使矩形居中的平面
width: 矩形的宽度
length: 矩形的长度
Returns: 由宽度和长度创建的矩形
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
以 CoordinateSystem XY 平面上的输入原点为中心按指定宽度 (X 轴长度)和长度 (Y 轴长度)创建矩形。
coordinateSystem: 矩形的坐标系(矩形中心)
width: 矩形的宽度
length: 矩形的长度
Returns: 基于宽度和长度创建的矩形
rectbylengths