Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
从起点到终点创建圆弧，且起点与向量相切
startPoint: 圆弧的起点
endPoint: 圆弧的终点
startTangent: 起点切线方向向量
arc,tangent,arcs