Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
通过对连接的曲线进行分组，从而生成一条或多条复合线。选择一个介于 1e-6 和 1e-3 单位之间的首选连接公差。
curves: 分组在一起以创建一条或多条复合线的曲线
joinTolerance: 确定要连接的曲线之间允许的间隙尺寸的公差

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
在其平面给复合线倒圆角。
radius: 圆角半径
rightSide: True 表示对右侧倒圆角(相对于复合线的起点)；False 表示对左侧倒圆角
Returns: 圆角的复合线
round,smooth,radius