Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
根据形状，将 T 样条曲线曲面转换为实体或曲面。
注意: 如果创建输入曲面所用的 T 样条曲线版本高于 Dynamo 中加载的版本，则生成的边界表示可能会略有意外变化；因为在这种情况下，相应曲面的副本会降级到 Dynamo 版本并在转换时使用。
matchTopology: 确定生成的实体是否应具有与输入 T 样条曲线曲面相同的拓扑。
Returns: 拓扑实体(实体或曲面)
tspline,brep,solid,surface