Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
对齐 WCS XY 平面以输入点为中心按指定 X 和 Y 轴半径创建椭圆。
origin: 椭圆的原点
xAxisRadius: X 轴半径
yAxisRadius: Y 轴半径
Returns: 由原点和半径创建的椭圆
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
以输入点为中心通过两个指定轴创建椭圆，两轴应相互垂直。
origin: 椭圆的原点
xAxisRadius: X 轴半径
yAxisRadius: Y 轴半径
Returns: 基于原点向量创建的椭圆
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
对中并对齐输入 CoordinateSystem 按 CS X 轴方向的 x_radius 半径和 CS Y 轴方向的 y_radius 半径创建椭圆。
origin: 椭圆的原点坐标系
xAxisRadius: X 轴半径
yAxisRadius: Y 轴半径
Returns: 由坐标系和半径创建的椭圆
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
对中并对齐输入坐标系按平面 X 轴方向的 x_radius 半径和平面 Y 轴方向的 y_radius 半径创建椭圆。
plane: 绘制椭圆弧的平面
xAxisRadius: X 轴半径
yAxisRadius: Y 轴半径
Returns: 基于平面和半径创建的椭圆
ellipse,aligned ellipse,ellipsebylengths