Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
以世界坐标系 Z 轴为法线通过在世界坐标系 XY 平面输入圆心和半径创建圆。
centerPoint: 圆的圆心
radius: 半径
Returns: 使用圆心和半径创建的圆
circle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
在输入平面内以输入平面原点为圆心按给定半径创建圆。
plane: 用于使圆居中的平面原点
radius: 半径
Returns: 使用平面和半径创建的圆
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
通过三个输入点创建圆。
p1: 圆的第一点
p2: 圆的第二点
p3: 圆的第三点
circle