Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
通过在输入横截面曲线之间放样来创建实体。
crossSections: 要通过其放样的曲线
Returns: 由放样创建的曲面
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
使用多条指定导向曲线(也称为轨线)通过横截面放样曲面。各导向曲线必须与所有横截面曲线相交。
crossSections: 要通过其放样的曲线
guideCurves: 要通过其引导放样的曲线
Returns: 由放样创建的曲面
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
通过沿路径扫掠横截面曲线创建曲面。
profile: 要扫掠的曲线
path: 用于沿其扫掠的路径曲线
Returns: 通过沿路径扫掠轮廓创建的曲面
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
创建多边形曲面，连接闭合多边形内的输入点并修补。
points: 周界点列表
Returns: 基于周界点创建的曲面
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
绕由原点形成的轴向量方向的轴射线扫掠轮廓曲线，从起点角(度)起，扫掠掠角(度)，创建曲面。
profile: 要旋转的轮廓曲线
axisOrigin: 旋转轴原点
axisDirection: 旋转轴方向
startAngle: 起始角度(以度为单位)
sweepAngle: 扫掠角度(以度为单位)
Returns: 通过旋转轮廓创建的曲面
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
通过在由输入曲线确定的闭合边界内填充来创建曲面。
closedCurve: 用作曲面边界的闭合曲线
Returns: 由面片创建的曲面
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
在指定公差范围内获取曲面的 NURBS 表示。在某些情况该方法可粗略逼近曲面。
tolerance: 指定的公差
Returns: 曲面的 NURBS 曲面表示
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
加厚曲面到实体，朝曲面法线方向在曲面两侧进行拉伸。
thickness: 加厚量
Returns: 加厚曲面作为实体
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
加厚曲面到实体，朝曲面法线方向拉伸。如果 both_sides (两侧)参数为“True”，则在两侧加厚曲面。
thickness: 加厚量
both_sides: 为 true 时，两侧加厚；为 false 时，一侧加厚
Returns: 加厚曲面作为实体
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
返回的坐标系统使用 xAxis、yAxis 和 zAxis 表示 uDir、vDir 和法线。xAxis 和 yAxis 长度表示曲率。
u: 参数的 U 分量
v: 参数的 V 分量
Returns: 基于曲面上 UV 位置处的法线、U 方向和 V 方向的坐标系

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
返回法线翻转的新曲面。保留该曲面不变。
Returns: 与输入曲面相同但法线翻转的曲面