Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
绕由原点和轴向量形成的轴射线扫掠轮廓曲线，从起点角(度)到掠角(度)，创建旋转实体。
profile: 要旋转的轮廓曲线
axisOrigin: 旋转轴原点
axisDirection: 旋转轴方向
startAngle: 起始角度(以度为单位)
sweepAngle: 扫掠角度(以度为单位)
Returns: 由旋转创建的实体
Brep,brep,lathe,revolveprofile