Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
创建螺旋线。螺旋线始终相对所提供的轴方向顺时针旋转。如果沿轴方向查看，会看到在点沿曲线朝参数不断增加的方向移动时会绕轴顺时针旋转。螺距为螺旋线每转一圈的轴向移动距离，可以是正值或负值。
axisPoint: 轴点
axisDirection: 轴方向向量
startPoint: 螺旋起点
pitch: 轴方向上每 360 度螺旋的距离
angleTurns: 圈数(以度为单位)
Returns: 由轴创建的螺旋
helix,screw,corkscrew,thread