Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
由 3 个欧几里得坐标形成一个向量
x: X 轴坐标
y: Y 轴坐标
z: Z 轴坐标
Returns: 由坐标创建的向量
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
由 3 个欧几里得坐标形成一个向量并使向量规范化
x: X 轴坐标
y: Y 轴坐标
z: Z 轴坐标
normalized: True 表示对向量规格化；False 表示不规格化
Returns: 由坐标创建的向量
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
形成两个向量的点积
vec: 第二个向量
Returns: 结果点积
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
确定两个向量是否平行。
otherVector: 其他向量
Returns: 如果向量平行，则返回 True；否则返回 False。

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
确定两个向量是否几乎相等。为处理精度问题提供了 1e-5 的公差值。
otherVector: 其他向量
Returns: 如果向量几乎相等，则返回 True；否则返回 False。
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
通过输入 CoordinateSystem 矩阵变换该向量。
coordinateSystem: 变换向量所用的坐标系
Returns: 变换的向量

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
绕轴按指定度数旋转向量
axis: 旋转轴向量
degrees: 要旋转的度数
Returns: 旋转的向量
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
绕平面原点和法线按指定度数旋转向量
plane: 旋转平面
degrees: 要旋转的度数
Returns: 旋转的向量
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
绕原点等比例缩放向量
scale_factor: 比例因子
Returns: 缩放的向量
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
返回两个向量之间的角度(以度为单位，从 0 到 360)。它使用旋转轴来确定角度方向。
otherVector: 其他向量
rotationAxis: 旋转轴
Returns: 返回提供的向量之间的角度(以度为单位，范围从 0 到 360)
rotation angle,