Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
创建“定向”平面，定位于原点及向量法线，但使用特定 X 轴方向。这不会影响拆分、相交和投影等操作，它仅指定输入坐标系的方向。
origin: 平面的原点
normal: 法线方向向量
xAxis: X 轴方向向量
Returns: 由原点法线和 X 轴创建的平面

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
X 和 Y 轴位于此平面内。Z 轴为两个向量的矢积。
origin: 平面的原点
xAxis: 平面的 X 轴方向向量
yAxis: 平面的 Y 轴方向向量
Returns: 由原点 X 轴和 Y 轴创建的平面

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
创建包含输入线和外部点的平面，点不能位于此输入线或输入线轴线上。
line: 用于确定平面的线
point: 用于确定平面的点
Returns: 基于线和点创建的平面
lines
0.4