Autodesk.DesignScript.Geometry.Helix.ToString
取得 Helix 的字串表現法

Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
建立螺旋線。螺旋總是依據提供的軸方向順時鐘旋轉。如果沿軸方向檢視，檢視器將看到點圍繞軸順時鐘旋轉，同時沿著曲線依遞增參數的方向移動。節距是螺旋線每次旋轉時依軸方向移動的距離。這可以是正值或負值。
axisPoint: 軸點
axisDirection: 軸方向向量
startPoint: 螺旋線起點
pitch: 沿著軸方向每 360 度的螺旋線距離
angleTurns: 旋轉次數 (以度表示)
Returns: 透過軸建立的螺旋線
helix,screw,corkscrew,thread