Autodesk.DesignScript.Geometry.Circle.ToString
取得 Circle 的字串表現法

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
使用輸入中心點和世界 XY 平面中的半徑，並以世界 Z 為法線，來建立一個圓。
centerPoint: 圓的中心點
radius: 半徑
Returns: 以中心點和半徑建立的圓
circle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
使用給定的半徑建立一個圓，中心在輸入平面原點 (根)，位於輸入平面。
plane: 用來置中圓的平面根
radius: 半徑
Returns: 以平面和半徑建立的圓
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
透過三個輸入點建立一個圓。
p1: 圓的第一點
p2: 圓的第二點
p3: 圓的第三點
circle