Autodesk.DesignScript.Geometry.NurbsSurface.ToString
取得 NurbsSurface 的字串表現法

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
利用指定的內插點以及 U 和 V 度，建立一個 NurbsSurface。產生的曲面將通過所有點。
points: NURBS 曲面的點格線
uDegree: u 方向的度數
vDegree: v 方向的度數
Returns: 透過點建立的 NURBS 曲面
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
利用指定的內插點以及 U 和 V 度，建立一個 NurbsSurface。產生的曲面將通過所有點。切線數必須符合對應方向中的點數。 產生的曲面將為 U 方向和 V 方向中的 3 度。
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
建立一個 NurbsSurface，滿足不同曲面特性的集合。這是最進階的曲面擬合方式。產生的曲面將通過所有點。切線數必須符合對應方向的點數。產生的曲面在 U 方向和 V 方向都是 3 度。角點導數應該是二階 (dP/dUdV)，且應該依此順序 [ lowU, lowV ]、[ highU, lowV ]、[ lowU, highV ]、[ highU, highV ] 提供。
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
使用明確的控制點，以及指定的 U 和 V 度，來建立一個 NurbsSurface。
controlVertices: NURBS 曲面的控制點格線
uDegree: u 方向的度數
vDegree: v 方向的度數
Returns: 透過控制點建立的 NURBS 曲面

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
使用指定的控制向量、節點、權重和 U V 度，來建立一個 NurbsSurface。對於資料有數個限制，如果違反，將導致函數失敗並擲例外。 度數：u- 和 v- 度數應該 >= 1 (分段線性雲形線)，且小於 26 (ASM 支援的最大 B- 雲形線基礎度 )。權重: 所有權重值 (如果提供) 應該為絕對正數。權重若小於 1e-11，將遭到拒絕，而且函數將失敗。節點：兩個節點向量應該為非遞減順序。內部節點多重性不應該大於開始/結束節點中的度數和內部節點中的度數 + 1 (這允許曲面以 G1 不連續性表示)。請注意，支援非鎖模節點向量，但是將轉換為鎖模的節點向量，而且對應變更會套用至控制點/權重資料。
lines
0.4

Autodesk.DesignScript.Geometry.NurbsSurface.DegreeU
傳回 U 方向的曲面度數。
surface smoothness,continuity

Autodesk.DesignScript.Geometry.NurbsSurface.DegreeV
傳回 V 方向的曲面度數。
surface smoothness,continuity