Autodesk.DesignScript.Geometry.Solid.ToString
取得 Solid 的字串表現法

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
利用導引曲線的協助，透過輸入斷面封閉曲線之間的斷面混成來建立實體。導引曲線必須與所有斷面曲線相交。
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
利用導引曲線的協助，透過輸入斷面封閉曲線之間的斷面混成來建立實體。導引曲線必須與所有斷面曲線相交。
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
透過在由封閉 PolyCurve 組成的輸入斷面之間斷面混成來建立實體。此作業已針對完全由線段組成的剖面進行最佳化，頂點都依照相同順序。如果啟用檢查和修復選項，可保證所產生實體的有效性，如果停用則會提高效能。
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
從起始角度 (以度表示) 到掃掠角度 (以度表示)，繞著由原點和「向量」軸形成的「放射線」軸掃掠「曲線」輪廓，建立旋轉的實體。
profile: 要迴轉的輪廓曲線
axisOrigin: 迴轉軸原點
axisDirection: 迴轉軸方向
startAngle: 起始角度 (以度為單位)
sweepAngle: 掃掠角度 (以度表示)
Returns: 透過迴轉建立的實體
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
聯集實體清單與這個實體。
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
這個實體與另一個實體的布林差

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
從這個實體的面取得實體薄殼
internalFaceThickness: 向內延伸薄殼的距離
externalFaceThickness: 向外延伸薄殼的距離
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
依輸入向量的方向將輸入幾何圖形投影到這個實體。此投影方法目前只支援點或曲線。
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
將一個實體分開成幾個個別的實體 (如果該實體是由多個不相交的隆起組成)。如果該實體是單一連續的隆起，則傳回同一個實體。
Returns: 將不相交的實體分開
split,disjoint