Autodesk.DesignScript.Geometry.Rectangle.ToString
取得 Rectangle 的字串表現法

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
使用指定的寬度 (X 軸長度) 和長度 (Y 軸長度)，建立中心在 WCS XY 平面中之 WCS 原點的矩形。
width: 矩形的寬度
length: 矩形的長度
Returns: 透過寬度和長度建立的矩形
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
使用輸入寬度 (平面 X 軸長度) 和長度 (平面 Y 軸長度)，建立中心在輸入平面根的矩形。
plane: 用來置中矩形的平面
width: 矩形的寬度
length: 矩形的長度
Returns: 透過寬度和長度建立的矩形
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
使用指定的寬度 (X 軸長度) 和長度 (Y 軸長度)，建立中心在 CoordinateSystem XY 平面之輸入原點的矩形。
coordinateSystem: 矩形 (矩形中心) 的座標系統
width: 矩形的寬度
length: 矩形的長度
Returns: 從寬度和長度建立的矩形
rectbylengths