Autodesk.DesignScript.Geometry.Line.ToString
取得 Line 的字串表現法

Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
建立一條相切於輸入曲線的線，置於輸入曲線的參數點。
curve: 切線的基準曲線
parameter: 參數值
Returns: 切線
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
建立開始於起點的直線，依向量方向延伸指定的長度。
startPoint: 線起點
direction: 方向向量
length: 線長
Returns: 從起始方向和長度建立的線
linebyvector,lines