Autodesk.DesignScript.Geometry.BoundingBox.ToString
取得 BoundingBox 的字串表現法

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
比較兩個邊界框
other: 其他邊界框
Returns: 兩個物件是否相等

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
取得此類型的雜湊碼
Returns: 此物件的唯一雜湊碼

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
建立一個圍繞輸入幾何圖形並與軸對齊的 BoundingBox。
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
建立一個圍繞輸入幾何圖形並與軸對齊的 BoundingBox，定位在 CoordinateSystem 的 X、Y 和 Z 軸。
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
建立一個圍繞輸入幾何圖形並與軸對齊的 BoundingBox，定位在 CoordinateSystem 的 X、Y 和 Z 軸。
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
建構一個從最小座標 (方塊的左下角) 到最大座標 (方塊右上角) 的 BoundingBox。CoordinateSystem 是從方塊的座標空間轉換為模型空間。此方法是設計來符合 Revit 的 API，允許您從 Revit BoundingBox 萃取參數，而無需任何轉換。
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
定義此 BoundingBox 的 CoordinateSystem

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
取得兩個 BoundingBox 的交集
other: 要相交的其他邊界框
Returns: 從邊界框的交點取得的邊界框

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
判定兩個 BoundingBox 是否相交
other: 其他邊界框
Returns: 邊界框是否相交
get overlap