Autodesk.DesignScript.Geometry.Ellipse.ToString
取得 Ellipse 的字串表現法

Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
建立一個橢圓的中心位置輸入點，對齊與 WCS 的 XY 平面上，指定 X 和 Y 軸的半徑。
origin: 橢圓的原點
xAxisRadius: X 軸半徑
yAxisRadius: Y 軸半徑
Returns: 透過原點和半徑建立的橢圓
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
使用兩個指定軸，建立一個中心在輸入點的橢圓。軸彼此應該 90 度。
origin: 橢圓的原點
xAxisRadius: X 軸半徑
yAxisRadius: Y 軸半徑
Returns: 從原點向量建立的橢圓
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
使用 CS X 方向中的 x_radius 半徑，以及 CS Y 方向中的 y_radius 半徑，建立一個置中並與 CoordinateSystem 對齊的橢圓。
origin: 橢圓的原點座標系統
xAxisRadius: X 軸半徑
yAxisRadius: Y 軸半徑
Returns: 透過座標系統和半徑建立的橢圓
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
使用平面 X 軸方向中的 x_radius 半徑，以及平面 Y 軸方向中的 y_radius 半徑，建立一個置中並與輸入平面對齊的橢圓。
plane: 繪製橢圓弧的平面
xAxisRadius: X 軸半徑
yAxisRadius: Y 軸半徑
Returns: 從平面和半徑建立的橢圓
ellipse,aligned ellipse,ellipsebylengths