Autodesk.DesignScript.Geometry.Vector.ToString
取得 Vector 的字串表現法

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
比較兩個向量
other: 其他向量
Returns: 兩個物件是否相等

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
取得此類型的雜湊碼
Returns: 此物件的唯一雜湊碼

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
由 3 個歐幾里得座標形成一個向量
x: X 座標
y: Y 座標
z: Z 座標
Returns: 透過座標建立的向量
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
由 3 個歐幾里得座標形成一個向量，並將向量正常化
x: X 座標
y: Y 座標
z: Z 座標
normalized: true 正規化向量，false 不要正規化
Returns: 透過座標建立的向量
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
由兩個端點形成一個向量。結果是一個從起點到終點的向量。
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
取得標準 X 軸向量 (1,0,0)
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
取得標準 Y 軸向量 (0,1,0)
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
取得標準 Z 軸向量 (0,0,1)
z,basis,up

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
形成兩個向量的點乘積
vec: 第二個向量
Returns: 產生的點乘積
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
判定兩個向量是否平行。
otherVector: 其他向量
Returns: 如果向量平行，則傳回 true；否則傳回 false。

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
判定兩個向量是否幾乎相等。給定 1e-5 的公差值來處理精確度問題。
otherVector: 其他向量
Returns: 如果向量幾乎相等，則傳回 true；否則傳回 false。
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
藉由輸入 CoordinateSystem 矩陣來轉換此向量。
coordinateSystem: 用來轉換向量的座標系統
Returns: 平移後的向量

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
繞著軸線將向量旋轉指定的度數
axis: 旋轉軸向量
degrees: 要旋轉的度數
Returns: 旋轉後的向量
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
繞著平面原點與法線，將向量旋轉指定的度數
plane: 旋轉平面
degrees: 要旋轉的度數
Returns: 旋轉後的向量
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
等比例繞著原點的比例向量
scale_factor: 比例係數
Returns: 調整比例過的向量
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
傳回兩個向量之間的夾角，範圍為 [0, 180] 度。
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
傳回兩個向量之間的夾角，範圍從 0 到 360 度。它使用旋轉軸來決定角度的方向。
otherVector: 其他向量
rotationAxis: 旋轉軸
Returns: 傳回提供的向量之間的角度 (以 0 到 360 的度數表示)
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
傳回兩個向量之間的夾角，範圍為 [0, 360] 度。它使用旋轉軸來確定角度的方向。
rotation angle