Autodesk.DesignScript.Geometry.Cone.ToString
取得 Cone 的字串表現法

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
建立一個圓錐，其半徑為起點算起的給定基準半徑，延伸至終點的頂點。
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
建立一個圓錐，其軸從起點到終點，半徑為從起點和終點算起的給定半徑。 這個物件沒有頂點，並可以視為一個修剪的圓錐。
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
建立一個圓錐，其基準點位於 CoordinateSystem 原點，依 CoordinateSystem Z 軸方向長度量延伸，圓形底面位於 CoordinateSystem XY 平面。

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
建立一個圓錐，其基準點位於 CoordinateSystem 原點，依 CoordinateSystem Z 軸方向長度量延伸，圓形底面位於 CoordinateSystem XY 平面。
cone,cone by height,cones