Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
取得 TSplineReflection 的字串表現法

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByAxial(Autodesk.DesignScript.Geometry.Plane)
建立指定平面對 T 雲形線對稱的軸向反射。
plane: T 雲形線軸向反射的平面。在世界座標系統中指定
Returns: T 雲形線軸向反射
tspline,symmetry,reflection,axial

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
建立指定平面對 T 雲形線對稱的徑向反射，每對段之間具有指定的段計數與指定的角度 (以度為單位)。
plane: 法線是 T 雲形線徑向反射軸的平面。在世界座標系統中指定
segmentsCount: 徑向反射段的數量
segmentAngle: 徑向對稱的每對段之間的角度 (以度為單位)。若設為 0，則由 (360/segmentsCount) 定義
Returns: T 雲形線徑向反射
tspline,symmetry,reflection,radial