Autodesk.DesignScript.Geometry.NurbsCurve.ToString
取得 NurbsCurve 的字串表現法

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
使用明確的控制點建立 BSplineCurve。 附註 1：BSplineCurves 與 deg = 1 有 G1 不連續性，這會導致擠出、掃掠和其他作業發生問題。應該避免它們。請改用 PolyCurve。附註 2：如果曲線是週期性 (封閉)，則第一個點和最後一個點必須相同。
points: NURBS 曲線的點
Returns: 從點建立的 Nurbscurve
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
使用明確的控制點建立 BSplineCurve。 附註 1：BSplineCurves 與 deg = 1 有 G1 不連續性，這會導致擠出、掃掠和其他作業發生問題。應該避免它們。請改用 PolyCurve。附註 2：如果曲線是週期性 (封閉)，則第一個點和最後一個點必須相同。
points: NURBS 曲線的點
degree: 曲線的度數
Returns: 從點建立的 Nurbscurve
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
使用明確的控制點建立 BSplineCurve。 附註 1：BSplineCurves 與 deg = 1 有 G1 不連續性，這會導致擠出、掃掠和其他作業發生問題。應該避免它們。請改用 PolyCurve。附註 2：如果曲線是週期性 (封閉)，則第一個點和最後一個點必須相同.
points: NURBS 曲線的點
degree: 曲線的度數
closeCurve: 切換以封閉曲線
Returns: 從點建立的 Nurbscurve
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
從控制頂點、權重和節點建立 BSplineCurve。從 ASM 文件：度數：應大於 1 (分段線性雲形線) 且小於 26 (ASM 支援的最大 B- 雲形線基準度)。權重: 所有權重值 (如果提供) 應該為絕對正數。權重若小於 1e-11，將遭到拒絕，而且函數將失敗。節點：兩個節點向量應該為非遞減順序。內部節點多重性不應該大於開始/結束節點中的度數 + 1 和內部節點中的度數 (這允許曲面以 G1 不連續性表示)。請注意，支援非鎖模節點向量，但是將轉換為鎖模的節點向量，而且對應變更會套用至控制點/權重資料。節點陣列: 陣列大小必須是 num_control_points + 度數 + 1
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
透過點之間的內插來建立 BSplineCurve。附註 2：如果曲線是週期性 (封閉)，則在第一個點和最後一個點必須相同。
points: NURBS 曲線的點
closeCurve: 切換以封閉曲線
Returns: 從點建立的 Nurbscurve
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
透過點之間的內插，並使用指定的度數來建立 BSplineCurve。
points: NURBS 曲線的點
degree: 曲線的度數
Returns: 從點建立的 Nurbscurve
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.Degree
曲線的度數
smoothness,interpolation,continuity

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
取得 NurbsCurve 的控制點。這些是曲線內插的點。
Returns: 點陣列