Autodesk.DesignScript.Geometry.Edge.ToString
取得 Edge 的字串表現法

Autodesk.DesignScript.Geometry.Edge.CurveGeometry
組成邊的基本曲面

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
與此邊相鄰的面

Autodesk.DesignScript.Geometry.Edge.StartVertex
此邊開始的頂點

Autodesk.DesignScript.Geometry.Edge.EndVertex
此邊結束的頂點