Autodesk.DesignScript.Geometry.Plane.ToString
取得 Plane 的字串表現法

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
建立「定向」的平面，位於具有向量法線但具有特定 X 軸方位的點原點。這不會影響到分割、相交、投影等作業，僅會指定輸入 CoordinateSystem 的方位。
origin: 平面的原點
normal: 法線方向向量
xAxis: X 軸方向向量
Returns: 透過原點法線和 x 軸建立的平面

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
建立包含輸入線和外部點的平面。 點無法位於線上或位於線軸中。
line: 用來決定平面的線
point: 用來決定平面的點
Returns: 從線和點建立的平面
lines
0.4

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
產生新的 CoordinateSystem，表示此平面。 它是根據原點，並以 X 軸和 Y 軸為基礎。
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
依法線方向透過指定的距離建立此平面的新平面偏移。
alongnormal,moveplane