Autodesk.DesignScript.Geometry.Arc.ToString
取得 Arc 的字串表現法

Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
透過起點和終點，以及起點和終點的切線，來建立一個弧或切線 BI 弧
point1: 雙弧起始的點
vector1: 雙弧起點的切線向量
point2: 雙弧結束的點
vector2: 雙弧終點的切線向量
arc,tangent

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
使用向量的起始切線，建立一個從起點到終點的弧
startPoint: 弧的起點
endPoint: 弧的終點
startTangent: 起始切線方向向量
arc,tangent,arcs