Autodesk.DesignScript.Geometry.Surface.ToString
取得 Surface 的字串表現法

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
將曲面的集合聯集成一個曲面。如果產生的聯集是非流形或多面，此方法可能會傳回 polySurface。
surfaces: 曲面的集合。
Returns: 曲面的聯集
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
透過輸入斷面曲線之間的斷面混成來建立曲面。
crossSections: 斷面混成要穿過的曲線
Returns: 透過斷面混成建立的曲面
loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
透過輸入斷面直線之間的斷面混成來建立曲面。此動作速度稍快，並產生比 Surface.ByLoft 更不平滑的結果。
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
透過斷面與指定的導引曲線 (也稱為軌道) 來斷面混成曲面。導引曲線必須與所有斷面曲線相交。
loftbyrail

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
透過斷面與指定的導引曲線 (也稱為軌跡) 來斷面混成曲面。導引曲線必須與所有斷面曲線相交。
crossSections: 斷面混成要穿過的曲線
guideCurves: 要導引斷面混成穿過的曲線
Returns: 透過斷面混成建立的曲面
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
沿著路徑掃掠斷面來建立曲面。
profile: 要掃掠的曲線
path: 用來沿著其掃掠的路徑曲線
Returns: 透過沿路徑掃掠輪廓建立的曲面
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
連接封閉多邊形中的輸入點並修補它，來建立多邊形曲面。
points: 周長點的清單
Returns: 從周長點建立的曲面
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
繞著原點形成的軸線依軸向量的方向，掃掠輪廓曲線來建立曲面，開始於 start_angle (以度表示)，掃掠 sweep_angle (以度表示)。
profile: 要迴轉的輪廓曲線
axisOrigin: 迴轉軸原點
axisDirection: 迴轉軸方向
startAngle: 起始角度 (以度為單位)
sweepAngle: 掃掠角度 (以度表示)
Returns: 透過迴轉輪廓建立的曲面
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
透過填滿輸入曲線所定義之封閉邊界的內部來建立曲面。
closedCurve: 用作曲面邊界的封閉曲線
Returns: 透過修補建立的曲面
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
這個曲面與輸入曲面聯集的布林差。如果產生的布林是非流形或多面，此方法可能會傳回 polySurface。
others: 要減去的其他曲面
Returns: 產生的布林曲面或 polySurface
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
利用輸入曲面內的一或多個迴路集合來修剪曲面。其中一個迴路必須是輸入曲面的邊界迴路。此外，還必須加入一或多個內部迴路當作孔。
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
取得曲面的 NURBS 表現法。 在某些情況下，此方法可能近似曲面。

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
取得指定公差內曲面的 NURBS 表現法。 在某些情況下，此方法可能近似曲面。
tolerance: 指定的公差
Returns: 曲面的 NURBS 曲面表現法
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
將曲面增厚為實體，依曲面兩側上曲面法線的方向擠出。
thickness: 要增厚的量
Returns: 增厚成為實體的曲面
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
將曲面增厚為實體，依曲面法線的方向擠出。如果 both_sides 參數為 True，則曲面兩側都會增厚。
thickness: 要增厚的量
both_sides: true 在兩側增厚，false 在一側增厚
Returns: 增厚成為實體的曲面
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
傳回的座標系統使用 xAxis、yAxis 和 zAxis 表示 uDir、vDir 和法線。 xAxis、yAxis 和 zAxis 的長度表示曲率。
u: 參數的 U 分量
v: 參數的 V 分量
Returns: 根據曲面上 UV 位置的法線、U 方向和 V 方向的座標系統

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
在給定的曲面上建立參數線曲線。建立曲線，表示曲面上的 U 或 V 參數線。 參數線執行的方向，會以固定的相反 U 或 V 參數增加 U 或 V 參數。 產生的曲線將符合曲面參數化，而且其範圍將由曲面參數範圍限定。 傳回的曲線類型取決於曲線類型。
isoDirection: 如果方向 == 0，建立一個 U 參數線，如果方向 == 1，建立 V 參數線。
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
傳回法線翻轉的新曲面。 將此曲面保持不變。
Returns: 曲面，與輸入曲面相同，但法線翻轉

Autodesk.DesignScript.Geometry.Surface.Join(Autodesk.DesignScript.Geometry.Surface)
將此曲面與輸入曲面結合成 polySurface
topolysurface

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
將此曲面與輸入曲面結合成 polySurface
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
依輸入向量的方向將輸入幾何圖形投影到這個曲面。此投影方法目前只支援點或曲線。
projecttosurface,projectonto