Autodesk.DesignScript.Geometry.UV.ToString
取得 UV 的字串表現法

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
比較兩個 UV
other: 其他 UV
Returns: 兩個物件是否相等

Autodesk.DesignScript.Geometry.UV.GetHashCode
取得此類型的雜湊碼
Returns: 此物件的唯一雜湊碼