Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
取得 TSplineTopology 的字串表現法

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
傳回指定索引處的頂點
index: 編列索引以取得以下位置的頂點
Returns: T 雲形線頂點
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
傳回指定索引處的邊
index: 編列索引以取得以下位置的邊
Returns: T 雲形線邊
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
傳回指定索引處的面
index: 編列索引以取得以下位置的面
Returns: T 雲形線面
tspline,face,byindex