Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
幾何圖形類型登錄機制。
hostType: IGeometryEntity 衍生介面的類型。
contructor: 建構幾何圖形的委派。

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
依指定方向透過向量長度轉換幾何圖形
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
依給定方向透過給定距離來轉換任何幾何圖形類型。
direction: 位移方向。
distance: 沿著指定方向的位移距離。
Returns: 已轉換的幾何圖形。
move,along vector,distance

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
透過給定的 CoordinateSystem 轉換來轉換幾何圖形
Returns: 轉換過的幾何圖形

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
將此幾何圖形從來源 CoordinateSystem 轉換為新的關聯 CoordinateSystem。
Returns: 已轉換的幾何圖形。
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
繞著原點與軸線，將物件旋轉指定的度數
around,axis,degrees

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
繞著平面原點與法線，將物件旋轉指定的度數
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
繞著原點非等比例調整
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
繞著給定平面非等比例調整
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
使用兩個點選點做為純量，繞著給定點等比例調整
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
透過基準點和 2 個點選點單向調整比例。比例軸是由基準點和起點之間的直線定義。
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
透過基準點和 2 個點選點雙向調整比例。兩個點選點會投影至基準平面，以便判定 2D 比例係數
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
取得這個幾何圖形到另一個幾何圖形的距離
other: 其他幾何圖形
Returns: 距離
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
取得這個幾何圖形上距離其他幾何圖形最近的點
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
判定另一個幾何圖形物件是否與這個幾何圖形物件交叉
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
取得這個物件與另一個物件的交叉幾何圖形
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
取得這個物件與其他幾何圖形集合的交叉幾何圖形。尋找所有參與者的共用幾何圖形。
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
使用另一個幾何圖形做為切割「工具」，來分割這個幾何圖形
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
檢查兩個物件是否具有相同的表現法幾何圖形或數值
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
取得 BoundingBox，其中包含給定的幾何圖形片段
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
將幾何圖形轉換為實體定義 json
Returns: Json 格式化的字串

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
將指定的幾何圖形匯出至給定的 SAT 檔案路徑
filePath: 要將幾何圖形匯出至其中的檔案名稱

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
將指定的幾何圖形匯出至給定的 SAT 檔案路徑
filePath: 要將幾何圖形匯出至其中的檔案名稱
unitsMM: 要使用的單位

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String,System.Double)
將指定的幾何圖形清單匯出至給定的 SAT 檔案路徑

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
將指定的幾何圖形串列化為標準 ACIS 二進位 (SAB) 格式，然後傳回已串列化的二進位串流資料

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
取得用來建立此幾何圖形的關聯/參考座標系統。