Autodesk.DesignScript.Geometry.Sphere.ToString
取得 Sphere 的字串表現法

Autodesk.DesignScript.Geometry.Sphere.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
使用給定的半徑建立中心在輸入點的實體圓球。
Brep,brep