Autodesk.DesignScript.Geometry.PolyCurve.ToString
取得 PolyCurve 的字串表現法

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
透過接合曲線製作 PolyCurve。請視需要翻轉曲線以進行連接。在 1e-6 與 1e-3 個單位之間選擇您偏好的接合公差。
curves: 接合至 polycurve 的曲線
joinTolerance: 決定要接合的曲線之間所允許的間隙大小的公差
Returns: 透過接合的曲線建立的 PolyCurve
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
透過群組連接的曲線來製作一條或多條 PolyCurve。在 1e-6 和 1e-3 單位之間選擇一個偏好的接合公差。
curves: 要群組在一起以建立一條或多條 PolyCurves 的曲線
joinTolerance: 決定要接合的曲線之間所允許的間隙大小的公差

Autodesk.DesignScript.Geometry.PolyCurve.Curves
傳回 polycurve 的曲線
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
透過切弧延伸 polycurve
length: 延伸弧的長度
radius: 弧的半徑
endOrStart: 延伸 PolyCurve 的終點或起點

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
將其平面中的 polycurve 變成圓角。
radius: 圓角半徑
rightSide: true 將相對於 PolyCurve 起點的右側設為圓角，false 將左側設為圓角
Returns: 圓角的 PolyCurve
round,smooth,radius