Autodesk.DesignScript.Geometry.IndexGroup.ToString
取得 IndexGroup 的字串表現法

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
比較兩個 IndexGroup
other: 其他 IndexGroup
Returns: 兩個物件是否相等

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
取得此類型的雜湊碼
Returns: 此物件的唯一雜湊碼

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
建立一個儲存三個索引的 IndexGroup
a: 索引 a
b: 索引 b
c: 索引 c
Returns: IndexGroup
tri,polygon,mesh,meshes