Autodesk.DesignScript.Geometry.Curve.ToString
取得 Curve 的字串表現法

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
建立在兩條曲線之間混成的曲線
curve1: 要混成的第一條曲線
curve2: 要混成的第二條曲線
endOrStart1: 指示要混成曲線 1 哪一端的旗標
endOrStart2: 指示要混成曲線 1 哪一端的旗標
isG2Continuous: 指示結果曲線是否為 G1 或 G2 連續性的旗標
Returns: 混成兩條曲線產生的曲線
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
取得 CoordinateSystem，其原點在指定參數的點中。X 軸與曲線法線對齊，Y 軸與此點的曲線切線對齊，Z 軸與此點的向上向量或雙法線對齊
param: 要於其演算的參數
Returns: 在曲線參數的 CoordinateSystem
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
傳回其法線與曲線切線對齊的平面。 參數會進行調整，以便 0 永遠是起點，而 1 永遠是終點。
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtDistance(System.Double)
沿著曲線取得特定弧長度中的點
segmentLength: 沿著曲線要於其演算的距離
Returns: 在給定弧長度中的點
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
根據分割的輸入數值，傳回點沿著曲線長度的間隔一致
divisions: 分割數
Returns: 點沿著曲線長度的間隔一致

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
根據分割的輸入數值，傳回點沿著曲線的弦長度一致
divisions: 分割數
Returns: 曲線上的點清單

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
傳回點沿著曲線在給定線段長度中的間隔一致，並從給定點開始
point: 從測量位置的參考點
segmentLength: 沿著曲線要於其演算的距離
Returns: 曲線上的點清單

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
傳回點在曲線上及給定的弦長度中的間隔，並從給定點開始
point: 從測量位置的參考點
chordLength: 弦長
Returns: 曲線上的點清單

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
傳回與曲線起點相距指定距離的 CoordinateSystem。Y 軸相切於曲線，而 X 軸是曲率。
segmentLength: 沿著曲線要於其演算的距離
Returns: 曲線上的 CoordinateSystem
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtDistance(System.Double)
傳回與曲線起點相距指定距離的 CoordinateSystem。Y 軸相切於曲線，而 X 軸是曲率。
segmentLength: 沿著曲線要於其演算的距離
Returns: 曲線上的 CoordinateSystem
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
傳回沿著曲線與起點相距指定距離的平面。平面的法線與曲線切線對齊。
segmentLength: 沿著曲線要於其演算的距離
Returns: 曲線上的平面
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PlaneAtDistance(System.Double)
傳回沿著曲線與起點相距指定距離的平面。平面的法線與曲線切線對齊。
segmentLength: 沿著曲線要於其演算的距離
Returns: 曲線上的平面
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
取得從曲線的起點測量到給定參數的線段長度。
param: 介於 0 到 1 之間的值
Returns: 線段長度
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtDistance(System.Double)
沿著曲線取得特定弧長度中的參數。
segmentLength: 沿著曲線要於其演算的距離
Returns: 參數
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.LengthBetweenParameters(System.Double,System.Double)
取得曲線上兩個參數點之間的弧長度
startParam: 網域起點
endParam: 網域終點
Returns: 兩個參數之間的弧長
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
取得位於曲線給定點的參數。如果點不在曲線上，會取得最接近的參數。如果輸入的曲線是 PolyCurve，只有當點位於 PolyCurve 時，此函數才會傳回有效的參數。如果是其他曲線類型，此函數會傳回曲線上最接近輸入點之點的參數。
point: 沿著曲線或曲線附近的點
Returns: PolyCurve 之曲線上的參數，或是其他曲線類型之曲線上的最近參數。
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.DivideEqually(System.Int32)
將曲線分割為給定數目的等長曲線
divisions: 分割數
Returns: 分割之後的曲線陣列
chopcurve,segment,slices

Autodesk.DesignScript.Geometry.Curve.DivideByDistance(System.Int32)
將曲線分割為給定數目的曲線，而且與起點和終點等距離 (等於弦)。
divisions: 分割數
Returns: 分割之後的曲線陣列
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByLengthFromParameter(System.Double,System.Double)
從給定參數位置進行測量，將曲線分割成給定長度的曲線
length: 分割之後的曲線長度
parameter: 用於測量起點的參數位置
Returns: 分割之後的曲線陣列
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByDistanceFromParameter(System.Double,System.Double)
從給定參數位置進行測量，將曲線分割成給定弦長度的曲線
distance: 從分割取得的每個曲線的弦長度
parameter: 用於測量起點的參數位置
Returns: 分割之後的曲線陣列
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimStart(System.Double)
在指定參數中移除曲線起點
startParameter: 於其開始修剪的參數
Returns: 移除了起點的新曲線
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimEnd(System.Double)
在指定參數中移除曲線終點
endParameter: 於其開始修剪的參數
Returns: 移除了終點的新曲線
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrim(System.Double,System.Double)
移除指定參數中的曲線起點和終點。
startParameter: 於其開始修剪的參數
endParameter: 於其開始修剪的參數
Returns: 移除了外部線段的新曲線
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.ParameterTrimInterior(System.Double,System.Double)
在指定參數中移除曲線的內部部分
startParameter: 於其開始修剪的參數
endParameter: 於其開始修剪的參數
Returns: 移除了內部線段的新曲線
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimSegments(System.Double[])
移除曲線的數個線段，捨棄第 1、第 3、第 5...線段
parameters: 於其分割曲線的參數清單
Returns: 捨棄第 1、第 3、第 5...線段的曲線陣列
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
移除曲線的數個線段，捨棄第 2 個、第 4 個，第 6 個... 線段 (如果布林為 true)
parameters: 於其分割曲線的參數清單
discardEvenSegments: 切換以捨棄偶數線段
Returns: 如果布林為 True，捨棄第 2、4、6...線段的曲線陣列
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double)
在指定參數中，將曲線分割成兩段
parameter: 於其執行分割的參數
Returns: 分割後剩餘的兩條曲線
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double)
在指定參數中，將曲線分割成兩段
parameter: 於其執行分割的參數
Returns: 分割後剩餘的兩條曲線
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double[])
在指定參數中，將曲線分割成多段
parameters: 於其分割曲線的參數清單
Returns: 從分割建立的曲線
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(Autodesk.DesignScript.Geometry.Curve)
將此曲線和輸入曲線接合成新的 PolyCurve，保持完整的原始曲線。
curve: 要關連到的曲線
Returns: 由兩條曲線組成的 PolyCurve
convertcurve,curve2polycurve,joincurve,concat

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
在點選點決定的特定終點，將曲線延伸指定的距離。點選端將延伸。封閉曲線 (例如圓和橢圓) 無法延伸。
distance: 要延伸的距離
pickSide: 要延伸的終點
Returns: 延伸的曲線
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
在其起始端將曲線延伸指定的距離。  封閉曲線 (例如圓和橢圓) 無法延伸。
distance: 要延伸的距離
Returns: 延伸的曲線
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
在其結束端將曲線延伸指定的距離。  封閉曲線 (例如圓和橢圓) 無法延伸。
distance: 要延伸的距離
Returns: 延伸的曲線
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
將輸入曲線沿著給定的投影方向投影到指定的基礎幾何圖形上。投影到幾何圖形之 VectorList 上的幾何圖形會投影到基礎幾何圖形中