Autodesk.DesignScript.Geometry.Point.ToString
取得 Point 的字串表現法

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
比較兩個點
other: 其他點
Returns: 兩個物件是否相等

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
取得此類型的雜湊碼
Returns: 此物件的唯一雜湊碼

Autodesk.DesignScript.Geometry.Point.Origin
取得原點 (0,0,0)
Returns: 原點
zero,origin