Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
取得 CoordinateSystem 的字串表現法

Autodesk.DesignScript.Geometry.CoordinateSystem.Identity
建立一個 CoordinateSystem 做為世界座標系統：原點為
0, 0, 0；X 軸為 1, 0, 0；Y 軸為 0, 1, 0；Z 軸為 0, 0, 1
zero,wcs

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
建立一個 CoordinateSystem，原點在輸入點，X 和 Y 軸設為 WCS X 軸和 Y 軸。
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByPlane(Autodesk.DesignScript.Geometry.Plane)
建立一個 CoordinateSystem，原點等於輸入平面原點，而且 X 軸和 Y 軸位於平面，與平面 X 軸和 Y 軸對齊。

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
在具有 X 和 Y 軸的原點中，建立一個 CoordinateSystem。輸入向量會標準化，然後再建立 CoordinateSystem。

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
在具有 X 和 Y 軸的原點中，建立一個 CoordinateSystem，完全忽略 Z 軸。輸入向量會標準化，然後再建立 CoordinateSystem。
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
在相對於指定座標系統的指定圓柱座標參數中，建立一個 CoordinateSystem

Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
在相對於指定座標系統的指定球形座標參數中，建立一個 CoordinateSystem

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
判定是否能夠取得此 CoordinateSystem 的逆向
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
測試正投影是否比例調整，即其真的具有剪切元件。
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
測試正投影是否比例調整，而且所有向量都標準化。
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
建立一個點，表示 CoordinateSystem 原點。
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
傳回 CoordinateSystem 的 X 軸。
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
傳回 CoordinateSystem 的 Y 軸。
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
傳回 CoordinateSystem 的 Z 軸。
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
傳回 CoordinateSystem 的 X 軸比例調整：X 軸線向量的長度。

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
傳回 CoordinateSystem 的 Y 軸比例調整：Y 軸線向量的長度。

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
傳回 CoordinateSystem 的 z 軸比例調整：Z 軸線向量的長度。

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
取得此 CoordinateSystem 的逆向 - 將此 CoordinateSystem 套用至一段幾何圖形，會反轉原點。

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
在這個引數之後，套用引數 CoordinateSystem。結果 = this * other

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
在這個引數之前，套用引數 CoordinateSystem。結果 = other * this

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
傳回一個包含 X、Y 和 Z 比例係數的向量
Returns: 調整比例過的向量
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
判定兩個 CoordinateSystems 是否相等
other: 其他座標系統
Returns: 如果座標系統相等，則傳回 true

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
透過 WCS 中各自定義之 X、Y、Z 方向的給定位移，來轉換任何給定的 CoordinateSystem。
xTranslation: 沿著 X 軸位移。
yTranslation: 沿著 Y 軸位移。
zTranslation: 沿著 Z 軸位移。
Returns: 已轉換的 CoordinateSystem。
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
依輸入向量的方向和大小轉換物件。
direction: 平移方向的向量
Returns: 平移過的座標系統
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
依給定方向透過給定距離來轉換任何 CoordinateSystem 類型。
direction: 位移方向向量
distance: 沿著給定方向的位移距離
Returns: 平移過的座標系統
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
將此 CoordinateSystem 從來源 CoordinateSystem 轉換為新的關聯 CoordinateSystem。
Returns: 已轉換的 CoordinateSystem。

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
繞著原點與軸，將物件旋轉指定的度數
origin: 原點
axis: 旋轉的向量軸
degrees: 要旋轉的度數
Returns: 旋轉過的座標系統
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
繞著給定平面原點與法線，將物件旋轉指定的度數
plane: 要從其取得法線的平面
degrees: 旋轉值 (以度為單位)
Returns: 旋轉過的座標系統
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
繞著原點等比例調整
amount: 要調整比例的量
Returns: 調整比例過的座標系統
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
繞著原點非等比例調整
xamount: 要在 X 軸調整比例的量
yamount: 要在 Y 軸調整比例的量
zamount: 要在 Z 軸調整比例的量
Returns: 調整比例過的座標系統
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
繞著給定平面非等比例調整
plane: 要調整比例的平面
xamount: 要在 X 軸調整比例的量
yamount: 要在 Y 軸調整比例的量
zamount: 要在 Z 軸調整比例的量
Returns: 調整比例過的座標系統
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
繞著指定點等比例調整，使用
basePoint: 調整基準點比例
from: 要被調整比例的點
to: 要調整比例到的點
Returns: 調整比例過的座標系統
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
利用基準點、起點 (從) 和終點 (到) 調整一個維度的比例。調整比例的軸是由基準點與起點之間的直線來定義。
basePoint: 調整基準點比例
from: 要被調整比例的點
to: 要調整比例到的點
Returns: 調整比例過的座標系統
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
透過基準點和 2 個點選點雙向調整比例。兩個點選點會投影至基準平面，以便判定 2D 比例係數
basePlane: 調整基準點比例
from: 要被調整比例的點
to: 要調整比例到的點
Returns: 調整比例過的座標系統
resize,size,from,to,scale2d,2d