Autodesk.DesignScript.Geometry.Cuboid.ToString
取得 Cuboid 的字串表現法

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
以指定的寬度、長度和高度建立一個中心在輸入點的立方體。
origin: 原點
width: 立方體的寬度
length: 立方體的長度
height: 立方體的高度
Returns: 透過長度建立的立方體
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.Length
傳回長度距離。附註：這會傳回立方體的標註，而不是實際的世界空間標註。 換言之，如果您建立一個寬度 (X 軸) 長度為 10 的立方體，並將其轉換為在 X 具有 2 倍比例的 CoordinateSystem，寬度仍將為 10。ASM 不允許您以任何可預測的順序萃取本體的頂點，因此轉換之後無法判定標註。

Autodesk.DesignScript.Geometry.Cuboid.Width
傳回寬度距離。附註：這會傳回立方體的標註，而不是實際的世界空間標註。 換言之，如果您建立一個寬度 (X 軸) 長度為 10 的立方體，並將其轉換為在 X 具有 2 倍比例的 CoordinateSystem，寬度仍將為 10。ASM 不允許您以任何可預測的順序萃取本體的頂點，因此轉換之後無法判定標註。

Autodesk.DesignScript.Geometry.Cuboid.Height
傳回高度距離。附註：這會傳回立方體的標註，而不是實際的世界空間標註。 換言之，如果您建立一個寬度 (X 軸) 長度為 10 的立方體，並將其轉換為在 X 具有 2 倍比例的 CoordinateSystem，寬度仍將為 10。ASM 不允許您以任何可預測的順序萃取本體的頂點，因此轉換之後無法判定標註。