Autodesk.DesignScript.Geometry.PolySurface.ToString
取得 PolySurface 的字串表現法

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
沿著軌跡掃掠曲線來製作 PolySurface。。
rail: 要沿其掃掠的曲線
profile: 掃掠輪廓
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
依點尋找曲面。取得正向中的第一個交點。如果點擊曲面內部，則傳回一個曲面，如果點擊邊緣內部，則傳回兩個曲面，如果點擊頂點，則傳回多個曲面
surfacesatpoint,findsurfaces,extractsurfaces