Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
取得 TSplineSurface 的字串表現法

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立「定向」的 T 雲形線平面，位於具有向量法線但具有特定 X 軸方位的點原點。
這不會影響到分割、相交、投影等作業，僅會指定輸入 CoordinateSystem 的方位。
origin: 平面的根點
normal: 平面的法線
xAxis: 平面的 X 軸
minCorner: 最小角點的 2D 點 (以平面座標表示)
maxCorner: 最大角點的 2D 點 (以平面座標表示)
xSpans: 寬度跨越的數量
ySpans: 長度跨越的數量
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 平面 T 雲形線曲面
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
根據原點與 X、Y 軸建立平面。
Z 軸是兩個向量的向量積。
origin: 平面的根點
xAxis: 平面的 X 軸
yAxis: 平面的 Y 軸
minCorner: 最小角點的 2D 點 (以平面座標表示)
maxCorner: 最大角點的 2D 點 (以平面座標表示)
xSpans: 寬度跨越的數量
ySpans: 長度跨越的數量
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 平面 T 雲形線曲面
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立在起點具有指定的底部半徑且延伸至終點處頂點的
T 雲形線圓錐。
startPoint: 圓錐的起點
endPoint: 圓錐的終點
radius: 圓錐底面的半徑
radiusSpans: 圓周跨越的數量
heightSpans: 高度跨越的數量
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 圓錐形 T 雲形線曲面
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立具有從起點到終點的軸，並在起點與終點具有指定半徑的 T 雲形線圓錐。
此物件沒有頂點，並呈視域造型。
startPoint: 圓錐的起點
endPoint: 圓錐的終點
startRadius: 圓錐的起始半徑
endRadius: 圓錐的結束半徑
radiusSpans: 圓周跨越的數量
heightSpans: 高度跨越的數量
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 圓錐形 T 雲形線曲面
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立一個 T 雲形線圓錐，其基準點位於 CoordinateSystem 原點，依 CoordinateSystem Z 軸方向延伸，
圓形底面位於 CoordinateSystem XY 平面。
cs: 圓錐的中心與底面將放在此座標系統的 X-Y 平面
height: 圓錐的高度
radius: 圓錐的半徑
radiusSpans: 圓周跨越的數量
heightSpans: 高度跨越的數量
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 圓錐形 T 雲形線曲面
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立一個 T 雲形線圓錐，其基準點位於 CoordinateSystem 原點，依 CoordinateSystem Z 軸方向延伸，
其圓形底面位於 CoordinateSystem XY 平面。
cs: 圓錐的中心與底面將放在此座標系統的 X-Y 平面
height: 圓錐的高度
startRadius: 圓錐的起始半徑
endRadius: 圓錐的結束半徑
radiusSpans: 圓周跨越的數量
heightSpans: 高度跨越的數量
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 圓錐形 T 雲形線曲面
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立定心至輸入點並具有指定半徑的 T 雲形線圓球。
centerPoint: 圓球的中心
radius: 圓球的半徑
radiusSpans: 徑向跨越的數量
heightSpans: 高度跨越的數量
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 球形 T 雲形線曲面
tspline,sphere,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立表面上包含四個輸入點的 T 雲形線圓球。
points: 清單中要建置圓球的四個點。這些點不應共平面
radiusSpans: 徑向跨越的數量
heightSpans: 高度跨越的數量
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 球形 T 雲形線曲面
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立具有指定中心與半徑且與預設世界 XY 平面對齊的 T 雲形線圓環
center: 圓環的中心
innerRadius: 圓環的內側半徑
outerRadius: 圓環的外側半徑
innerRadiusSpans: 內側徑向跨越的數量
outerRadiusSpans: 外側徑向跨越的數量
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 超環面 T 雲形線曲面
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立定心至輸入點並具有指定寬度、長度及高度的 T 雲形線框。
origin: 框的中心
width: 框的寬度
length: 框的長度
height: 框的高度
xSpans: 對寬度的跨越進行編號
ySpans: 對長度的跨越進行編號
zSpans: 對高度的跨越進行編號
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: T 雲形線立方體
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立定心及定位至輸入 CoordinateSystem 並具有指定寬度、長度及高度的 T 雲形線框。
cs: 框的 X-Y 平面將與相應的 X 對齊
width: 框的寬度
length: 框的長度
height: 框的高度
xSpans: 對寬度的跨越進行編號
ySpans: 對長度的跨越進行編號
zSpans: 對高度的跨越進行編號
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: T 雲形線立方體
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立跨距從低點至高點的 T 雲形線框。
lowPoint: 第一個角點
highPoint: 第二個角點
xSpans: 對寬度的跨越進行編號
ySpans: 對長度的跨越進行編號
zSpans: 對高度的跨越進行編號
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: T 雲形線立方體
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立定心於 CoordinateSystem 原點且具有指定半徑的 T 雲形線四角球
cs: 本端座標系統
radius: 四角球半徑
spans: 四角球各面兩個維度的跨距數量
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: T 雲形線四角球
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
建立具有指定中心與半徑且與預設世界 XY 平面對齊的 T 雲形線四角球
center: 四角球中心點
radius: 四角球半徑
spans: 四角球各面兩個維度的跨距數量
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: T 雲形線四角球
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
使用均勻策略從 NURBS 曲面建構 T 雲形線曲面。
輸入 NURBS 曲面重新建置為以相等的參數式間隔
或弧長度間隔 (取決於相應的 useArcLen 旗標) 均勻放置節點，並
由
3 度 NURBS 曲面近似。輸出 T 雲形線在 U 和 V 方向
以指定跨距計數分割。
nurbsSurface: 輸入 NURBS 曲面
uSpans: u 方向需要的跨距數量
vSpans: v 方向需要的跨距數量
uUseArcLen: 在 u 參數式方向使用弧長度還是參數式細分
vUseArcLen: 在 v 參數式方向使用弧長度還是參數式細分
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
使用曲率子分割策略從 NURBS 曲面建構 T 雲形線曲面。
輸入 NURBS 曲面重新建置為 3 度。輸出 T 雲形線在根據曲率自動
偵測到的每個方向具有跨距計數及位置。
nurbsSurface: 輸入 NURBS 曲面
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByExtrude(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
沿指定的向量擠出曲線以建構T雲形線圓柱。
curve: 縱斷面曲線
direction: 擠出向量
frontDistance: 通過向量方向拉伸距離
backDistance: 拉伸距離使其與向量方向相反
frontSpans: 通過向量方向的跨距數量。若超過 0，將不執行向量方向的拉伸
backSpans: 反向量方向跨距數量。若超過 0，將不執行向量方向的拉伸
profileSpans: 縱斷面方向的跨距數量。若不超過 0，將自動定義
uniform: 針對沿輪廓方向的跨距分配使用均勻或曲率策略
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
tspline,extrude,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
透過圍繞軸 (由軸原點與軸方向形成)，
以 start_angle (以度為單位) 為起點掃掠輪廓曲線，
並掃掠 sweep_angle (以度為單位) 角度以建立 T 雲形線曲面。
profile: 縱斷面曲線
axisOrigin: 旋轉中心
axisDirection: 旋轉軸
startAngle: 開始旋轉的角度
sweepAngle: 完成旋轉的角度
radialSpans: 半徑的跨距數量
axialSpans: 高度的跨距數量。若不超過 0，將自動定義
uniform: 針對跨距分配使用均勻或曲率策略
symmetry: T 雲形線曲面的對稱選項
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
讓管表面位於曲線或直線的網路之外。
在每個曲線交點處建立平滑接合。
某些參數採用單一值或清單 (每條曲線兩個值)。
curves: 建立管所依據之曲線的清單
defaultRadius: 所建立管的預設半徑
snappingTolerance: 用於偵測曲線交點的公差
segmentsCount: 每個管中的段數。允許使用單一值或清單 (較曲線數量長兩倍)
endRotations: 每個管端旋轉的值 (以度為單位)。允許使用單一值或清單 (較曲線數量長兩倍)
endRadii: 每個管端半徑的值。允許使用單一值或清單 (較曲線數量長兩倍)
endPercentage: 從每個輸入曲線的終點到管網起點的值 (0 至 1)。允許使用單一值或清單 (較曲線數量長兩倍)
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
讓管表面位於曲線或直線的網路之外。
在每個曲線交點處建立平滑接合。
某些參數採用單一值或清單 (每條曲線一個值)。
curves: 建立管所依據的曲線清單
defaultRadius: 所建立管的預設半徑
snappingTolerance: 用於偵測曲線交點的公差
segmentsCount: 每條曲線的線段數。清單的大小可以是曲線計數、1 (複製) 或 0 (自動決定)。
autoHandleStart: 如果為 True，則自動產生每條曲線起點處的控點參數，忽略 rotationsAtStart、radiiAtStart、positionsAtStart 的自訂參數。
autoHandleEnd: 如果為 True，則自動產生每條曲線終點處的控點參數，忽略 rotationsAtEnd、radiiAtEnd、positionsAtEnd 的自訂參數。
startRotations: 每條曲線起點處每個管控點的自訂旋轉角度 (度)。當 autoHandleStart 為 True 時，會忽略此參數。清單的大小可以是曲線計數或 1 (複製)。
endRotations: 每條曲線終點處每個管控點的自訂旋轉角度 (度)。當 autoHandleEnd 為 True 時，會忽略此參數。清單的大小可以是曲線計數或 1 (複製)。
startRadii: 每條曲線起點處每個管控點的自訂半徑。當 autoHandleStart 為 True 時，會忽略此參數。清單的大小可以是曲線計數或 1 (複製)。
endRadii: 每條曲線終點處每個管控點的自訂半徑。當 autoHandleEnd 為 True 時，會忽略此參數。清單的大小可以是曲線計數或 1 (複製)。
startPositions: 每個管控點在每條曲線起點處的自訂位置，以沿著曲線弧長介於 0 和 1 之間的百分比表示。當 autoHandleStart 為 true 時，會忽略此參數。清單大小可以是曲線計數或 1 (複製)。起點和終點位置在每條曲線上不能互相重疊。理想上，起點位置應接近 0，而終點位置應接近 1。
endPositions: 每個管控點在每條曲線終點處的自訂位置，以沿著曲線弧長介於 0 和 1 之間的百分比表示。當 autoHandleEnd 為 true 時，會忽略此參數。清單大小可以是曲線計數或 1 (複製)。起點和終點位置在每條曲線上不能互相重疊。理想上，起點位置應接近 0，而終點位置應接近 1。
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
T 雲形線採用框模式還是平滑模式
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
T 雲形線是否處於開放狀態。
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
將 T 雲形線曲面根據造型轉換為實體或曲面。
注意事項: 如果輸入曲面是在比 Dynamo 中載入的版本還高的 T 雲形線版本建立的，則產生的 B-Rep 可能會發生細微而預期外的變更，因為這個曲面的複本將會降級為 Dynamo 版本，轉換也會使用這個複本。
matchTopology: 決定產生的本體是否應與輸入的 T 雲形線曲面具有相同的拓樸。
Returns: 拓樸圖元 (實體或曲面)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
將 T 雲形線曲面轉換為網面。網面可以具有三角形與四邊形。
minSegments: 每個方向的最小段數。將始終會產生至少一段。
tolerance: 從網格到曲面允許的最大距離。若設為零或負值，將停用該距離
Returns: 網格圖元
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
將指定頂點清單熔接到單一頂點中。
vertices: 要熔接的頂點
newPosition: 結果頂點掣點的位置。若傳遞空值，則使用掣點的平均位置。
keepSubdCreases: 保留輸入拓樸的子分割縐摺
Returns: 具有熔接頂點的 T 雲形線曲面
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
建立曲線之 T 雲形線與封閉迴路的相符項
tsEdges: 建立相符項將使用的封閉 T 雲形線邊迴路
curves: 建立相符項將使用的封閉曲線迴路
continuity: 要嘗試相符的幾何圖形連續性: G0、G1、G2
useArclength: 在建置相符項時是否要使用 arcLength 對齊
useRefinement: 若為 True，會將額外的控制點加入至 T 雲形線，以便在指定的公差內與曲面相符。
numRefinementSteps: 細分步長的最大數量。若將 useRefinement 設為 False，則忽略
refinementTolerance: 要達到的公差。若將 useRefinement 設為 False，則忽略
usePropagation: 建置相符項時是否要使用擴展
widthOfPropagation: 確定曲面受相符項影響的程度。若 usePropagation 設為 False，則忽略
tangentScale: 切線比例。若未將連續性設為 G1，則忽略
curvParamWeight: Carvature 參數重量。若未將連續性設為 G2，則會忽略
flipSourceTargetAlignment: 是否要反轉定線方向
Returns: 位於指定的 T 雲形線邊界邊緣與曲線迴路之間的 T 雲形線曲面
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
建立與 T 雲形線和曲線封閉迴路的相符項
tsEdges: 要與其建立相符項的封閉 T 雲形線邊迴路
curves: 要與其建立相符項的封閉曲線迴路
continuity: 要嘗試相符的幾何圖形連續性: G0、G1、G2
useArclength: 在建置相符項時是否要使用 arcLength 對齊
useRefinement: 若為 True，會將額外的控制點加入至 T 雲形線，以便在指定的公差內與曲面相符。
numRefinementSteps: 細分步長的最大數量。若 useRefinement 設為 False，則忽略
refinementTolerance: 要達到的公差。若 useRefinement 設為 False，則忽略
usePropagation: 建置相符項時是否要使用擴展
widthOfPropagation: 決定曲面受相符項影響的程度。若 usePropagation 設為 False，則忽略
scale: 如果是 G1，則為切線比例，如果是 G2，則為曲率比例。若連續性為 G0，則忽略。
flipSourceTargetAlignment: 是否要反轉對齊方向
Returns: 位於指定的 T 雲形線邊界邊緣與曲線迴路之間的 T 雲形線曲面
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
建立 BRep 之 T 雲形線與封閉迴路的相符項。首先，
將邊迴路轉化為曲線迴路，然後執行比對
tsEdges: 建立相符項將使用的封閉 T 雲形線邊迴路
brepEdges: 建立相符項將使用的封閉 BRep 邊迴路
continuity: 要嘗試相符的幾何圖形連續性: G0、G1、G2
useArclength: 在建置相符項時是否要使用 arcLength 對齊
useRefinement: 若為 True，會將額外的控制點加入至 T 雲形線，以便在指定的公差內與曲面相符。
numRefinementSteps: 細分步長的最大數量。若將 useRefinement 設為 False，則忽略
refinementTolerance: 要達到的公差。若將 useRefinement 設為 False，則忽略
usePropagation: 建置相符項時是否要使用擴展
widthOfPropagation: 確定曲面受相符項影響的程度。若 usePropagation 設為 False，則忽略
tangentScale: 切線比例。若未將連續性設為 G1，則忽略
curvParamWeight: Carvature 參數重量。若未將連續性設為 G2，則會忽略
flipSourceTargetAlignment: 是否要反轉定線方向
Returns: 位於指定的 T 雲形線邊界邊緣與 BRep 邊迴路之間的 T 雲形線曲面
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
變更 T 雲形線的視覺型式。
若傳遞 true，則進行平滑視覺化，否則使用框。
enable: 啟用或停用平滑視覺化
Returns: 具有所選視覺型式的 T 雲形線
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
在兩組面之間建立橋接。將
第一個群組中的項目視為此曲面的子系。
第二個群組中的項目可以是此曲面的子系，也可以屬於
其他曲面。每個群組中的拓樸可能並不
相鄰，但應建立相同數量的的不同迴路。
firstGroup: 要橋接的第一組面
secondGroup: 要橋接的第二組面
followCurves: 各個不同拓樸迴路的橋接
曲線 (若傳遞空清單，將使用直線，若傳遞一條曲線，
則在偵測到多個輸入迴路時複製該曲線)
frameRotations: 沿各個不同拓樸迴路的
橋接曲線，圍繞框的法線完整旋轉的
次數 (若傳遞空清單，將使用 0，若傳遞一個值，
則在偵測到多個輸入迴路時複製該值)
spansCounts: 沿每個不同拓樸迴路之橋樑的
段數。每個群組的跨越數量應大於
相應的旋轉數量 (若傳遞空清單，
將使用 1，若傳遞一個值，則在
偵測到多個輸入迴路時複製該值)
cleanBorderBridges: 刪除邊界邊之間的橋樑。
keepSubdCreases: 保留輸入拓樸
的子分割縐摺
firstAlignVertices: 第一個群組中
每個不同拓樸迴路之定位頂點的清單 (頂點數量
應
與偵測到的輸入迴路數量相同，或清單可以為空)
secondAlignVertices: 第二個群組中
每個不同拓樸迴路之定位頂點的清單 (頂點數量
應
與偵測到的輸入迴路數量相同，或清單可以為空)
flipAlignmentFlags: 旗標 (指出是否要針對對應的拓樸迴路將
橋樑翻轉對齊) 的清單。
(若傳遞空清單，則設為 False，若傳遞一個值，
則針對偵測到的每個輸入迴路複製該值)
Returns: 具有拓樸的 T 雲形線曲面，由橋樑連接
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
在面組和邊組之間建立橋接。將
第一個群組中的項目視為此曲面的子系。
第二個群組中的項目可以是此曲面的子系，也可以屬於
其他曲面。每個群組中的拓樸可能並不
相鄰，但應建立相同數量的的不同迴路。
firstGroup: 要橋接的第一組面
secondGroup: 要橋接的第二組邊
followCurves: 各個不同拓樸迴路的橋接
曲線 (若傳遞空清單，將使用直線，若傳遞一條曲線，
則在偵測到多個輸入迴路時複製該曲線)
frameRotations: 沿各個不同拓樸迴路的
橋接曲線，圍繞框的法線完整旋轉的
次數 (若傳遞空清單，將使用 0，若傳遞一個值，
則在偵測到多個輸入迴路時複製該值)
spansCounts: 沿每個不同拓樸迴路之橋樑的
段數。每個群組的跨越數量應大於
相應的旋轉數量 (若傳遞空清單，
將使用 1，若傳遞一個值，則在
偵測到多個輸入迴路時複製該值)
cleanBorderBridges: 刪除邊界邊之間的橋樑。
keepSubdCreases: 保留輸入拓樸
的子分割縐摺
firstAlignVertices: 第一個群組中
每個不同拓樸迴路之定位頂點的清單 (頂點數量
應
與偵測到的輸入迴路數量相同，或清單可以為空)
secondAlignVertices: 第二個群組中
每個不同拓樸迴路之定位頂點的清單 (頂點數量
應
與偵測到的輸入迴路數量相同，或清單可以為空)
flipAlignmentFlags: 旗標 (指出是否要針對對應的拓樸迴路將
橋樑翻轉對齊) 的清單。
(若傳遞空清單，則設為 False，若傳遞一個值，
則針對偵測到的每個輸入迴路複製該值)
Returns: 具有拓樸的 T 雲形線曲面，由橋樑連接
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
在邊組和面組之間建立橋接。將
第一個群組中的項目視為此曲面的子系。
第二個群組中的項目可以是此曲面的子系，也可以屬於
其他曲面。每個群組中的拓樸可能並不
相鄰，但應建立相同數量的的不同迴路。
firstGroup: 要橋接的第一組邊
secondGroup: 要橋接的第二組面
followCurves: 各個不同拓樸迴路的橋接
曲線 (若傳遞空清單，將使用直線，若傳遞一條曲線，
則在偵測到多個輸入迴路時複製該曲線)
frameRotations: 沿各個不同拓樸迴路的
橋接曲線，圍繞框的法線完整旋轉的
次數 (若傳遞空清單，將使用 0，若傳遞一個值，
則在偵測到多個輸入迴路時複製該值)
spansCounts: 沿每個不同拓樸迴路之橋樑的
段數。每個群組的跨越數量應大於
相應的旋轉數量 (若傳遞空清單，
將使用 1，若傳遞一個值，則在
偵測到多個輸入迴路時複製該值)
cleanBorderBridges: 刪除邊界邊之間的橋樑。
keepSubdCreases: 保留輸入拓樸
的子分割縐摺
firstAlignVertices: 第一個群組中
每個不同拓樸迴路之定位頂點的清單 (頂點數量
應
與偵測到的輸入迴路數量相同，或清單可以為空)
secondAlignVertices: 第二個群組中
每個不同拓樸迴路之定位頂點的清單 (頂點數量
應
與偵測到的輸入迴路數量相同，或清單可以為空)
flipAlignmentFlags: 旗標 (指出是否要針對對應的拓樸迴路將
橋樑翻轉對齊) 的清單。
(若傳遞空清單，則設為 False，若傳遞一個值，
則針對偵測到的每個輸入迴路複製該值)
Returns: 具有拓樸的 T 雲形線曲面，由橋樑連接
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
在兩組邊之間建立橋接。將
第一個群組中的項目視為此曲面的子系。
第二個群組中的項目可以是此曲面的子系，也可以屬於
其他曲面。每個群組中的拓樸可能並不
相鄰，但應建立相同數量的的不同迴路。
firstGroup: 要橋接的第一組邊
secondGroup: 要橋接的第二組邊
followCurves: 各個不同拓樸迴路的橋接
曲線 (若傳遞空清單，將使用直線，若傳遞一條曲線，
則在偵測到多個輸入迴路時複製該曲線)
frameRotations: 沿各個不同拓樸迴路的
橋接曲線，圍繞框的法線完整旋轉的
次數 (若傳遞空清單，將使用 0，若傳遞一個值，
則在偵測到多個輸入迴路時複製該值)
spansCounts: 沿每個不同拓樸迴路之橋樑的
段數。每個群組的跨越數量應大於
相應的旋轉數量 (若傳遞空清單，
將使用 1，若傳遞一個值，則在
偵測到多個輸入迴路時複製該值)
cleanBorderBridges: 刪除邊界邊之間的橋樑。
keepSubdCreases: 保留輸入拓樸
的子分割縐摺
firstAlignVertices: 第一個群組中
每個不同拓樸迴路之定位頂點的清單 (頂點數量
應
與偵測到的輸入迴路數量相同，或清單可以為空)
secondAlignVertices: 第二個群組中
每個不同拓樸迴路之定位頂點的清單 (頂點數量
應
與偵測到的輸入迴路數量相同，或清單可以為空)
flipAlignmentFlags: 旗標 (指出是否要針對對應的拓樸迴路將
橋樑翻轉對齊) 的清單。
(若傳遞空清單，則設為 False，若傳遞一個值，
則針對偵測到的每個輸入迴路複製該值)
Returns: 具有拓樸的 T 雲形線曲面，由橋樑連接
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
填滿 T 雲形線中的孔
edges: 內部有孔的邊組。邊必須為邊界。
fillMethod: 填充孔的方法: 0 - 鑲嵌，1 - 多邊形，2 - 收闔，3 - 收闔並熔接
keepSubdCreases: 保留輸入拓樸的子分割縐摺
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
壓縮曲面上的所有拓樸，並使索引相鄰。此功能將保持索引的相對順序。
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
向前插補會將控制點移至表面上的參數式位置。反轉插補會在曲面上針對每個原始控制點產生一個點，然後將此控制點移至其對應的曲面點。
reverse: 插補方向: 若為 False 則向前，否則反轉
Returns: 已在指定方向插補 T 雲形線
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
將所選面複製到新曲面。新曲面無對稱
faces: 要複製的面
Returns: 僅具有所選面的 T 雲形線曲面
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
沿指定向量移動指定頂點
vertices: 要移動的頂點清單
vector: 要移動所沿的方向
onSurface: 旗標，指示是使用曲面還是使用頂點的控制點

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSS(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface},System.String)
將指定的一組 T 雲形線曲面匯出至 T 雲形線場景檔
tSplineSurfaces: 要匯出的 T 雲形線曲面組
filePath: 要儲存之檔案的目標路徑
Returns: 正在儲存 T 雲形線組的檔案路徑
tspline,export,save,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface,System.String)
將指定的 T 雲形線曲面匯出至 T 雲形線網面檔案
tSplineSurface: 要匯出的 T 雲形線曲面
filePath: 要儲存之檔案的目標路徑
Returns: 正在儲存 T 雲形線曲面的檔案路徑
tspline,export,save,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
以 T 雲形線的網格格式將 T 雲形線曲面寫入字串。
tSplineSurface: 要序列化的 T 雲形線曲面
Returns: 字串，其中 T 雲形線曲面正在序列化
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
從 T 雲形線網格格式的字串建立 T 雲形線曲面。
content: T 雲形線網面檔案的字串表現法
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 清單中新載入的 T 雲形線曲面
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
從指定的 T 雲形線網格檔案載入 T 雲形線曲面
filePath: 要載入之檔案的來源路徑
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 清單中新載入的 T 雲形線曲面
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.IO.FileInfo,System.Boolean)
從指定的 T 雲形線網格檔案載入 T 雲形線曲面
file: 載入要使用的來源檔案
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 清單中新載入的 T 雲形線曲面
tspline,import,load,tsm,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
從指定的 T 雲形線場景檔載入 T 雲形線曲面組
filePath: 要載入之檔案的來源路徑
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 一組新載入的 T 雲形線曲面
tspline,import,load,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.IO.FileInfo,System.Boolean)
從指定的 T 雲形線場景檔載入 T 雲形線曲面組
file: 載入要使用的來源檔案
inSmoothMode: 以框或平滑視覺化的形式顯示 T 雲形線曲面
Returns: 一組新載入的 T 雲形線曲面
tspline,import,load,tss,file