Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
查找類似於「已超出容許的模型範圍，請考慮選擇較小的值」的本土化字串。

Autodesk.DesignScript.Geometry.Properties.Resources.OutsideAllowableModelingRange
查找類似於「您的輸入超出允許的塑型範圍，請考慮從「偏好」=>「一般」=>「調整幾何圖形比例」對話方塊中選擇塑型範圍在 {1} 和 {2} 之間的 {0} 設定」的本土化字串。