DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Grave a imagem para um caminho, com o nome de arquivo especificado.
image: A imagem para gravação
Nenhuma saída
write image,image,file,filepath