Autodesk.DesignScript.Geometry.Polygon.ToString
Obtém uma representação da sequência de caracteres do Polígono

Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Verifica se o ponto está dentro do polígono plano sem autointersecções.