Autodesk.DesignScript.Geometry.EllipseArc.ToString
Obtém uma representação da sequência de caracteres do EllipseArc

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Criar um EllipseArc em um plano com um determinado raio ao longo dos eixos X e Y e os ângulos nos quais efetuar a extrusão por percurso
plane: Plano que contém o arco da elipse
xRadius: O raio do EllipseArc na direção X do plano
yRadius: O raio do EllipseArc na direção Y do plano
startAngle: O ângulo inicial do arco conforme medido a partir do eixo X positivo do plano de entrada
sweepAngle: O ângulo para efetuar extrusão por percurso a partir do ângulo inicial em graus
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiStartAngleSweepAngle(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Criar um EllipseArc em um plano com um determinado raio ao longo dos eixos X e Y e os ângulos nos quais efetuar a extrusão por percurso
plane: O plano no qual está contido o EllipseArc
xRadius: O raio do EllipseArc na direção X do plano
yRadius: O raio do EllipseArc na direção Y do plano
startAngle: O ângulo inicial do arco conforme medido a partir do eixo X positivo do plano de entrada
sweepAngle: O ângulo para efetuar extrusão por percurso a partir do ângulo inicial em graus
ellipsearc,arcs