Autodesk.DesignScript.Geometry.NurbsCurve.ToString
Obtém uma representação da sequência de caracteres da NurbsCurve

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crie uma BSplineCurve utilizando os pontos de controle explícitos. NOTA 1: BSplineCurves com deg=1 tem descontinuidades G1, que causam problemas para a extrusão, extrusão por percurso e outras operações. Elas devem ser evitadas. Utilize em seu lugar uma PolyCurve.  NOTA 2: se a curva for periódica (fechada), então os últimos pontos DEVEM ser os mesmos.
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Crie uma BSplineCurve utilizando os pontos de controle explícitos. NOTA 1: BSplineCurves com deg=1 tem descontinuidades G1, que causam problemas para a extrusão, extrusão por percurso e outras operações. Elas devem ser evitadas. Utilize em seu lugar uma PolyCurve.  NOTA 2: se a curva for periódica (fechada), então os últimos pontos DEVEM ser os mesmos.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Crie uma BSplineCurve utilizando os pontos de controle explícitos. NOTA 1: BSplineCurves com deg=1 tem descontinuidades G1, que causam problemas para a extrusão, extrusão por percurso e outras operações. Elas devem ser evitadas. Utilize em seu lugar uma PolyCurve.  NOTA 2: se a curva for periódica (fechada), então os últimos pontos DEVEM ser os mesmos.
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
Crie uma BSplineCurve por vértices de controle, espessuras e nós. A PARTIR DO ASM DOCS: Grau: deve ser maior que 1 (spline no âmbito linear) e menos do que 26 (o grau máximo com base na B-spline suportado por ASM). Espessuras: todos os valores de espessura (se fornecidos) devem ser estritamente positivos.  A espessura menor do que 1e-11 será rejeitada e a função irá falhar.  Nós: o vetor de nó deve ser uma sequência de não decrescente. A multiplicidade do nó interno não deve ser maior do que o grau + 1 no nó inicial/final e o grau em um nó interno (isto permite que as curvas com descontinuidades G1 possam ser representadas). Observe que os vetores de nós não unidos são suportados, mas serão convertidos para unidos, com as alterações correspondentes aplicadas ao ponto de controle/dados da espessura. matriz de nós: o tamanho da matriz deve ser num_control_points + grau + 1
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crie uma BSplineCurve ao interpolar entre pontos.
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Crie uma BSplineCurve ao interpolar entre pontos. NOTA 2: se a curva for periódica (fechada), então o primeiro e o último ponto DEVE ser o mesmo.
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Crie uma BSplineCurve ao interpolar entre pontos com um grau especificado.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Retorna uma BSplineCurve através dos pontos, com direções tangenciais.
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
Obtém os pontos de controle da curva Nurbs.  Estes são os pontos nos quais a curva interpola.
Returns: Uma matriz de pontos

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
Os nós da curva. Os nós são uma série de valores de parâmetros (duplos) usados para determinar onde e como os pontos de controle afetam a curva.
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
Retorna os pesos dos pontos de controle da NurbsCurve. Os pesos determinam a influência de cada ponto de controle no formato da curva.
Returns: Weights of nurbs curve
ptweight