Autodesk.DesignScript.Geometry.Arc.ToString
Obtém uma representação da sequência de caracteres do Arco

Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Criar um arco que melhor se aproxima de uma coleção de pontos
points: Lista de pontos para o melhor ajuste do arco para
Returns: Arc created by best fit through points
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Criar um arco ou tangente por arco por pontos inicial e final e tangências no início e no final
point1: Ponto do início do bi-arco
vector1: Vetor de tangente do início do bi-arco
point2: Ponto do final do bi-arco
vector2: Vetor de tangente do fim do bi-arco
arc,tangent

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Criar um arco a partir do ponto inicial ao ponto final com a tangente inicial para o vetor
startPoint: Start point of arc
endPoint: End point of arc
startTangent: Start tangent direction vector
arc,tangent,arcs