Autodesk.DesignScript.Geometry.Cone.ToString
Obtém uma representação da sequência de caracteres do Cone

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Crie um cone com um determinado raio base no ponto inicial, estendendo-se para um vértice no ponto final.
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Crie um cone com um eixo a partir do ponto inicial até o ponto final, com raios especificados no início e no final. Este objeto não tem um vértice e pode ser considerados como um cone aparado.
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Cria um cone com o ponto base na origem do CoordinateSystem, estendendo na quantidade de comprimento na direção do eixo Z, com uma base circular no plano XY do CoordinateSystem.

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Cria um cone com o ponto base na origem do CoordinateSystem, estendendo na quantidade de comprimento na direção do eixo Z, com uma base circular no plano XY do CoordinateSystem.
cone,cone by height,cones