Autodesk.DesignScript.Geometry.Edge.ToString
Obtém uma representação da sequência de caracteres da Aresta

Autodesk.DesignScript.Geometry.Edge.CurveGeometry
A curva subjacente que compõe a aresta

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
As faces adjacentes a esta aresta

Autodesk.DesignScript.Geometry.Edge.StartVertex
O vértice no qual esta aresta se inicia

Autodesk.DesignScript.Geometry.Edge.EndVertex
O vértice no qual esta aresta termina