Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
Obtém uma representação da sequência de caracteres do TSplineReflection

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
Crie a reflexão radial para simetria da T-Spline pelo determinado plano com uma determinada contagem de segmentos (em graus) entre cada par de segmentos.
plane: Plano que o normal é o eixo para reflexão radial da T-Spline. Fornecido em coordenadas universais
segmentsCount: Número de segmentos de reflexão radial
segmentAngle: Ângulo entre cada par de segmentos simétricos da reflexão radial (em graus). Se for definido como 0, ele é definido por (360/segmentsCount)
Returns: Reflexão radial da T-Spline
tspline,symmetry,reflection,radial