Autodesk.DesignScript.Geometry.UV.ToString
Obtém uma representação da sequência de caracteres de UV

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
Comparar dois UV's
other: O outro UV
Returns: Se os dois objetos forem iguais

Autodesk.DesignScript.Geometry.UV.GetHashCode
Obter um hashcode para este tipo
Returns: Um único hashcode para este objeto

Autodesk.DesignScript.Geometry.UV.ByCoordinates(System.Double,System.Double)
Crie um UV a partir de dois duplos.
u: U value
v: V value
Returns: UV created by coordinates
surfaceparam,parameters,uv,uvs