Autodesk.DesignScript.Geometry.Cuboid.ToString
Obtém uma representação da sequência de caracteres do Cuboide

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(System.Double,System.Double,System.Double)
Crie um cubóide centralizado na origem do WCS, com largura, comprimento e altura.
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Crie um cubóide centralizado no ponto de entrada, com uma largura, comprimento e altura especificados.
origin: Origin point
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Crie um cuboide centralizado com a origem do sistema de coordenadas universal e com largura, comprimento e altura.
coordinateSystem: Sistema de coordenadas principal (centro do cuboide)
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created from lengths
box,cube,cubebysize,bycoord,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Crie um cubóide expandindo-se do ponto baixo para o ponto alto.
lowPoint: Corner low point of cuboid
highPoint: Corner high point of cuboid
Returns: Cuboind created by corners
box,cube,byminmax,by corners,by points,cubes

Autodesk.DesignScript.Geometry.Cuboid.Length
Retorna a distância do comprimento. Nota: isso retorna as dimensões de entrada do cubóide, NÃO as dimensões do espaço universal real. Em outras palavras, se você criar um cubóide com largura (eixo X) comprimento 10 e o transformar em um CoordinateSystem com 2 vezes dimensionando em X, a largura ainda será 10. O ASM não lhe permite extrair os vértices de um corpo em nenhuma forma previsível, portanto, é impossível determinar as dimensões após uma transformação.

Autodesk.DesignScript.Geometry.Cuboid.Width
Retorna a distância da altura. Nota: isso retorna as dimensões de entrada do cubóide, NÃO as dimensões do espaço universal real. Em outras palavras, se você criar um cubóide com largura (eixo X) comprimento 10 e o transformar em um CoordinateSystem com 2 vezes dimensionando em X, a largura ainda será 10. O ASM não lhe permite extrair os vértices de um corpo em nenhuma forma previsível, portanto, é impossível determinar as dimensões após uma transformação.

Autodesk.DesignScript.Geometry.Cuboid.Height
Retorna a distância da altura. Nota: isso retorna as dimensões de entrada do cubóide, NÃO as dimensões do espaço universal real. Em outras palavras, se você criar um cubóide com largura (eixo X) comprimento 10 e o transformar em um CoordinateSystem com 2 vezes dimensionando em X, a largura ainda será 10. O ASM não lhe permite extrair os vértices de um corpo em nenhuma forma previsível, portanto, é impossível determinar as dimensões após uma transformação.