Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
Mecanismo de registro do tipo de geometria.
hostType: Tipo de interfaces de IGeometryEntity derivadas.
contructor: Um delegado para construir a geometria.

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
Converter a geometria na determinada direção pelo comprimento do vetor
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Converte qualquer tipo de geometria pela distância determinada na direção determinada.
direction: Direção do deslocamento.
distance: A distância do deslocamento ao longo de uma determinada direção.
Returns: Geometria transformada.
move,along vector,distance

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforma a geometria usando a transformação fornecida do CoordinateSystem
Returns: Geometria transformada

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforma esta geometria do CoordinateSystem de origem em um novo CoordinateSystem do contexto.
Returns: Geometria transformada.
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Rotaciona o objeto em torno da origem e um eixo por um grau especificado
around,axis,degrees

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rotaciona o objeto em torno da origem e normal do plano por um grau especificado
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
Dimensionar de forma não uniforme em torno da origem
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Dimensionar de forma não uniforme em torno de um determinado plano
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Dimensionar de forma uniforme ao redor de um determinado ponto, usando dois pontos de seleção como escalas
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Dimensione uma cota pela base e 2 pontos de seleção. O eixo de dimensionamento é definido pela linha entre a base e o ponto.
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Dimensionar em duas dimensões por base e 2 pontos de seleção. Os dois pontos de seleção são projetados sobre o plano base para poder determinar os fatores de escala 2D
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
Obter a distância desde esta geometria para outra
other: A outra geometria
Returns: A distância
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
Obter o ponto mais próximo nesta geometria para a outra
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
Determinar se outro objeto de geometria efetua a intersecção com este
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
Obter a geometria da intersecção para este objeto e outro
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Obter a intersecção da geometria para este objeto e uma coleção de outras geometrias. Localiza a geometria comum de todos os participantes.
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
Dividir esta geometria utilizando outra geometria como um "ferramenta" de corte
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
Verificar se os dois objetos têm a mesmo geometria representacional ou valores numéricos
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
Obter a BoundingBox contendo a determinada parte da geometria
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
Converter a geometria para Solid Def json
Returns: Sequência formatada json

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
Importa um arquivo SAT e retorna uma matriz das geometrias importadas
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
Importa um arquivo SAT e retorna uma matriz das geometrias importadas
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.FromSolidDef(System.String)
Importa uma sequência JSON e retorna uma matriz de geometrias importadas
solidDefJson: Sequência json com geometria solid def formatada
Returns: Lista de geometrias convertidas

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
Exporta a geometria especificada para o determinado caminho de arquivo SAT
filePath: O nome do arquivo para o qual exportar a geometria

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
Exporta a geometria especificada para o determinado caminho de arquivo SAT
filePath: O nome do arquivo para o qual exportar a geometria
unitsMM: As unidades para utilizar

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String,System.Double)
Exporta uma lista de geometrias especificadas para o determinado caminho de arquivo SAT

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
Serializa a geometria especificada no formato Standard ACIS Binary (SAB) e retorna dados do fluxo binário serializado.

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Serializa a lista da geometria especificada no formato Standard ACIS Binary (SAB) e retorna dados do fluxo binário serializado.
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
Obter o contexto ou sistema de coordenadas de referência que foi usado para criar esta geometria.