Autodesk.DesignScript.Geometry.Point.ToString
Obtém uma representação da sequência de caracteres do Ponto

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Comparar dois pontos
other: O outro ponto
Returns: Se os dois objetos forem iguais

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
Obter um hashcode para este tipo
Returns: Um único hashcode para este objeto

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
Forme um ponto no plano XY com as 2 coordenadas cartesianas fornecidas.  O componente Z é 0.
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
Obtém o ponto de origem (0,0,0)
Returns: Origin point
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
Formar um ponto  com 3 coordenadas cartesianas fornecidas
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Formar um ponto em um determinado sistema de coordenadas com 3 coordenadas cartesianas
coordinateSystem: Sistema de coordenadas principal
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
Corta os pontos para excluir duplicados dentro da tolerância dos pontos incluídos
points: Lista de pontos dos quais os duplicados devem ser removidos
tolerance: Tolerância usada para a remoção
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near