Autodesk.DesignScript.Geometry.Solid.ToString
Obtém uma representação da sequência de caracteres do Sólido

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Crie um sólido ao elevar as curvas fechadas na seção transversal de entrada, com a curva guia para ajudá-lo. As curvas guia devem efetuar a intersecção com todas as curvas na seção transversal.
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Crie um sólido ao elevar as curvas fechadas na seção transversal de entrada, com a curva guia para ajudá-lo. As curvas guia devem efetuar a intersecção com todas as curvas na seção transversal.
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
Crie um sólido ao elevar as PolyCurves fechadas nas seções transversais de entrada. Essa operação é otimizada para seções compostas exclusivamente por segmentos de linha, com os vértices seguindo a mesma ordem. A opção de verificação e reparação garante a validade do sólido produzido, quando ativada. Sua desativação deve aumentar o desempenho.
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Efetuar a extrusão por percurso da curva do perfil fechado ao longo de dois corrimãos
path: A entrada do caminho para a extrusão por percurso ao longo.
guideRail: Uma guia para guiar a orientação da extrusão por percurso.
profile: The profile curve to sweep along the path
Brep,brep,sweep2,guides,sweepprofile

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Crie um sólido de revolução, efetuando a extrusão por percurso da curva do perfil em torno do eixo do raio formada pela origem e pelo vetor do eixo, desde o ângulo inicial em graus até o ângulo com extrusão por percurso em graus.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Solid created by revolve
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
Efetua a união de uma lista de sólidos com este sólido.
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
A diferença booleana deste sólido com outro

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
Obter uma casca sólida a partir das faces deste sólido
internalFaceThickness: Distância de extensão da casca para dentro
externalFaceThickness: Distância de extensão da casca para fora
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projeta a geometria de entrada neste sólido, na direção do vetor de entrada. Atualmente, esse método de projeção só é compatível com pontos ou curvas.
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
Separará um sólido em sólidos individuais se ele for composto por mais de um fragmento desarticulado. Retornará o mesmo sólido se ele for um único fragmento contíguo.
Returns: separar sólidos desunidos
split,disjoint