Autodesk.DesignScript.Geometry.Rectangle.ToString
Obtém uma representação da sequência de caracteres do Retângulo

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crie um retângulo por quatro pontos de canto.
points: List of corner points of rectangle
Returns: Rectangle created by corner points
rectbypointarray

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Crie um retângulo por quatro pontos de canto.
p1: 1st corner point of rectangle
p2: 2nd corner point of rectangle
p3: 3rd corner point of rectangle
p4: 4th corner point of rectangle
Returns: Rectangle created by corner points
rectbypoints

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Crie uma retângulo centralizado na origem do WCS no plano XY do WCS, com a largura (comprimento do eixo X) e comprimento (comprimento do eixo Y) especificados.
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Crie um retângulo centralizado na raiz do plano de entrada, com a largura (comprimento do eixo X do plano) e o comprimento (comprimento do eixo Y do plano) de entrada.
plane: Plane used to center rectangle
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crie um retângulo centralizado na origem da entrada do plano XY do CoordinateSystem, com a largura (comprimento do eixo X) e o comprimento (comprimento do eixo Y) especificados.
coordinateSystem: Sistema de coordenadas do retângulo (centro do retângulo)
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created from width and length
rectbylengths