Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
Obtém uma representação da sequência de caracteres do Sistema de coordenadas

Autodesk.DesignScript.Geometry.CoordinateSystem.Identity
Cria um CoordinateSystem como o sistema de coordenadas universais: origem
em 0, 0, 0; eixo x em 1, 0, 0; eixo Y em 0 1, 0; eixo Z em 0, 0, 1
zero,wcs

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
Crie um CoordinateSystem com origem no ponto de entrada, com os eixos X e Y definidos como eixos X e Y do WCS.
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByPlane(Autodesk.DesignScript.Geometry.Plane)
Crie um CoordinateSystem com origem igual a origem do plano de entrada, e os eixos X e Y residindo no plano, alinhados com os eixos X e Y do plano.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crie um CoordinateSystem na origem com os eixos X e Y. Os vetores de entrada são normalizados antes de criar o CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crie um CoordinateSystem na origem com os eixos X e Y, e com o eixo Z ignorado por completo. Os vetores são normalizados antes de criar o CoordinateSystem.
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Cria um CoordinateSystem nos parâmetros de coordenadas cilíndricas especificados com relação ao sistema de coordenadas especificado

Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Cria um CoordinateSystem nos parâmetros de coordenadas esféricas especificados com relação ao sistema de coordenadas especificado

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
Determinar se é possível obter o inverso deste CoordinateSystem
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
Testa se o dimensionamento é ortogonal, ou seja, ele não tem um componente de cisalhamento.
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
Testa se o dimensionamento é ortogonal e se todos os vetores estão normalizados.
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
Cria um ponto representando a origem do CoordinateSystem.
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
Retorna o eixo X do CoordinateSystem.
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
Retorna o eixo Y do CoordinateSystem.
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
Retorna o eixo Z do CoordinateSystem.
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
Retorna o eixo X do CoordinateSystem: o comprimento do vetor do eixo X.

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
Retorna o eixo Y do CoordinateSystem: o comprimento do vetor do eixo Y.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
Retorna o eixo Z do CoordinateSystem: o comprimento do vetor do eixo Z.

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
Obter o inverso deste CoordinateSystem - aplicar este CoordinateSystem em uma parte da geometria reverte o original.

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Aplicar o argumento de CoordinateSystem após este - Resultado = este * outros

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Aplicar o argumento CoordinateSystem antes que este um - Resultado = outros * este

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
Retorna um vetor que contém os fatores da escala X, Y e Z
Returns: Vetor dimensionado
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
Determinar se dois sistemas de coordenadas são iguais
other: outro sistema de coordenadas
Returns: retornará verdadeiro se os sistemas de coordenadas forem iguais

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
Converte um determinado CoordinateSystem pelos determinados deslocamentos nas direções x, y e z definidas no WCS, respectivamente.
xTranslation: Deslocamento ao longo do eixo X.
yTranslation: Deslocamento ao longo do eixo Y.
zTranslation: Deslocamento ao longo do eixo Z.
Returns: Sistema de coordenadas transformado.
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
Converter o objeto na direção e amplitude do vetor de entrada.
direction: Vetor da direção de conversão
Returns: Sistema de coordenadas convertido
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Converte qualquer tipo de CoordinateSystem pela distância determinada na direção determinada.
direction: Vetor de direção do deslocamento
distance: Distância do deslocamento ao longo de uma determinada direção
Returns: Sistema de coordenadas convertido
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforma este CoordinateSystem do CoordinateSystem de origem em um novo CoordinateSystem do contexto.
Returns: Sistema de coordenadas transformado.

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Rotaciona um objeto em torno da origem e de um eixo em um grau especificado
origin: Ponto de origem
axis: Eixo vetorial para rotação
degrees: Graus para rotacionar
Returns: Sistema de coordenadas rotacionado
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rotaciona o objeto em torno da origem e normal do plano determinado até o grau especificado
plane: Plano do qual obter a normal
degrees: Valor de rotação em graus
Returns: Sistema de coordenadas rotacionado
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
Dimensionar de forma uniforme em torno da origem
amount: Valor para dimensionar
Returns: Sistema de coordenadas dimensionado
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
Dimensionar de forma não uniforme em torno da origem
xamount: Valor para dimensionar no eixo X
yamount: Valor para dimensionar no eixo Y
zamount: Valor para dimensionar no eixo Z
Returns: Sistema de coordenadas dimensionado
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Dimensionar de forma não uniforme em torno de um determinado plano
plane: Plano ao redor do qual dimensionar
xamount: Valor para dimensionar no eixo X
yamount: Valor para dimensionar no eixo Y
zamount: Valor para dimensionar no eixo Z
Returns: Sistema de coordenadas dimensionado
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Dimensionar de forma uniforme ao redor de um determinado ponto, usando
basePoint: Dimensionar o ponto base
from: Ponto a partir do qual dimensionar
to: Ponto para o qual dimensionar
Returns: Sistema de coordenadas dimensionado
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Dimensione em uma dimensão usando um ponto base, um ponto inicial (desde) e um ponto final (até). O eixo de dimensionamento é definido pela linha entre o ponto base e o ponto inicial.
basePoint: Dimensionar o ponto base
from: Ponto a partir do qual dimensionar
to: Ponto para o qual dimensionar
Returns: Sistema de coordenadas dimensionado
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Dimensionar em duas dimensões por base e 2 pontos de seleção. Os dois pontos de seleção são projetados sobre o plano base para poder determinar os fatores de escala 2D
basePlane: Dimensionar o ponto base
from: Ponto a partir do qual dimensionar
to: Ponto para o qual dimensionar
Returns: Sistema de coordenadas dimensionado
resize,size,from,to,scale2d,2d