Autodesk.DesignScript.Geometry.Properties.Resources.LowerModelerExtentExceeded
Procura uma sequência de caracteres localizada similar a Suas entradas estão fora do intervalo de modelagem permitido. Considere a possibilidade de escolher a configuração {0} com um intervalo de modelagem entre {1} e {2} na caixa de diálogo "Configurações => Intervalo de trabalho da geometria".

Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
Procura uma sequência de caracteres localizada similar a Você excedeu as extensões de modelagem permitidas. Considere a possibilidade de escolher valores menores.

Autodesk.DesignScript.Geometry.Properties.Resources.OperationFailed
A pesquisa de sequência de caracteres localizada similar a {0} falha na operação.

Autodesk.DesignScript.Geometry.Properties.Resources.UpperModelerExtentExceeded
Procura uma sequência de caracteres localizada similar a Suas entradas estão fora do intervalo de modelagem permitido. Considere a possibilidade de escolher a configuração {0} com um intervalo de modelagem entre {1} e {2} na caixa de diálogo "Configurações => Intervalo de trabalho da geometria".