Autodesk.DesignScript.Geometry.NurbsSurface.ToString
Obtém uma representação da sequência de caracteres da NurbsSurface

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Cria uma superfície Nurb com pontos interpolados especificados e graus U e V.  A superfície resultante irá passar através de todos os pontos.
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Cria uma superfície Nurb com pontos interpolados especificados e graus U e V.  A superfície resultante irá passar através de todos os pontos.  O número de tangentes deve coincidir com o número de pontos na direção correspondente.  A superfície resultante será 3 graus na direção U e V.
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Cria uma superfície Nurb satisfazendo uma coleção de diferentes características de superfície. Este é o método de ajuste de superfície mais avançado.  A superfície resultante irá passar através de todos os pontos.  O número de tangentes deve coincidir com o número de pontos na direção correspondente.  A superfície resultante será 3 graus na direção U e V.  O derivativos de canto devem ser de segunda ordem (dP/dUdV) e devem ser fornecidos nesta ordem [ lowU, lowV ], [ highU, lowV ],  [ lowU, highV ], [ highU, highV ].
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Crie uma superfície Nurb utilizando pontos de controle explícitos, com os graus U e V especificados.
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
Cria uma superfície Nurb com vértices de controle especificados, nós, espessuras e graus U V.  Há diversas restrições sobre os dados que, se quebrados, irá causar a falha da função e irá gerar uma exceção. Grau: ambos os graus u- e v- devem ser > = 1 (spline linear no âmbito da peça) e menos de 26 (o grau máximo com base na B-spline suportado por ASM). Espessura: todos os valores de espessura (se fornecidos) devem ser estritamente positivos.  Espessuras menores do que 1e-11 serão rejeitadas e a função irá falhar.  Nós: ambos os vetores de nós devem ser sequências não decrescentes. A multiplicidade do nó interno não deve ser maior que o grau + 1 no inicial/final e o grau em nós internos (isso permite que as superfícies com descontinuidades G1 possam ser representada). Observe que vetores de nós não unidos são suportados, mas serão convertidos para unidos, com as alterações correspondentes aplicadas ao ponto de controle/dados da espessura.
lines
0.4

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
Retorna os pesos dos pontos de controle da NurbsSurface. Os pesos determinam a influência aplicada por cada ponto de controle no formato da superfície.
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
Retorna os nós da superfície na direção U. Os nós são uma série de valores de parâmetros (duplos) usados para determinar onde e como os pontos de controle afetam a superfície.
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
Retorna os nós da superfície na direção V. Os nós são uma série de valores de parâmetros (duplos) usados para determinar onde e como os pontos de controle afetam a superfície.
Returns: Nurbs V knots of surface