Autodesk.DesignScript.Geometry.IndexGroup.ToString
Obtém uma representação da sequência de caracteres do Grupo de índices

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
Comparar dois grupos de indexação
other: O outro Grupo de indexação
Returns: Se os dois objetos forem iguais

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
Obter um hashcode para este tipo
Returns: Um único hashcode para este objeto

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
Criar um grupo de índices armazenando quatro índices
a: Index a
b: Index b
c: Index c
d: Index d
Returns: IndexGroup
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Criar um grupo de índices armazenando três índices
a: Index a
b: Index b
c: Index c
Returns: IndexGroup
tri,polygon,mesh,meshes