Autodesk.DesignScript.Geometry.Cylinder.ToString
Obtém uma representação da sequência de caracteres do Cilindro

Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Criar um cilindro sólido definido por um CoordinateSystem principal, o raio e a altura do cilindro
coordinateSystem: Sistema de coordenadas principal
radius: Radius size
height: Cylinder height
Returns: Cylinder created from radius and height
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Crie um cilindro sólido com a determinada parte inferior e superior do ponto do centro do cilindro.
startPoint: Start point of cylinder
endPoint: End point of cylinder
radius: Radius  of cylinder
Returns: Cylinder created by points and radius
cylinder,tube,by center points