Autodesk.DesignScript.Geometry.Surface.ToString
Obtém uma representação da sequência de caracteres da Superfície

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
União de um conjunto de superfícies em uma superfície. Esse método poderá retornar uma polissuperfície se a união resultante não for múltipla ou for multifacetada.
surfaces: Um conjunto de superfícies.
Returns: União de superfícies
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Crie uma superfície ao elevar entre as curvas de seção transversal de entrada.
crossSections: Curves to loft through
Returns: Surface created by loft
loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
Crie uma superfície ao elevar entre as curvas de seção transversal de entrada.  Isso é um pouco mais rápido e produz um resultado menos suave que o Surface.ByLoft.
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Eleve a superfície através das seções transversais com curvas guia especificada (aka corrimãos). As curvas guia devem efetuar a intersecção com todas as curvas da seção transversal.
loftbyrail

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Eleve a superfície através das seções transversais com curvas guia especificada (aka corrimãos). As curvas guia devem efetuar a intersecção com todas as curvas da seção transversal.
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Crie uma superfície ao efetuar a extrusão por percurso de uma curva da seção transversal ao longo de um caminho.
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crie uma superfície poligonal conectando os pontos de entrada em um polígono fechado e preenchendo o mesmo.
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Efetuar a extrusão por percurso da curva da seção transversal ao longo de um caminho guiado por dois corrimãos
path: A entrada do caminho para a extrusão por percurso ao longo.
guideRail: Uma guia para guiar a orientação da extrusão por percurso.
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Crie uma superfície ao efetuar a extrusão por percurso da curva do perfil ao redor do raio do eixo formado pelo ponto de origem na direção do vetor do eixo, começando no ângulo inicial em em graus, efetuando a extrusão por percurso do ângulo da extrusão por percurso em graus.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Crie uma superfície ao preencher o interior de um contorno fechado definido por curvas de entrada.
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
A diferença booleana desta superfície e da união das superfícies de entrada. Esse método poderá retornar uma polissuperfície se a operação booleana resultante não for múltipla ou for multifacetada.
others: Outras superfícies a serem subtraídas
Returns: Superfície booleana ou polySurface resultante
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Apare a superfície com um conjunto de um ou mais contornos dentro da superfície de entrada. Um dos contornos tem que ser o contorno de limite da superfície de entrada. Além disso, é necessário que um ou mais contornos internos sejam adicionados aos furos.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
Retorna o normal da superfície no ponto de entrada na superfície.
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
Obtém uma representação Nurbs da superfície em uma tolerância especificada. Este método pode aproximar a superfície em determinadas circunstâncias.

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Obtém uma representação Nurbs da superfície em uma tolerância especificada. Este método pode aproximar a superfície em determinadas circunstâncias.
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Torne mais espessa a superfície em um sólido, efetuando a extrusão na direção de normais de superfície em ambos os lados da superfície.
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Torne mais espessa a superfície em um sólido, efetuando a extrusão na direção de normais de superfície. Se o parâmetro both_sides for verdadeiro, a superfície é tornada mais espessa em ambos os lados.
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
Superfície de deslocamento na direção do normal da superfície pela distância especificada.
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
O sistema de coordenadas retornado usa o EixoX, EixoY e EixoZ para representar o uDir, vDir e normal. O comprimento do EixoX, EixoY representa as curvaturas.
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
Retorna um CoordinateSystem alinhado com as direções da curvatura principal.
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
Retorna o vetor tangente U nos parâmetros U e V especificados.
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
Retorna o vetor da tangente V nos parâmetros U e V especificados.
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
Retorna o vetor normal nos parâmetros U e V especificados.
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
Retornar os derivativos nas coordenadas de entrada U e V.
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
Retorna os vetores da direção principal e os parâmetros U e V.
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
Crie uma curva de linha de parâmetro na superfície determinada. Crie uma curva que representa uma linha de parâmetro u ou v na superfície. Uma linha de parâmetro percorre na direção de aumento do parâmetro u ou v. A curva resultante irá coincidir com a parametrização da superfície e sua faixa será limitada pela faixa do parâmetro da superfície. O tipo de curva retornado irá depender do tipo de superfície.
isoDirection: Se a direção == 0, cria uma linha de parâmetro U, se a direção == 1, cria um parâmetro de linha V .
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Retorna uma nova superfície com a normal invertido. Deixa a superfície inalterada.
Returns: Surface, which is the same as the input surface but with flipped normals

Autodesk.DesignScript.Geometry.Surface.Join(Autodesk.DesignScript.Geometry.Surface)
Combina esta superfície e a superfície de entrada em uma PolySurface
topolysurface

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Combina esta superfície e a superfície de entrada em uma PolySurface
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projeta a geometria de entrada nesta superfície, na direção do vetor de entrada. Atualmente, esse método de projeção só é compatível com pontos ou curvas.
projecttosurface,projectonto