Autodesk.DesignScript.Geometry.Helix.ToString
Obtém uma representação da sequência de caracteres da Hélice

Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Cria uma hélice. A hélice sempre rotaciona no sentido horário sobre o eixo de direção fornecido. Ao visualizar ao longo da direção do eixo de direção, o usuário verá o ponto virando no sentido horário ao redor do eixo quando ele se move ao longo da curva na direção do parâmetro aumentando. O declive é a distância na qual a hélice se move na direção do eixo por vez. Isto pode ser positivo ou negativo.
axisPoint: Axis point
axisDirection: Axis direction vector
startPoint: Helix start point
pitch: Distance of the helix per each 360 degrees in the direction of the axis
angleTurns: How many turns in degrees
Returns: Helix created by axis
helix,screw,corkscrew,thread