Autodesk.DesignScript.Geometry.Mesh.ToString
Obtém uma representação da sequência de caracteres da Malha

Autodesk.DesignScript.Geometry.Mesh.ByPointsFaceIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
Cria uma malha a partir de uma coleção de pontos e uma coleção de grupos de indexação referenciando a coleção de pontos
vertexPositions: List of points that determine vertex positions
indices: Indices for vertices
Returns: Mesh created from points
mesh,meshes