Autodesk.DesignScript.Geometry.PolyCurve.ToString
Obtém uma representação da sequência de caracteres da PolyCurve

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Crie a PolyCurve unindo curvas. Inverte a curva conforme necessário para a conectividade. Escolha uma tolerância de união preferencial entre as unidades 1e-6 e 1e-3.
curves: Curvas a unir na PolyCurve
joinTolerance: Tolerância para determinar o tamanho permitido da lacuna entre curvas a unir
Returns: Policurva criada por curvas unidas
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Crie uma PoliCurve conectando pontos. Defina a entrada 'connectLastToFirst' como verdadeira para fechar a PoliCurve.
points: Pontos para fazer a PolyCurve
connectLastToFirst: Verdadeiro para conectar o último ponto ao primeiro, falso para deixar aberto
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.Curves
Retorna as curvas do policurva
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
Retorna a curva da policurva por índice
index: Comprimento para localizar pontos
endOrStart: Verdadeiro para contar do final da policurva, falso para contar do início da policurva
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
Estende a policurva pelo arco tangente
length: Comprimento do arco de extensão
radius: Raio do arco
endOrStart: extensão do final ou início da PolyCurve

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
A policurva do deslocamento em seu plano.
signedDistance: Valor do deslocamento
extendCircular: Alternar para arredondar os cantos
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
O policurva com concordância em seu plano.
radius: Raio de concordância
rightSide: Verdadeiro para fazer a concordância no lado direito em relação ao início da policurva, falso para fazer a concordância no lado esquerdo
Returns: Filleted polyCurve
round,smooth,radius