Autodesk.DesignScript.Geometry.PolySurface.ToString
Obtém uma representação da sequência de caracteres da PolySurface

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Crie uma poliSuperfície ao efetuar a extrusão por percurso de uma curva ao longo do corrimão.
rail: Curva ao longo da qual efetuar varredura
profile: Perfil de varredura
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Localize as superfícies por ponto. Obtém a a primeira interseção na direção adiante.  Retorna uma superfície se obtiver uma superfície interna, duas se obtiver uma aresta interna e muitas se obtiver o vértice
surfacesatpoint,findsurfaces,extractsurfaces

Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
Retorna o número de superfícies da polissuperfície.
Returns: Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
Retorna o número de arestas da polissuperfície.
Returns: Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
Retorna o número de vértices da polissuperfície.
Returns: Number of vertices