Autodesk.DesignScript.Geometry.Vector.ToString
Obtém uma representação da sequência de caracteres do Vetor

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Comparar dois vetores
other: O outro Vetor
Returns: Se os dois objetos forem iguais

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
Obter um hashcode para este tipo
Returns: Um único hashcode para este objeto

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Forma de um vetor por 3 coordenadas Euclidean
x: Coordenada X
y: Coordenada Y
z: Coordenada Z
Returns: Vector created by coordinates
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Forma de um vetor por 3 coordenadas Euclidean e normalizar o vetor
x: Coordenada X
y: Coordenada Y
z: Coordenada Z
normalized: Verdadeiro para normalizar o vetor, falso para não normalizar
Returns: Vector created by coordinates
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Forma de um vetor por dois pontos finais.  O resultado é um vetor desde o ponto inicial até o ponto final.
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
Obter vetor do eixo X canônico (1,0,0)
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
Obter vetor do eixo Y canônico (0,1,0)
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
Obter vetor do eixo Z canônico (0,0,1)
z,basis,up

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Formar o produto escalar de dois vetores
vec: a second vector
Returns: Resulting dot product
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Determine se dois vetores estão paralelos.
otherVector: Outro vetor
Returns: Returns True if the vectors are parallel; false otherwise.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Determine se dois vetores são quase iguais. Um valor de tolerância de 1e-5 devido a problemas de previsão no manipulador.
otherVector: Outro vetor
Returns: Returns True if the vectors are almost equal; false otherwise.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforma esse vetor pela matriz de entrada do CoordinateSystem
coordinateSystem: Sistema de coordenadas utilizado para transformar o vetor
Returns: Transformed vector

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Rotaciona um vetor em torno de um eixo por um grau especificado
axis: Rotation axis vector
degrees: Number of degrees to rotate
Returns: Rotated vector
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rotaciona um vetor em torno da origem e normal do plano por um grau especificado
plane: Plano de rotação
degrees: Number of degrees to rotate
Returns: Rotated vector
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Vetor de escala de forma uniforme em torno da origem
scale_factor: Scale factor
Returns: Scaled vector
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
Retorna o ângulo entre os dois vetores, de 0 a 180 graus.
otherVector: Other vector
Returns: Returns angle between the supplied vectors in degrees from 0 to 180.
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
Retorna o ângulo entre os dois vetores, no intervalo de [0, 180] graus.
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Retorna o ângulo entre os dois vetores de 0 a 360 graus. Usa o eixo de rotação para determinar a direção do ângulo.
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Retorna o ângulo entre os dois vetores no intervalo de [0, 360] graus. Utiliza o eixo de rotação para determinar a direção do ângulo.
rotation angle