Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
Obter uma representação da sequência de caracteres do TSplineSurface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie um plano da T-Spline "orientado", posicionado no ponto de origem com o vetor normal, mas com uma  orientação específica do eixo X.
Isso não tem impacto para sobre as operações de dividir, efetuar a intersecção, projeto, etc., ele somente especifica a orientação do CoordinateSystem de entrada.
origin: Ponto raiz do plano
normal: Normal do plano
xAxis: Eixo X do plano
minCorner: Ponto 2D do canto mínimo nas coordenadas do plano
maxCorner: Ponto 2D do canto máximo nas coordenadas do plano
xSpans: Número de vãos na largura
ySpans: Número de vãos no comprimento
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Plano da superfície da T-Spline
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie um plano pela origem e o eixo X, Y.
O eixo Z é o produto vetorial dos dois vetores.
origin: Ponto raiz do plano
xAxis: Eixo X do plano
yAxis: Eixo Y do plano
minCorner: Ponto 2D do canto mínimo nas coordenadas do plano
maxCorner: Ponto 2D do canto máximo nas coordenadas do plano
xSpans: Número de vãos na largura
ySpans: Número de vãos no comprimento
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Plano da superfície da T-Spline
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCylinderRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Criar um cilindro da T-Spline definido por um CoordinateSystem principal, o raio e a altura do cilindro
cs: O centro e a base do cilindro serão ajustados no plano X/Y deste sistema de coordenadas
radius: Raio de um cilindro
height: Altura de um cilindro
radiusSpans: Número de vãos na circunferência
heightSpans: Número de vãos na altura
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Superfície de T-Spline cilíndrica
tspline,cylinder,radius,height

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie um cone da T-Spline com um determinado raio base no ponto inicial,
estendendo para para um vértice no ponto final.
startPoint: Ponto inicial de um cone
endPoint: Ponto final de um cone
radius: Raio da base do cone
radiusSpans: Número de vãos na circunferência
heightSpans: Número de vãos na altura
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Superfície de T-Spline cônica
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie um cone da T-Spline com um eixo a partir do ponto inicial até o ponto final, com um determinado raio no início e no final.
Este objeto não tem um vértice e está na forma de um tronco.
startPoint: Ponto inicial de um cone
endPoint: Ponto final de um cone
startRadius: Raio inicial de um cone
endRadius: Raio final de um cone
radiusSpans: Número de vãos na circunferência
heightSpans: Número de vãos na altura
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Superfície de T-Spline cônica
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie um cone de T-Splines com o ponto base na origem do CoordinateSystem, estendendo na direção do eixo Z do CoordinateSystem
com uma base circular no plano XY do CoordinateSystem.
cs: O centro e a base do cone serão ajustados no plano X/Y deste sistema de coordenadas
height: Altura de um cone
radius: Raio de um cone
radiusSpans: Número de vãos na circunferência
heightSpans: Número de vãos na altura
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Superfície de T-Spline cônica
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie um cone da T-Spline com o ponto base na origem do CoordinateSystem, estendendo na direção do eixo Z do CoordinateSystem
com sua base circular no plano XY do CoordinateSystem.
cs: O centro e a base serão ajustados no plano X/Y deste sistema de coordenadas
height: Altura de um cone
startRadius: Raio inicial de um cone
endRadius: Raio final de um cone
radiusSpans: Número de vãos na circunferência
heightSpans: Número de vãos na altura
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Superfície de T-Spline cônica
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie uma esfera de T-Spline centralizada no ponto de entrada, com o raio especificado.
centerPoint: Centro de uma esfera
radius: Raio de uma esfera
radiusSpans: Número de vãos radiais
heightSpans: Número de vãos na altura
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Superfície de T-Spline esférica
tspline,sphere,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie uma esfera de T-Spline que contém quatro pontos de entrada na superfície.
points: Quatro pontos na lista para criar uma esfera. Os pontos não devem ser coplanares
radiusSpans: Número de vãos radiais
heightSpans: Número de vãos na altura
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Superfície de T-Spline esférica
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Criar um toróide da T-Spline com o centro no CoordinateSystem de origem e um determinado raio
cs: O toróide será alinhado com o plano X-Y do sistema de coordenadas especificado com centro em sua origem
innerRadius: Raio interno de um toróide
outerRadius: Raio externo de um toróide
innerRadiusSpans: Número de vãos radiais internos
outerRadiusSpans: Número de vãos radiais externos
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Superfície de T-Spline toróide
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Criar um toróide da T-Spline com um determinada centro e raio, alinhado com o plano universal XY padrão.
center: Centro de um toróide
innerRadius: Raio interno de um toróide
outerRadius: Raio externo de um toróide
innerRadiusSpans: Número de vãos radiais internos
outerRadiusSpans: Número de vãos radiais externos
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Superfície de T-Spline toróide
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie uma caixa da T-Spline centralizada no ponto de entrada, com uma largura, comprimento e altura especificados.
origin: Centro de uma caixa
width: Largura de uma caixa
length: Comprimento de uma caixa
height: Altura de uma caixa
xSpans: Número de vãos na largura
ySpans: Número de vãos no comprimento
zSpans: Número de vãos na altura
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Cubóide da T-Spline
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie uma caixa da T-Spline centralizada e orientada ao CoordinateSystem de entrada, com uma largura, comprimento e altura especificados.
cs: O plano X/Y da caixa será alinhado com o eixo X correspondente
width: Largura de uma caixa
length: Comprimento de uma caixa
height: Altura de uma caixa
xSpans: Número de vãos na largura
ySpans: Número de vãos no comprimento
zSpans: Número de vãos na altura
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Cubóide da T-Spline
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie uma caixa da T-Spline expandindo do ponto baixo para o ponto alto.
lowPoint: Primeiro ponto de canto
highPoint: Segundo ponto de canto
xSpans: Número de vãos na largura
ySpans: Número de vãos no comprimento
zSpans: Número de vãos na altura
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Cubóide da T-Spline
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie um quadball T-Spline com o centro na origem do CoordinateSystem e determinado raio.
cs: Sistema de coordenadas local
radius: Raio do quadball
spans: Número de vãos em duas dimensões dos lados do quadball
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Quadball T-Spline
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie um quadball T-Spline com determinado centro e raio, alinhado com o plano universal XY padrão.
center: Ponto do centro do quadball
radius: Raio do quadball
spans: Número de vãos em duas dimensões dos lados do quadball
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Quadball T-Spline
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Construir a superfície da T-Spline a partir da superfície NURBS usando a estratégia uniforme.
A superfície NURBS de entrada é reconstruída com nós uniformes colocados em intervalos paramétricos iguais ou do comprimento de arco dependendo do sinalizador useArcLen utilizado, e estimados por uma superfície NURBS de grau 3. A T-Spline de saída é dividida pela determinada contagem de vãos nas direções u e v.
nurbsSurface: Superfície NURBS de entrada
uSpans: Número necessário de vãos na direção u
vSpans: Número necessário de vãos na direção v
uUseArcLen: Se deve ser usado o comprimento do arco ou a subdivisão paramétrica na direção paramétrica u
vUseArcLen: Se deve ser usado o comprimento do arco ou a subdivisão paramétrica na direção paramétrica v
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
Construir a superfície da T-Spline a partir da superfície NURBS usando a estratégia de subdivisão da curvatura.
A superfície NURBS de entrada é reconstruída para grau 3. A T-Spline de saída tem contagens de vãos e
posições em cada direção automaticamente detectada dependendo da curvatura.
nurbsSurface: Superfície NURBS de entrada
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByExtrude(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Construir uma T-Spline ao efetuar a extrusão de uma curva ao longo do vetor fornecido.
curve: Curva de perfil
direction: Vetor de extrusão
frontDistance: A distância da extrusão pela direção do vetor
backDistance: A distância da extrusão contra a direção do vetor
frontSpans: Número de vãos por vetor de direção. Nenhuma extrusão pela direção do vetor será executada se 0 for  passado
backSpans: Número de vãos contra a direção do vetor. Nenhuma extrusão contra a direção do vetor será executada se 0 for passado
profileSpans: Número de vãos em direção do perfil. Definido automaticamente se for 0 ou menos
uniform: Utilize a estratégia uniforme ou de curvatura para a distribuição de vãos ao longo da direção do perfil
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
tspline,extrude,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Construa uma T-Spline efetuando a extrusão por percurso de uma curva da seção transversal ao longo de um caminho.
profile: Curva de perfil
path: Curva do caminho
parallel: Seus vãos devem ser paralelos na direção do caminho
pathSpans: Número de vãos no caminho
profileSpans: Número de vãos no perfil. Definido automaticamente se for 0 ou menos
pathUniform: Utilizar a estratégia uniforme ou de curvatura para a distribuição dos vãos ao longo do caminho
profileUniform: Utilizar a estratégia uniforme ou de curvatura para a distribuição dos vãos ao longo do perfil
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crie uma superfície de T-Spline efetuando a extrusão por percurso da curva do perfil ao redor do eixo formado
pelo eixo de origem e a direção do eixo, começando em start_angle em graus,
e efetuando a extrusão por percurso por sweep_angle em graus.
profile: Curva de perfil
axisOrigin: Centro de rotação
axisDirection: Eixo de rotação
startAngle: Ângulo no qual iniciar a rotação
sweepAngle: Ângulo no qual concluir a rotação
radialSpans: Número de vãos no raio
axialSpans: Número de vãos na altura. Definido automaticamente se for 0 ou menos
uniform: Utilizar a estratégia uniforme ou de curvatura para a distribuição dos vãos
symmetry: Opções de simetria de uma superfície da T-Spline
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Crie uma superfície com tubulação de uma rede de curvas ou linhas.
Uma junta suave é criada em cada intersecção de curva.
Alguns parâmetros têm valor único ou da lista - dois valores por curva.
curves: Uma lista de curvas a partir da qual criar tubulações
defaultRadius: Raio padrão para as tubulações criadas
snappingTolerance: A tolerância usada para detectar intersecções de curvas
segmentsCount: Número de segmentos em cada tubulação. Valor único ou de lista, duas vezes mais longo do que a contagem das curvas, é permitido
endRotations: Valores das rotações da extremidade para cada tubulação (em graus). Valor único ou de lista, duas vezes mais longo do que a contagem das curvas, é permitido
endRadii: Valores dos raios da extremidade para cada tubulação. Valor único ou de lista, duas vezes mais longo do que a contagem das curvas, é permitido
endPercentage: Valores (0 a 1) a partir do final de cada curva para iniciar a malha da tubulação. Valor único ou de lista, duas vezes mais longo do que a contagem das curvas, é permitido
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Crie uma superfície com tubulação de uma rede de curvas ou linhas.
Uma junta suave é criada em cada interseção de curva.
Alguns parâmetros assumem um valor ou uma lista única – um valor por curva.
curves: Uma lista de curvas a partir da qual as tubulações são criadas
defaultRadius: Raio padrão das tubulações criadas
snappingTolerance: A tolerância usada para detectar intersecções de curvas
segmentsCount: Números de segmentos de cada curva. O tamanho da lista pode ser a contagem de curvas, 1 para replicação ou 0 para determinação automática.
autoHandleStart: Se verdadeiro, os parâmetros do manipulador no início de cada curva são gerados automaticamente, e os parâmetros personalizados de rotationsAtStart, radiiAtStart e positionsAtStart são ignorados.
autoHandleEnd: Se verdadeiro, os parâmetros do manipulador no fim de cada curva são gerados automaticamente, e os parâmetros personalizados de rotationsAtEnd, radiiAtEnd e positionsAtEnd são ignorados.
startRotations: Ângulo de rotação personalizado em graus de cada manipulador de tubulação no início de cada curva. Esse parâmetro é ignorado quando autoHandleStart é verdadeiro. O tamanho da lista pode ser a contagem da curva ou 1 para replicação.
endRotations: Ângulo de rotação personalizado em graus de cada manipulador de tubulação no fim de cada curva. Esse parâmetro é ignorado quando autoHandleEnd é verdadeiro. O tamanho da lista pode ser a contagem da curva ou 1 para replicação.
startRadii: Raio personalizado de cada manipulador de tubulação no início de cada curva. Esse parâmetro é ignorado quando autoHandleStart é verdadeiro. O tamanho da lista pode ser a contagem da curva ou 1 para replicação.
endRadii: Raio personalizado de cada manipulador de tubulação no final de cada curva. Esse parâmetro é ignorado quando autoHandleEnd é verdadeiro. O tamanho da lista pode ser a contagem da curva ou 1 para replicação.
startPositions: Posição personalizada de cada manipulador de tubulação no início de cada curva em porcentagem entre 0 e 1 ao longo do comprimento do arco da curva. Esse parâmetro é ignorado quando autoHandleStart é verdadeiro. O tamanho da lista pode ser a contagem da curva ou 1 para replicação. As posições inicial e final não devem se sobrepor em cada curva. De preferência, a posição inicial deve ser próxima a 0, enquanto a posição final deve ser próxima a 1.
endPositions: Posição personalizada de cada manipulador de tubulação no final de cada curva em porcentagem entre 0 e 1 ao longo do comprimento do arco da curva. Esse parâmetro é ignorado quando autoHandleEnd é verdadeiro. O tamanho da lista pode ser a contagem da curva ou 1 para replicação. As posições inicial e final não devem se sobrepor em cada curva. De preferência, a posição inicial deve ser próxima a 0, enquanto a posição final deve ser próxima a 1.
inSmoothMode: Mostrar a superfície da T-Spline na caixa ou em visualização suave
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
Combine as determinadas superfícies de T-Spline em uma única superfície.
A superfície pode não estar conectada uma à outra.
Se ao menos uma superfície estiver no modo de caixa - a superfície de saída estará também no modo de caixa.
tSplineSurfaces: Superfícies da T-Spline para combinar
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
Se a T-Spline está na caixa ou no modo suave
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
Se a T-Spline estiver aberta.
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Converter a superfície de T-Spline em sólido ou superfície dependendo da forma
matchTopology: Determina se o corpo resultante deve ter a mesma topologia que a da T-Spline
Returns: Entidade de topologia (sólido ou superfície)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
Converter a superfície T-Spline em malha. A malha pode ter triângulos e quadrados.
minSegments: O número mínimo de segmentos em cada direção. Ao menos um segmento sempre será produzido.
tolerance: Distância máxima permitida da malha até a superfície. Definir o valor como zero ou negativo irá desativar seu uso
Returns: Entidade de malha
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
Soldar a lista de vértices especificada em um único vértice.
vertices: Vértices a soldar
newPosition: Posição da alça do vértice do resultado. Posição média das alças é utilizado se nulo for passado.
keepSubdCreases: Preservar as dobras subdivididas da topologia de entrada
Returns: Superfície da T-Spline com vértices soldados
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Boolean)
Vértices de solda do primeiro e do segundo grupo em pares.
O primeiro grupo é considerado como vértices desta T-Spline.
O segundo grupo de vértices pode ser desta superfície ou de qualquer outra.
No caso de T-Splines diferentes, combinar é executado antes da operação de solda
firstGroup: O primeiro grupo de vértices para soldar
secondGroup: O segundo grupo de vértices para soldar
keepSubdCreases: Preservar as dobras subdivididas da topologia de entrada
Returns: Superfície da T-Spline com vértices soldados
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Desfazer a solda de todas as arestas especificadas. Isso irá desfazer a solda de cada um dos vértices de todas as arestas.
edges: Um conjunto de arestas para desfazer a solda
Returns: Superfície da T-Spline com arestas não soldadas
tspline,unweld,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Desfazer a solda de todos os vértices especificados. Todas as arestas de cada vértice terão a solta desfeita.
vertices: Um conjunto de vértices para desfazer a solda
Returns: Superfície da T-Spline com vértices não soldados
tspline,unweld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Criar a correspondência com a T-Spline e o contorno fechado de curvas
tsEdges: Contorno de aresta fechado da T-Spline com o qual criar correspondência
curves: Curva de contorno fechado com a qual criar correspondência
continuity: Continuidade da geometria para tentar corresponder: G0, G1, G2
useArclength: Se deve ser usado o alinhamento de arcLength durante a criação de correspondência
useRefinement: Se verdadeiro, os pontos de controle extra serão adicionados à T-Spline para corresponder às superfícies dentro de uma determinada tolerância.
numRefinementSteps: Número máximo de etapas de refinamento. Ignorado se useRefinement estiver definido como falso
refinementTolerance: Tolerância a atingir. Ignorada se useRefinement estiver definido como falso
usePropagation: Se deve ser usada a propagação durante a criação de correspondência
widthOfPropagation: Determina o quanto da superfície será afetada pela correspondência. Ignorado se usePropagation estiver definido como falso
tangentScale: Escala de tangente. Se a continuidade não estiver definida como G1, é ignorada
curvParamWeight: Peso do parâmetro de curvatura. Se a continuidade não estiver definida como G2, é ignorada
flipSourceTargetAlignment: Se deve ser feita a reversão da direção do alinhamento
Returns: A superfície da T-Spline posicionada entre determinadas arestas da borda de T-Spline e a curva de contorno
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Criar a correspondência com a T-Spline e o contorno fechado de curvas
tsEdges: Contorno de aresta fechado da T-Spline com o qual a correspondência será criada
curves: Curva de contorno fechado com a qual a correspondência será criada
continuity: Continuidade da geometria para tentar corresponder: G0, G1, G2
useArclength: Se deve ser usado o alinhamento de arcLength durante a criação de correspondência
useRefinement: Se verdadeiro, os pontos de controle extra serão adicionados à T-Spline para corresponder às superfícies dentro de uma determinada tolerância.
numRefinementSteps: Número máximo de etapas de refinamento. Será ignorado se useRefinement estiver definido como falso
refinementTolerance: Tolerância a atingir. Será ignorada se useRefinement estiver definido como falso
usePropagation: Se deve ser usada a propagação durante a criação de correspondência
widthOfPropagation: Determina o quanto da superfície será afetada pela correspondência. Será ignorado se usePropagation estiver definido como falso
scale: Escala de tangente para G1 ou escala de curvatura para G2. Se a continuidade for G0, será ignorada.
flipSourceTargetAlignment: Se deve ser feita a reversão da direção do alinhamento
Returns: A superfície da T-Spline posicionada entre determinadas arestas da borda de T-Spline e a curva de contorno
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Crie a correspondência com a T-Spline e contorno fechado de arestas BRep. Primeiro,
o contorno de aresta é convertido em um contorno de curva e, a seguir, a correspondência é executada
tsEdges: Contorno de aresta fechado da T-Spline com o qual criar correspondência
brepEdges: Contorno da aresta BRep fechado com o qual criar a correspondência
continuity: Continuidade da geometria para tentar corresponder: G0, G1, G2
useArclength: Se deve ser usado o alinhamento de arcLength durante a criação de correspondência
useRefinement: Se verdadeiro, os pontos de controle extra serão adicionados à T-Spline para corresponder às superfícies dentro de uma determinada tolerância.
numRefinementSteps: Número máximo de etapas de refinamento. Ignorado se useRefinement estiver definido como falso
refinementTolerance: Tolerância a atingir. Ignorada se useRefinement estiver definido como falso
usePropagation: Se deve ser usada a propagação durante a criação de correspondência
widthOfPropagation: Determina o quanto da superfície será afetada pela correspondência. Ignorado se usePropagation estiver definido como falso
tangentScale: Escala de tangente. Se a continuidade não estiver definida como G1, é ignorada
curvParamWeight: Peso do parâmetro de curvatura. Se a continuidade não estiver definida como G2, é ignorada
flipSourceTargetAlignment: Se deve ser feita a reversão da direção do alinhamento
Returns: A superfície da T-Spline posicionada entre determinadas arestas da borda de T-Spline e o contorno da aresta BRep
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
Alterar o estilo de visualização da T-Spline.
Visualização suave se verdadeiro passou, caso contrário, caixa.
enable: Ativar ou desativar a visualização suave
Returns: T-Spline com o estilo de visualização escolhido
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Construir a ponte entre dois conjunto de faces. Itens do
primeiro grupo são considerados como secundários desta superfície. Itens do
segundo grupo podem ser secundários desta superfície ou pertencer a outra
superfície. A topologia dentro de cada grupo pode não ser
adjacente, mas deve criar a mesma contagem de contornos distintos.
firstGroup: O primeiro grupo de faces para efetuar a ponte
secondGroup: O segundo grupo de faces para efetuar a ponte
followCurves: Efetuar a ponte das curvas para cada contorno de topologia distinta
(linhas retas são utilizados se lista vazia for passada, se uma curva
passada ela é duplicada se mais de uma contorno de entrada for detectado)
frameRotations: Número de rotações completas em torno
do normal das estruturas ao longo da curva de ponte para cada
contorno distinto da topologia (0 é utilizado se uma lista vazia for passada, se um valor
for passado ele é duplicado se mais de um contorno de entrada for detectado)
spansCounts: Número de segmentos ao longo da ponte para
cada contorno de topologia distinta. A contagem de vãos para cada grupo deveria ser
maior do que o número correspondente de rotações (1 é utilizado se uma lista
vazia for passada, se um valor for passado ele é duplicado se mais de
um contorno de entrada for detectado)
cleanBorderBridges: Excluir pontes entre as arestas da borda.
keepSubdCreases: Preservar a dobras subdivididas da topologia de entrada
firstAlignVertices: Lista de vértices orientados para
cada contorno da topologia distinta do primeiro grupo (o número de vértices deve
ser o mesmo que os contornos de entrada detectados ou a lista pode estar vazia)
secondAlignVertices: Lista de vértices orientados para
cada contorno da topologia distinta do primeiro grupo (o número de vértices deve
ser o mesmo que os contornos de entrada detectados ou a lista pode estar vazia)
flipAlignmentFlags: Lista de sinalizadores indicando que se
é para o inverter o alinhamento da ponte para o contorno da topologia correspondente.
(falso é definido se uma lista vazia for passada, se um valor for passado ele é duplicado para cada contorno de entrada detectado)
Returns: Superfície da T-Spline com topologia, conectada por ponte
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Construir a ponte entre o conjunto de arestas e um conjunto de faces. Itens do
primeiro grupo são considerados como secundários desta superfície. Itens do
segundo grupo podem ser secundários desta superfície ou pertencer a outra
superfície. A topologia dentro de cada grupo pode não ser
adjacente, mas deve criar a mesma contagem de contornos distintos.
firstGroup: O primeiro grupo de faces para efetuar a ponte
secondGroup: O segundo grupo de arestas para efetuar a ponte
followCurves: Efetuar a ponte das curvas para cada contorno de topologia distinta
(linhas retas são utilizados se lista vazia for passada, se uma curva
passada ela é duplicada se mais de uma contorno de entrada for detectado)
frameRotations: Número de rotações completas em torno
do normal das estruturas ao longo da curva de ponte para cada
contorno distinto da topologia (0 é utilizado se uma lista vazia for passada, se um valor
for passado ele é duplicado se mais de um contorno de entrada for detectado)
spansCounts: Número de segmentos ao longo da ponte para
cada contorno de topologia distinta. A contagem de vãos para cada grupo deveria ser
maior do que o número correspondente de rotações (1 é utilizado se uma lista
vazia for passada, se um valor for passado ele é duplicado se mais de
um contorno de entrada for detectado)
cleanBorderBridges: Excluir pontes entre as arestas da borda.
keepSubdCreases: Preservar a dobras subdivididas da topologia de entrada
firstAlignVertices: Lista de vértices orientados para
cada contorno da topologia distinta do primeiro grupo (o número de vértices deve
ser o mesmo que os contornos de entrada detectados ou a lista pode estar vazia)
secondAlignVertices: Lista de vértices orientados para
cada contorno da topologia distinta do primeiro grupo (o número de vértices deve
ser o mesmo que os contornos de entrada detectados ou a lista pode estar vazia)
flipAlignmentFlags: Lista de sinalizadores indicando que se
é para o inverter o alinhamento da ponte para o contorno da topologia correspondente.
(falso é definido se uma lista vazia for passada, se um valor for passado ele é duplicado para cada contorno de entrada detectado)
Returns: Superfície da T-Spline com topologia, conectada por ponte
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Construir a ponte entre o conjunto de arestas e um conjunto de faces. Itens do
primeiro grupo são considerados como secundários desta superfície. Itens do
segundo grupo podem ser secundários desta superfície ou pertencer a outra
superfície. A topologia dentro de cada grupo pode não ser
adjacente, mas deve criar a mesma contagem de contornos distintos.
firstGroup: O primeiro grupo de arestas para efetuar a ponte
secondGroup: O segundo grupo de faces para efetuar a ponte
followCurves: Efetuar a ponte das curvas para cada contorno de topologia distinta
(linhas retas são utilizados se lista vazia for passada, se uma curva
passada ela é duplicada se mais de uma contorno de entrada for detectado)
frameRotations: Número de rotações completas em torno
do normal das estruturas ao longo da curva de ponte para cada
contorno distinto da topologia (0 é utilizado se uma lista vazia for passada, se um valor
for passado ele é duplicado se mais de um contorno de entrada for detectado)
spansCounts: Número de segmentos ao longo da ponte para
cada contorno de topologia distinta. A contagem de vãos para cada grupo deveria ser
maior do que o número correspondente de rotações (1 é utilizado se uma lista
vazia for passada, se um valor for passado ele é duplicado se mais de
um contorno de entrada for detectado)
cleanBorderBridges: Excluir pontes entre as arestas da borda.
keepSubdCreases: Preservar a dobras subdivididas da topologia de entrada
firstAlignVertices: Lista de vértices orientados para
cada contorno da topologia distinta do primeiro grupo (o número de vértices deve
ser o mesmo que os contornos de entrada detectados ou a lista pode estar vazia)
secondAlignVertices: Lista de vértices orientados para
cada contorno da topologia distinta do primeiro grupo (o número de vértices deve
ser o mesmo que os contornos de entrada detectados ou a lista pode estar vazia)
flipAlignmentFlags: Lista de sinalizadores indicando que se
é para o inverter o alinhamento da ponte para o contorno da topologia correspondente.
(falso é definido se uma lista vazia for passada, se um valor for passado ele é duplicado para cada contorno de entrada detectado)
Returns: superfície da T-Spline com topologia, conectada por ponte
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Construir a ponte entre dois conjunto de arestas. Itens do
primeiro grupo são considerados como secundários desta superfície. Itens do
segundo grupo podem ser secundários desta superfície ou pertencer a outra
superfície. A topologia dentro de cada grupo pode não ser
adjacente, mas deve criar a mesma contagem de contornos distintos.
firstGroup: O primeiro grupo de arestas para efetuar a ponte
secondGroup: O segundo grupo de arestas para efetuar a ponte
followCurves: Efetuar a ponte das curvas para cada contorno de topologia distinta
(linhas retas são utilizados se lista vazia for passada, se uma curva
passada ela é duplicada se mais de uma contorno de entrada for detectado)
frameRotations: Número de rotações completas em torno
do normal das estruturas ao longo da curva de ponte para cada
contorno distinto da topologia (0 é utilizado se uma lista vazia for passada, se um valor
for passado ele é duplicado se mais de um contorno de entrada for detectado)
spansCounts: Número de segmentos ao longo da ponte para
cada contorno de topologia distinta. A contagem de vãos para cada grupo deveria ser
maior do que o número correspondente de rotações (1 é utilizado se uma lista
vazia for passada, se um valor for passado ele é duplicado se mais de
um contorno de entrada for detectado)
cleanBorderBridges: Excluir pontes entre as arestas da borda.
keepSubdCreases: Preservar a dobras subdivididas da topologia de entrada
firstAlignVertices: Lista de vértices orientados para
cada contorno da topologia distinta do primeiro grupo (o número de vértices deve
ser o mesmo que os contornos de entrada detectados ou a lista pode estar vazia)
secondAlignVertices: Lista de vértices orientados para
cada contorno da topologia distinta do primeiro grupo (o número de vértices deve
ser o mesmo que os contornos de entrada detectados ou a lista pode estar vazia)
flipAlignmentFlags: Lista de sinalizadores indicando que se
é para o inverter o alinhamento da ponte para o contorno da topologia correspondente.
(falso é definido se uma lista vazia for passada, se um valor for passado ele é duplicado para cada contorno de entrada detectado)
Returns: Superfície da T-Spline com topologia, conectada por ponte
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
Preencher furos em uma T-Spline
edges: Conjunto de arestas com furo interno. As arestas devem ser de borda.
fillMethod: Método para preencher furo: 0 - suavização de serrilhado, 1 - polígonos, 2 - retrair, 3 - retrair e soldar
keepSubdCreases: Preservar as dobras subdivididas da topologia de entrada
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
Compactar toda a topologia na superfície e tornar os índices contíguos. Esta função mantém a ordem relativa dos índices.
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
A interpolação adiante move os pontos de controle para suas localizações paramétricas na superfície. A interpolação reversa gera um ponto sobre a superfície para cada ponto de controle original e move este ponto de controle para seu ponto na superfície correspondente.
reverse: Direção de interpolação: adiante se falso, reversa caso contrário
Returns: Interpolação da T-Spline em uma determinada direção
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Copiar as faces selecionadas para a nova superfície. A nova superfície não tem nenhuma simetria
faces: Faces a duplicar
Returns: Superfície T-Spline com somente as faces selecionadas
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Mover determinados vértices ao longo de um determinado vetor
vertices: Lista do vértice a ser movido
vector: Direção ao logo da qual mover
onSurface: Sinalizador indicando se deve ser usada a superfície ou pontos de controle de vértices

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSS(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface},System.String)
Exportar o determinado conjunto de superfícies da T-Spline para o arquivo de cena da T-Spline
tSplineSurfaces: Conjunto de superfícies de T-Spline para exportar
filePath: Caminho para o arquivo ao qual salvar
Returns: Caminho do arquivo onde o conjunto de T-Spline está sendo salvo
tspline,export,save,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface,System.String)
Exportar determinada superfície da T-Spline para o arquivo de malha da T-Spline
tSplineSurface: Superfície T-Spline para exportar
filePath: Caminho para o arquivo ao qual salvar
Returns: Caminho do arquivo onde a superfície T-Spline está sendo salva
tspline,export,save,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
Gravar a superfície T-spline em uma sequência de caracteres no formato de malha T-Spline.
tSplineSurface: A superfície T-spline para serializar
Returns: Sequência de caracteres na qual a superfície T-Spline está sendo serializada
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
Crie uma superfície da T-Spline com base na sequência de caracteres no formato de malha T-Spline.
content: Representação da sequência de caracteres do arquivo de malha T-Spline
inSmoothMode: Mostrar superfície da T-Spline na caixa ou visualização suave
Returns: Superfície da T-Spline recém carregada na lista
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
Carregar uma superfície de T-Spline de determinado arquivo de malha T-Spline
filePath: Caminho para o arquivo do qual carregar
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Superfície T-Spline recém carregada na lista
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.IO.FileInfo,System.Boolean)
Carregar uma superfície de T-Spline de determinado arquivo de malha T-Spline
file: Arquivo do qual carregar
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Superfície T-Spline recém carregada na lista
tspline,import,load,tsm,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
Carregar conjunto de superfícies de T-Spline a partir de um determinado arquivo de cena de T-Spline
filePath: Caminho para o arquivo do qual carregar
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Um conjunto de superfícies da T-Spline recém carregado
tspline,import,load,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.IO.FileInfo,System.Boolean)
Carregar conjunto de superfícies de T-Spline a partir de um determinado arquivo de cena de T-Spline
file: Arquivo do qual carregar
inSmoothMode: Exibir a superfície da T-Spline na caixa ou visualização suave
Returns: Um conjunto de superfícies da T-Spline recém carregado
tspline,import,load,tss,file