Autodesk.DesignScript.Geometry.Line.ToString
Obtém uma representação da sequência de caracteres da Linha

Autodesk.DesignScript.Geometry.Line.ByStartPointEndPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Cria uma linha reta entre dois pontos de entrada.
startPoint: Line start point
endPoint: Line end point
Returns: Line from start and end point
line,linebypoints,lines

Autodesk.DesignScript.Geometry.Line.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Cria uma linha de melhor aproximação da dispersão de uma plotagem de pontos.
bestFitPoints: List of points to best fit line
Returns: Line from fit through points
line,approximate,lines

Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Crie uma linha tangente à curva de Entrada, posicionada no ponto do parâmetro da curva de entrada.
curve: Base curve for tangent line
parameter: Parameter value
Returns: Tangent line
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Crie uma linha reta começando no ponto inicial, estendendo-se na direção do vetor pelo comprimento especificado.
startPoint: Line start point
direction: Direction vector
length: Length of line
Returns: Line from start direction and length
linebyvector,lines