Autodesk.DesignScript.Geometry.BoundingBox.ToString
Obtém uma representação da sequência de caracteres da BoundingBox

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Comparar duas BoundingBox
other: A outra BoundingBox
Returns: Se os dois objetos forem iguais

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
Obter um hashcode para este tipo
Returns: Um único hashcode para este objeto

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
Crie uma BoundingBox alinhada com o eixo em torno de geometria de entrada.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Crie uma BoundingBox alinhada com o eixo em torno de geometria de entrada.
geom: Geometries to determine bounding box
Returns: Bounding box enclosing geometries
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
Crie uma BoundingBox não alinhada com o eixo em torno de geometria de entrada., orientada nos eixos X, Y e Z do CoordinateSystem.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
Crie uma BoundingBox não alinhada com o eixo em torno de geometria de entrada., orientada nos eixos X, Y e Z do CoordinateSystem.
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
Cria uma BoundingBox a partir de coordenadas mínimas (canto inferior traseiro esquerdo da caixa, para coordenadas máximas (canto superior dianteiro direito da caixa). O CoordinateSystem é a transformação DE do espaço da da caixa PARA o espaço do modelo. Este método foi desenvolvido para coincidir com a API do Revit, permitindo-lhe extrair os parâmetros de uma BoundingBox do Revit sem quaisquer conversões.
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
O CoordinateSystem que é definido por esta BoundingBox

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Obter a intersecção de duas caixas delimitadoras
other: Other bounding box to intersect
Returns: Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Determinar se duas caixas delimitadoras efetuam a intersecção
other: Other bounding box
Returns: Do bounding boxes intersect
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
Determinar se a BoundingBox está vazia
Returns: Returns true if the bounding box is empty