Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
Obtém uma representação da sequência de caracteres do TSplineTopology

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
Retornar o vértice em um índice especificado
index: Índice no qual obter o vértice
Returns: Vértices da T-Spline
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
Retornar a aresta ao índice especificado
index: Índice no qual obter a aresta
Returns: Aresta da T-Spline
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
Retornar a face ao índice especificado
index: Índice no qual obter a face
Returns: Face da T-Spline
tspline,face,byindex