Autodesk.DesignScript.Geometry.Face.ToString
Obtém uma representação da sequência de caracteres da Face

Autodesk.DesignScript.Geometry.Face.SurfaceGeometry
A superfície subjacente que compõem a face
Returns: Surface representation of face