Autodesk.DesignScript.Geometry.Sphere.ToString
Obtém uma representação da sequência de caracteres da Esfera

Autodesk.DesignScript.Geometry.Sphere.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Crie uma esfera sólida centralizada no ponto de entrada, com o raio especificado.
Brep,brep