Autodesk.DesignScript.Geometry.Plane.ToString
Obtém uma representação da sequência de caracteres do Plano

Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Crie um plano centralizado no ponto raiz, com o vetor normal de entrada.
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crie um plano “orientado”, posicionado na origem do ponto com o vetor normal, mas com uma orientação específica do eixo X. Isso não tem impacto para dividir, efetuar a intersecção, no projeto e em operações, isso somente especifica a orientação de CoordinateSystem de entrada.
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Os eixos X e Y estão no plano. O eixo Z é o produto vetorial dos dois vetores.
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Ajusta um plano para os pontos de entrada; basicamente um ajuste scatterplot 3D.
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Crie o plano que contém a linha de entrada e o ponto externo. O ponto não pode estar na linha ou no eixo da linha.
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
Cria um plano no XY universal
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
Cria um plano no plano XZ universal
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
Cria um plano no YZ universal
Returns: Plane at YZ plane of world

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
Produz um novo CoordinateSystem representando este plano. Ele tem base na origem e com base nos eixos X e Y.
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
Crie um novo deslocamento do plano por este plano na direção normal pela distância especificada.
alongnormal,moveplane