Autodesk.DesignScript.Geometry.Curve.ToString
Obtém uma representação da sequência de caracteres da Curva

Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
Criar uma curva por linha de superfície no espaço uv
baseSurface: Superfície a ser usada
startParams: UV inicial no qual a curva se iniciará
endParams: UV final no qual a curva se finalizará
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Cria uma curva que se mescla entre duas curvas
curve1: Primeira curva para mesclar
curve2: Segunda curva para mesclar
endOrStart1: sinalizador para indicar qual extremidade da curva1 será mesclada
endOrStart2: sinalizador para indicar qual extremidade da curva1 será mesclada
isG2Continuous: sinalizador para indicar se a curva resultante é de continuidade G1 ou de continuidade G2
Returns: Curva resultante da mesclagem de duas curvas
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
Criar uma curva por linha ISO da superfície
baseSurface: Superfície base
direction: se 0 isolinha está ao longo da direção U, se 1 está ao longo da direção V
parameter: fixo para o valor de curva de outros parâmetros de superfície
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
Obter um CoordinateSystem com a origem no ponto no parâmetro fornecido. O EixoX é alinhado com o normal da curva, o EixoY é alinhado com a tangente da curva neste ponto, e o EixoZ é alinhado com o vetor para cima ou a binormal neste ponto
param: O parâmetro no qual avaliar
Returns: CoordinateSystem no parâmetro da curva
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
Retorna um plano cujo normal se alinha com a tangente da curva. Os parâmetros são ajustados para que 0 sempre seja o ponto inicial e 1 sempre seja o ponto final.
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtDistance(System.Double)
Obter um ponto em um determinado comprimento do arco ao longo da curva
segmentLength: A distância ao longo da curva na qual avaliar
Returns: O ponto no comprimento de arco dado
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
Retorna os pontos espaçados por igual ao longo do comprimento da curva com base no número de entrada das divisões
divisions: Número de divisões
Returns: Pontos espaçados por igual ao longo do comprimento da curva

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
Retorna os pontos espaçados ao longo da curva com igual comprimento de corda com base no número de entrada das divisões
divisions: Número de divisões
Returns: Lista de pontos na curva

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Retorna os pontos espaçados por igual ao longo da curva em determinado comprimento de segmento e a partir do ponto dado
point: O ponto de referência a partir de onde medir
segmentLength: A distância ao longo da curva na qual avaliar
Returns: Lista de pontos na curva

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Retorna os pontos espaçados na curva em determinado comprimento de corda a partir do ponto dado
point: O ponto de referência a partir de onde medir
chordLength: Comprimento da corda
Returns: Lista de pontos na curva

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
Retorna um CoordinateSystem na distância especificada a partir do ponto inicial da curva. O eixo Y fica tangente à curva, o eixo X é a curvatura.
segmentLength: A distância ao longo da curva na qual avaliar
Returns: Sistema de coordenadas em curva
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtDistance(System.Double)
Retorna um CoordinateSystem na distância especificada a partir do ponto inicial da curva. O eixo Y fica tangente à curva, o eixo X é a curvatura.
segmentLength: A distância ao longo da curva na qual avaliar
Returns: Sistema de coordenadas em curva
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
Retorna um plano na distância especificada ao longo da curva a partir do ponto inicial. A normal do plano está alinhada à tangente da curva.
segmentLength: A distância ao longo da curva na qual avaliar
Returns: Plano em curva
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PlaneAtDistance(System.Double)
Retorna um plano na distância especificada ao longo da curva a partir do ponto inicial. A normal do plano está alinhada à tangente da curva.
segmentLength: A distância ao longo da curva na qual avaliar
Returns: Plano em curva
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
Obtenha o comprimento do segmento medido desde o ponto inicial da curva até o parâmetro determinado.
param: Valor entre 0 e 1
Returns: Comprimento do segmento
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtDistance(System.Double)
Obter o parâmetro em um determinado comprimento do arco ao longo da curva.
segmentLength: A distância ao longo da curva na qual avaliar
Returns: O parâmetro
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.LengthBetweenParameters(System.Double,System.Double)
Obter o comprimento do arco entre dois pontos de parâmetro na curva
startParam: O início do domínio
endParam: O final do domínio
Returns: O comprimento do arco entre dois parâmetros
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Obtenha o parâmetro em um determinado ponto ao longo da curva. Se o ponto não estiver na curva, será obtido o parâmetro mais próximo. Se a curva de entrada for uma PolyCurve, essa função retornará um parâmetro válido somente se o ponto estiver inserido na PolyCurve. Para outros tipos de curva, essa função retornará o parâmetro ao longo da curva que está no ponto mais próximo do ponto de entrada.
point: Um ponto ao longo da curva ou perto dela
Returns: O parâmetro da curva para PolyCurves ou o parâmetro mais próximo ao longo da curva para outros tipos de curva.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.DivideEqually(System.Int32)
Divide uma curva em determinado número de comprimentos iguais de curvas
divisions: Número de divisões
Returns: Uma matriz de curvas após a divisão
chopcurve,segment,slices

Autodesk.DesignScript.Geometry.Curve.DivideByDistance(System.Int32)
Divide uma curva em determinado número de curvas com distâncias iguais entre o início e o fim de cada curva (banzos iguais).
divisions: Número de divisões
Returns: Uma matriz de curvas após a divisão
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByLengthFromParameter(System.Double,System.Double)
Divide uma curva em curvas de determinado comprimento medido a partir da localização de parâmetro dada
length: Comprimento das curvas após a divisão
parameter: Localização do parâmetro a partir do qual medir
Returns: Matriz de curvas após a divisão
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByDistanceFromParameter(System.Double,System.Double)
Divide uma curva em curvas de determinado comprimento de corda medido a partir da localização de parâmetro dada
distance: Comprimento de corda de cada curva obtida a partir de divisão
parameter: Localização do parâmetro a partir do qual medir
Returns: Uma matriz de curvas após a divisão
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimStart(System.Double)
Remove o início da curva no parâmetro especificado
startParameter: O parâmetro no qual iniciar o recorte
Returns: Uma nova curva com o início removido
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimEnd(System.Double)
Remove o final da curva no parâmetro especificado
endParameter: O parâmetro no qual iniciar o recorte
Returns: Uma nova curva com o final removido
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrim(System.Double,System.Double)
Remove o início e o final da curva nos parâmetros especificados.
startParameter: O parâmetro no qual iniciar o recorte
endParameter: O parâmetro no qual iniciar o recorte
Returns: Uma nova curva com segmentos externos removidos
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.ParameterTrimInterior(System.Double,System.Double)
Remove a parte interna de uma curva com os parâmetros especificados
startParameter: O parâmetro no qual iniciar o recorte
endParameter: O parâmetro no qual iniciar o recorte
Returns: Uma nova curva com o segmento interno removido
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimSegments(System.Double[])
Remove diversos segmentos da curva, descartando o 1º, 3º, 5º... segmentos
parameters: Uma lista de parâmetros nos quais dividir a curva
Returns: Uma matriz de curvas que descarta o 1º, 3º, 5º... segmentos
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
Remove diversos segmentos da curva, descartando o 2º, o 4º, o 6º... segmentos se o booleano for verdadeiro
parameters: Uma lista de parâmetros nos quais dividir a curva
discardEvenSegments: Alternar para descartar segmentos pares
Returns: Uma matriz de curvas que descarta o 2º, 4º, 6º... segmentos se o booleano for verdadeiro
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double)
Dividir uma curva em duas partes no parâmetro determinado
parameter: O parâmetro no qual fazer a divisão
Returns: Duas curvas restantes após a divisão
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double)
Dividir uma curva em duas partes no parâmetro determinado
parameter: O parâmetro no qual fazer a divisão
Returns: Duas curvas restantes após a divisão
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double[])
Dividir uma curva em diversas partes nos parâmetros determinados
parameters: Uma lista de parâmetros nos quais dividir a curva
Returns: Curvas criadas a partir da divisão
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Efetue a união do conjunto de curvas com a extremidade da PolyCurve. Inverte as curvas para assegurar a conectividade.
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany

Autodesk.DesignScript.Geometry.Curve.Join(Autodesk.DesignScript.Geometry.Curve)
Efetua a união desta curva e a curva de entrada em uma nova PolyCurve, mantendo as curvas originais exatamente como estão.
curve: A curva à qual unir
Returns: Uma PolyCurve composta de duas curvas
convertcurve,curve2polycurve,joincurve,concat

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
Estenda uma curva por uma determinada distância em um determinado fim determinado pelo ponto de seleção.  O lado selecionado será estendido.  As curvas fechadas como círculos e elipses não podem ser estendidas.
distance: Distância a ser ampliada
pickSide: Um ponto no final a ser ampliado
Returns: A curva ampliada
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
Estenda uma curva por uma determinada distância em seu lado inicial.  As curvas fechadas como círculos e elipses não podem ser estendidas.
distance: Distância a ser ampliada
Returns: A curva ampliada
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
Estenda uma curva por uma determinada distância em seu lado inicial.  As curvas fechadas como círculos e elipses não podem ser estendidas.
distance: Distância a ser ampliada
Returns: A curva ampliada
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projeta uma curva de entrada ao longo de uma determinada direção de projeção em uma geometria com base especificada. Geometria para projetar na lista de vetores de geometrias projetadas na geometria de base