DSCore.List.IndexOf(System.Collections.IList,System.Object)
傳回元素在給定清單中的索引。給定清單與目標元素之間的比對必須完全相符 (亦即 int 對 int，double 對 double，string 對 string，object 對 object 等等)
list: 「 尋找」清單中的元素。
element: 其索引的元素將傳回。
元素在清單中的索引。如果找不到完全相符的項目，則會傳回無效的索引 -1。
index,indexof

DSCore.List.Cycle(System.Collections.IList,System.Int32)
連接給定清單的複本來建立新清單。
list: 要重複的清單。
amount: 要重複的項目數。
重複清單的清單，類型: var[]..[]
repeat,repeated,duplicate,repeated list,concat list