DSCore.DateTime.Components(System.DateTime)
萃取 DateTime 的個別元件。
dateTime: 要從中取得組成的 DateTime
年的數值表現法 (1-9999)
月的數值表現法 (1-12)
日的數值表現法 (1 到 [月的天])
小時的數值表現法 (0-23)
分鐘的數值表現法 (0-59)
秒的數值表現法 (0-59)
秒的數值表現法 (0-999)