Autodesk.DesignScript.Geometry.PolySurface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
透過 Curve 斷面混成來製作 PolySurface。
crossSections: 進行斷面混成的曲線。

Autodesk.DesignScript.Geometry.PolySurface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
透過 PolyCurve 斷面混成來製作 PolySurface。
crossSections: 進行斷面混成的曲線。
guideCurve: 導引斷面混成的曲線。
loftbyrail

Autodesk.DesignScript.Geometry.PolySurface.ByLoftGuides(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
透過 PolyCurve 斷面混成來製作 PolySurface。
crossSections: 進行斷面混成的曲線。
guideCurves: 導引斷面混成的曲線。
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
傳回 PolySurface 的曲面數目。
Returns: Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
傳回 PolySurface 的邊數。
Returns: Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
傳回 PolySurface 的頂點數。
Returns: Number of vertices