Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
透過 UV 空間中的曲面線來建立曲線
baseSurface: 要使用的地形
startParams: 曲線開始於的起始 UV
endParams: 曲線結束於的結束 UV
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
透過曲面的等角線來建立曲線
baseSurface: 基準地形
direction: 如果為 0，則等角線是沿 U 方向；如果為 1，則沿 V 方向
parameter: 針對其他曲面參數的曲線值，固定
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
將曲線集接合至 PolyCurve 的終點。請翻轉曲線，以確保連接。
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany