Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
從連接的點製作 PolyCurve。將 “connectLastToFirst” 輸入設置為 true 以關閉 PolyCurve。
points: 製作 polycurve 的點
connectLastToFirst: true 將最後一點連接到第一點，false 維持開放
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
透過索引傳回曲線的 polycurve
index: 定位點的長度
endOrStart: true 從 PolyCurve 的終點計算，false 從 PolyCurve 的起點計算
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
偏移其平面中的 polycurve。
signedDistance: 要偏移的量
extendCircular: 切換以將轉角設為圓形
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
將其平面中的 polycurve 變成圓角。
radius: 圓角半徑
rightSide: true 將相對於 PolyCurve 起點的右側設為圓角，false 將左側設為圓角
Returns: Filleted polyCurve
round,smooth,radius