Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
在平面中沿著 X 軸和 Y 軸使用給定的半徑和掃掠的角度，來建立 EllipseArc
plane: 包含橢圓弧的平面
xRadius: 平面 X 方向的 EllipseArc 半徑
yRadius: 平面 Y 方向的 EllipseArc 半徑
startAngle: 從輸入平面的正 X 軸測量的弧的起始角度
sweepAngle: 從起始角度掃掠的角度 (以度為單位)
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs