Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
透過四個角點建立矩形。
points: List of corner points of rectangle
Returns: Rectangle created by corner points
rectbypointarray

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
透過四個角點建立矩形。
p1: 1st corner point of rectangle
p2: 2nd corner point of rectangle
p3: 3rd corner point of rectangle
p4: 4th corner point of rectangle
Returns: Rectangle created by corner points
rectbypoints

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
使用指定的寬度 (X 軸長度) 和長度 (Y 軸長度)，建立中心在 WCS XY 平面中之 WCS 原點的矩形。
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
使用輸入寬度 (平面 X 軸長度) 和長度 (平面 Y 軸長度)，建立中心在輸入平面根的矩形。
plane: Plane used to center rectangle
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
使用指定的寬度 (X 軸長度) 和長度 (Y 軸長度)，建立中心在 CoordinateSystem XY 平面之輸入原點的矩形。
coordinateSystem: 矩形 (矩形中心) 的座標系統
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created from width and length
rectbylengths