Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
建構由圓柱的母項 CoordinateSystem、半徑和高度定義的實體圓柱
coordinateSystem: 父系座標系統
radius: Radius size
height: Cylinder height
Returns: Cylinder created from radius and height
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
若有圓柱的底部和頂部中心點，請建構實體圓柱。
startPoint: Start point of cylinder
endPoint: End point of cylinder
radius: Radius  of cylinder
Returns: Cylinder created by points and radius
cylinder,tube,by center points