Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
匯入 SAT 檔案，然後傳回一系列匯入的幾何圖形
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
匯入 SAT 檔案，然後傳回一系列匯入的幾何圖形
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
將指定的幾何圖形清單串列化為標準 ACIS 二進位 (SAB) 格式，然後傳回已串列化的二進位串流資料
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes