Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
將指定的 T 雲形線曲面結合為單一曲面。
曲面可以互不連接。
如果至少有一個曲面採用框模式，輸出曲面也將採用框模式。
tSplineSurfaces: 要結合的 T 雲形線曲面
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
將 T 雲形線曲面根據造型轉換為實體或曲面
matchTopology: 決定產生的本體是否應與 T 雲形線具有相同的拓樸
Returns: 拓樸圖元 (實體或曲面)
tspline,brep,solid,surface