Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
創建一個最接近點集合的弧
points: 要將弧最佳擬合到的點清單
Returns: Arc created by best fit through points
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
使用向量的起始切線，建立一個從起點到終點的弧
startPoint: Start point of arc
endPoint: End point of arc
startTangent: Start tangent direction vector
arc,tangent,arcs