Autodesk.DesignScript.Geometry.Mesh.ByPointsFaceIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
從點集合和參考點集合的 IndexGroups 集合建立網面
vertexPositions: List of points that determine vertex positions
indices: Indices for vertices
Returns: Mesh created from points
mesh,meshes