Autodesk.DesignScript.Geometry.Properties.Resources.LowerModelerExtentExceeded
查找類似於「您的輸入超出允許的模型範圍，請從「設定」=>「幾何圖形工作範圍」對話方塊中，考慮選擇模型範圍介於 {1} 到 {2} 的「{0}」設定」的本土化字串。

Autodesk.DesignScript.Geometry.Properties.Resources.UpperModelerExtentExceeded
查找類似於「您的輸入超出允許的模型範圍，請從「設定」=>「幾何圖形工作範圍」對話方塊中，考慮選擇模型範圍介於 {1} 到 {2} 的「{0}」設定」的本土化字串。