Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
使用輸入中心點和世界 XY 平面中的半徑，並以世界 Z 為法線，來建立一個圓。
centerPoint: Center point of circle
radius: Radius
Returns: Circle created with center point and radius
circle

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadiusNormal(Autodesk.DesignScript.Geometry.Point,System.Double,Autodesk.DesignScript.Geometry.Vector)
使用指定的中心點、半徑和法線方向，來建立一個圓。
centerPoint: Center point of circle
radius: Radius
normal: Normal direction vector
Returns: Circle created with center point radius and normal
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
使用給定的半徑建立一個圓，中心在輸入平面原點 (根)，位於輸入平面。
plane: Root of plane used to center circle
radius: Radius
Returns: Circle created with plane and radius
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
透過三個輸入點建立一個圓。
p1: 1st point of circle
p2: 2nd point of circle
p3: 3rd point of circle
circle

Autodesk.DesignScript.Geometry.Circle.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
最佳通過點的擬合圓
points: 要將圓擬合到的點清單
Returns: Circle created from points
circle,approximate