Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
使用明確的控制點建立 BSplineCurve。 附註 1：BSplineCurves 與 deg = 1 有 G1 不連續性，這會導致擠出、掃掠和其他作業發生問題。應該避免它們。請改用 PolyCurve。附註 2：如果曲線是週期性 (封閉)，則第一個點和最後一個點必須相同。
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
使用明確的控制點建立 BSplineCurve。 附註 1：BSplineCurves 與 deg = 1 有 G1 不連續性，這會導致擠出、掃掠和其他作業發生問題。應該避免它們。請改用 PolyCurve。附註 2：如果曲線是週期性 (封閉)，則第一個點和最後一個點必須相同。
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
使用明確的控制點建立 BSplineCurve。 附註 1：BSplineCurves 與 deg = 1 有 G1 不連續性，這會導致擠出、掃掠和其他作業發生問題。應該避免它們。請改用 PolyCurve。附註 2：如果曲線是週期性 (封閉)，則第一個點和最後一個點必須相同.
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
透過點之間的內插來建立 BSplineCurve。
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
透過點之間的內插來建立 BSplineCurve。附註 2：如果曲線是週期性 (封閉)，則在第一個點和最後一個點必須相同。
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
透過點之間的內插，並使用指定的度數來建立 BSplineCurve。
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
透過點並依切線方向傳回 BSplineCurve
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
曲線的節點。節點是一系列用來決定控制點在哪以及如何影響曲線的參數值 (double)。
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
傳回 NurbsCurve 控制點的權重。權重決定每個控制點對曲線造型的影響。
Returns: Weights of nurbs curve
ptweight