Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
在 XY 平面中給與兩個 2 直角座標構成一個點。Z 元件是 0。
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
取得原點 (0,0,0)
Returns: Origin point
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
給與 3 個直角座標構成一個點
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
給與座標系統三個直角座標構成一個點
coordinateSystem: 父系座標系統
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
修剪點以排除內含點公差內的重複項目
points: 要從中修剪重複項目的點清單
tolerance: 用於修剪的公差
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near