Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
透過輸入斷面曲線之間的斷面混成來建立曲面。
crossSections: Curves to loft through
Returns: Surface created by loft
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
透過斷面與指定的導引曲線 (也稱為軌跡) 來斷面混成曲面。導引曲線必須與所有斷面曲線相交。
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
沿著路徑掃掠斷面來建立曲面。
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
連接封閉多邊形中的輸入點並修補它，來建立多邊形曲面。
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
沿著兩條軌跡引導的路徑，掃掠斷面曲線
path: 要掃掠的輸入路徑。
guideRail: 一個軌跡，用於引導掃掠的方位。
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
繞著原點形成的軸線依軸向量的方向，掃掠輪廓曲線來建立曲面，開始於 start_angle (以度表示)，掃掠 sweep_angle (以度表示)。
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
透過填滿輸入曲線所定義之封閉邊界的內部來建立曲面。
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
傳回曲面上輸入點中的曲面法線。
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
取得指定公差內曲面的 NURBS 表現法。 在某些情況下，此方法可能近似曲面。
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
將曲面增厚為實體，依曲面兩側上曲面法線的方向擠出。
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
將曲面增厚為實體，依曲面法線的方向擠出。如果 both_sides 參數為 True，則曲面兩側都會增厚。
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
依曲面法線的方向，將曲面偏移指定的距離。
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
傳回的座標系統使用 xAxis、yAxis 和 zAxis 表示 uDir、vDir 和法線。 xAxis、yAxis 和 zAxis 的長度表示曲率。
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
傳回與主曲率方向對齊的 CoordinateSystem。
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
傳回指定的 U 和 V 參數中的 U 正切向量。
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
傳回指定的 U 和 V 參數中的 V 正切向量。
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
傳回指定的 U 和 V 參數中的法線向量。
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
傳回輸入 U 和 V 座標中的衍生物。
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
傳回 U 和 V 參數中的主方向向量。
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.PointAtParameter(System.Double,System.Double)
傳回指定的 U 和 V 參數中的點。
surfacepoint

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
傳回法線翻轉的新曲面。 將此曲面保持不變。
Returns: Surface, which is the same as the input surface but with flipped normals