Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
建立一個儲存四個索引的 IndexGroup
a: Index a
b: Index b
c: Index c
d: Index d
Returns: IndexGroup
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
建立一個儲存三個索引的 IndexGroup
a: Index a
b: Index b
c: Index c
Returns: IndexGroup
tri,polygon,mesh,meshes