Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
建立螺旋線。螺旋總是依據提供的軸方向順時鐘旋轉。如果沿軸方向檢視，檢視器將看到點圍繞軸順時鐘旋轉，同時沿著曲線依遞增參數的方向移動。節距是螺旋線每次旋轉時依軸方向移動的距離。這可以是正值或負值。
axisPoint: Axis point
axisDirection: Axis direction vector
startPoint: Helix start point
pitch: Distance of the helix per each 360 degrees in the direction of the axis
angleTurns: How many turns in degrees
Returns: Helix created by axis
helix,screw,corkscrew,thread