Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
使用輸入法線向量建立中心在根點的平面。
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
建立「定向」的平面，位於具有向量法線但具有特定 X 軸方位的點原點。這不會影響到分割、相交、投影等作業，僅會指定輸入 CoordinateSystem 的方位。
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
X 和 Y 軸位於平面。Z 軸是兩個向量的向量積。
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
將平面擬合至輸入點；基本上，這是 3D scatterplot 擬合。
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
建立包含輸入線和外部點的平面。 點無法位於線上或位於線軸中。
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
在世界 XY 建立平面
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
在世界 XY 平面建立平面
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
在世界 YZ 建立平面
Returns: Plane at YZ plane of world