Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
利用指定的內插點以及 U 和 V 度，建立一個 NurbsSurface。產生的曲面將通過所有點。
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
建立一個 NurbsSurface，滿足不同曲面特性的集合。這是最進階的曲面擬合方式。產生的曲面將通過所有點。 切線數必須符合對應方向中的點數。 產生的曲面將為 U 方向和 V 方向中的 3 度。角點衍生物應該是第二個順序 (DP / dUdV)，且應該依此順序 [ lowU, lowV ]、[ highU, lowV ]、[ lowU, highV ]、[ highU, highV ] 提供。
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
使用明確的控制點，以及指定的 U 和 V 度，來建立一個 NurbsSurface。
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
傳回 NurbsSurface 控制點的權重。權重決定每個控制點對曲面造型的影響。
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
傳回 U 方向的曲面節點。節點是一系列用來決定控制點在哪以及如何影響曲面的參數值 (double)。
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
傳回 V 方向的曲面節點。節點是一系列用來決定控制點在哪以及如何影響曲面的參數值 (double)。
Returns: Nurbs V knots of surface