DSCore.DateTime.Components(System.DateTime)
Extrae los componentes individuales de una DateTime.
dateTime: DateTime desde la que obtener componentes.
Representación numérica del año (1-9999).
Representación numérica del mes (1-12).
Representación numérica del día (1-[días del mes]).
Representación numérica de la hora (0-23).
Representación numérica de los minutos (0-59).
Representación numérica de los segundos (0-59).
Representación numérica de los segundos (0-999).