DSCore.DummyPythonEvaluator
Evaluador de Python que solo genera errores de evaluación.
Se utiliza principalmente para indicar que no se ha podido encontrar un evaluador de Python real.

DSCore.DummyPythonEvaluator.Evaluate(System.String,System.Collections.IList,System.Collections.IList)
Da lugar a una excepción con el mensaje asignado