DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Escribe la imagen en una ruta y se le da el nombre de archivo especificado.
image: La imagen que se debe escribir.
Sin salida.
write image,image,file,filepath