Autodesk.DesignScript.Geometry.Face.ToString
Permite obtener una representación de cadena de la cara.

Autodesk.DesignScript.Geometry.Face.SurfaceGeometry
La superficie subyacente que forma la cara.
Returns: Surface representation of face