Autodesk.DesignScript.Geometry.Sphere.ToString
Permite obtener una representación de cadena de la esfera.

Autodesk.DesignScript.Geometry.Sphere.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Crea una esfera sólida centrada en el punto de entrada, con el radio especificado.
Brep,brep