Autodesk.DesignScript.Geometry.Solid.ToString
Permite obtener una representación de cadena del sólido.

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Crea un sólido mediante la solevación entre curvas cerradas de sección transversal de entrada, empleando una curva guía. La curva guía debe intersecar con todas las curvas de sección transversal.
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Crea un sólido mediante la solevación entre curvas cerradas de sección transversal de entrada, empleando curvas guía. Las curvas guía deben intersecar con todas las curvas de sección transversal.
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
Crea un sólido mediante la solevación entre las PolyCurves cerradas de secciones transversales de entrada. Esta operación está optimizada para secciones compuestas exclusivamente por segmentos de línea con vértices siguiendo el mismo orden. La opción de comprobación y reparación garantiza la validez del sólido generado cuando está activada; si se desactiva esta opción, debería aumentar el rendimiento.
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Barre una curva de perfil cerrada a lo largo de dos curvas de carril.
path: Ruta de entrada de la cual se debe realizar el barrido.
guideRail: Raíl para guiar la orientación del barrido.
profile: The profile curve to sweep along the path
Brep,brep,sweep2,guides,sweepprofile

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Crea una sólido de revolución mediante el barrido de la curva de perfil alrededor del rayo de eje formado por el vector de eje y el de origen, a partir del ángulo inicial hasta el ángulo de barrido, ambos expresados en grados.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Solid created by revolve
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
Une una lista de sólidos con este sólido.
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
La diferencia booleana de este sólido y otro.

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
Obtiene un vaciado de sólido a partir de las caras de este sólido.
internalFaceThickness: Distancia que se debe extender la funda hacia el interior
externalFaceThickness: Distancia que se debe extender la funda hacia el exterior
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Proyecta la Geometry de entrada sobre este sólido en la dirección del vector de entrada. Este método de proyección solo admite actualmente puntos o curvas.
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
Separa un sólido en sólidos individuales si se compone de más de un sólido base inconexo. Devuelve el mismo sólido si se trata de un único sólido base contiguo.
Returns: separar sólidos inconexos
split,disjoint