Autodesk.DesignScript.Geometry.Vector.ToString
Permite obtener una representación de cadena del vector.

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Compara dos vectores.
other: El otro vector.
Returns: Si los dos objetos son iguales

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
Obtiene un código hash para este tipo
Returns: Un código hash exclusivo para este objeto

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Genera un vector mediante 3 coordenadas euclidianas.
x: Coordenada X
y: Coordenada Y
z: Coordenada Z
Returns: Vector created by coordinates
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Genera un vector mediante 3 coordenadas euclidianas y lo normaliza.
x: Coordenada X
y: Coordenada Y
z: Coordenada Z
normalized: "True" para normalizar el vector y "false" para no normalizarlo.
Returns: Vector created by coordinates
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Genera un vector mediante dos extremos. El resultado es un vector desde el inicio hasta el final.
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
Obtiene el vector del eje X canónico (1,0,0).
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
Obtiene el vector del eje Y canónico (0,1,0).
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
Obtiene el vector del eje Z canónico (0,0,1).
z,basis,up

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Genera el producto escalar de dos vectores.
vec: a second vector
Returns: Resulting dot product
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Determina si dos vectores son paralelos.
otherVector: Otro vector
Returns: Returns True if the vectors are parallel; false otherwise.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Determina si dos vectores son prácticamente iguales. Se debe especificar un valor de tolerancia de 1e-5 para solucionar los problemas de precisión.
otherVector: Otro vector
Returns: Returns True if the vectors are almost equal; false otherwise.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforma el vector según la matriz CoordinateSystem de entrada.
coordinateSystem: Sistema de coordenadas utilizado para transformar el vector
Returns: Transformed vector

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Rota un vector sobre un eje el número de grados especificado.
axis: Rotation axis vector
degrees: Number of degrees to rotate
Returns: Rotated vector
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rota un vector sobre la normal y el origen del plano el número de grados especificado.
plane: Plano de rotación
degrees: Number of degrees to rotate
Returns: Rotated vector
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Escala de forma uniforme el vector sobre el origen.
scale_factor: Scale factor
Returns: Scaled vector
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
Devuelve el ángulo entre los dos vectores en el rango de 0 a 180 grados.
otherVector: Other vector
Returns: Returns angle between the supplied vectors in degrees from 0 to 180.
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
Devuelve el ángulo entre los dos vectores, en el rango de [0, 180] grados.
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Devuelve el ángulo entre los dos vectores en el rango de 0 a 360 grados. Utiliza el eje de rotación para determinar la dirección del ángulo.
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Devuelve el ángulo entre los dos vectores, en el rango de [0, 360] grados. Utiliza el eje de rotación para determinar la dirección del ángulo.
rotation angle