Autodesk.DesignScript.Geometry.NurbsSurface.ToString
Permite obtener una representación de cadena de la NurbsSurface.

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Crea una NurbsSurface con los puntos interpolados y los grados U y V especificados. La superficie resultante pasará por todos los puntos.
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Crea una NurbsSurface con los puntos interpolados y los grados U y V especificados. La superficie resultante pasará por todos los puntos. El número de tangentes debe coincidir con el número de puntos en la dirección correspondiente. La superficie resultante tendrá grado 3 tanto en la dirección U como en la dirección V.
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Crea una NurbsSurface que reúne una colección de diversas características de superficie. Este es el método de unión de superficies más avanzado. La superficie resultante pasará por todos los puntos. El número de tangentes debe coincidir con el número de puntos en la dirección correspondiente. La superficie resultante tendrá grado 3 tanto en la dirección U como en la dirección V. Las derivadas de esquina deben ser de segundo orden (dP/dUdV) y se deben presentar en el orden siguiente: [ lowU, lowV ], [ highU, lowV ], [ lowU, highV ], [ highU, highV ].
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Crea una NurbsSurface mediante el uso explícito de puntos de control y los grados especificados para U y V.
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
Crea una NurbsSurface según las especificaciones de vértices, nodos, grosores y grados para U y V. Hay diversas restricciones en los datos que, de ser ignoradas, pueden hacer que la función produzca un error y genere una excepción. Grado: el grado para U y V debe  ser >= 1 (spline lineal por segmentos) e inferior a 26 (el máximo de grados base admitido para B-splines por ASM). Grosores: todos los valores de grosor (si se suministran) deben ser positivos. Los grosores inferiores a 1e-11 se rechazarán y la función producirá un error. Nodos: los dos vectores de nodos deben tener secuencias no decrecientes. La multiplicidad de nodos interior no debe ser mayor que su grado +1 en el nodo inicial/final ni mayor que el grado en el caso de nodos internos (esto permite representar superficies con discontinuidades G1). Tenga en cuenta que se admiten los vectores de nodos no bloqueados, pero que estos se convertirán a nodos bloqueados, con los cambios correspondientes aplicados al punto de control y a los datos de grosor.
lines
0.4

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
Devuelve los grosores de los puntos de control de NurbsSurface. Estos determinarán la influencia aplicada por cada uno de los puntos de control en la forma de la superficie.
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
Devuelve los nudos de la superficie en la dirección U.  Los nudos son una serie de valores de parámetros (dobles) utilizados para determinar dónde y cómo afectan los puntos de control a la superficie.
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
Devuelve los nudos de la superficie en la dirección V.  Los nudos son una serie de valores de parámetros (dobles) utilizados para determinar dónde y cómo afectan los puntos de control a la superficie.
Returns: Nurbs V knots of surface