Autodesk.DesignScript.Geometry.BoundingBox.ToString
Permite obtener una representación de cadena del BoundingBox.

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Compara dos BoundingBox.
other: El otro BoundingBox
Returns: Si los dos objetos son iguales

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
Obtiene un código hash para este tipo.
Returns: Un código hash exclusivo para este objeto

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
Crea un BoundingBox alineado al eje alrededor de la Geometry de entrada.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Crea un BoundingBox alineado al eje alrededor de las geometrías de entrada.
geom: Geometries to determine bounding box
Returns: Bounding box enclosing geometries
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
Crea un BoundingBox no alineado al eje alrededor de la Geometry de entrada, orientado a los ejes X, Y y Z del CoordinateSystem.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
Crea un BoundingBox no alineado al eje alrededor de las geometrías de entrada, orientado a los ejes X, Y y Z del CoordinateSystem.
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
Genera un BoundingBox desde las coordenadas mínimas (esquina anterior inferior izquierda del cuadro) hasta las coordenadas máximas (esquina frontal superior derecha del cuadro). El CoordinateSystem se transforma del espacio de coordenadas del cuadro al espacio del modelo. Este método está ideado para que coincida con el utilizado por la API de Revit, de forma que pueda extraer los parámetros de un BoundingBox de Revit sin necesidad de hacer ninguna conversión.
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
El CoordinateSystem en que este BoundingBox se encuentra definido.

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Obtiene la intersección de dos BoundingBox.
other: Other bounding box to intersect
Returns: Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Determina si dos BoundingBox intersecan.
other: Other bounding box
Returns: Do bounding boxes intersect
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
Determina si el BoundingBox está vacío.
Returns: Returns true if the bounding box is empty