Autodesk.DesignScript.Geometry.Curve.ToString
Permite obtener una representación de cadena de la curva.

Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
Crea una curva por línea de superficie en el espacio UV.
baseSurface: Superficie que usar
startParams: UV inicial para inicio de curva
endParams: UV final para fin de curva
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Crea una curva fusionando dos curvas
curve1: Primera curva que fusionar
curve2: Segunda curva que fusionar
endOrStart1: indicador para indicar qué extremo de curve1 se debe fusionar
endOrStart2: indicador para indicar qué extremo de curve1 se debe fusionar
isG2Continuous: indicador para indicar si la curva resultante es de continuidad G1 o continuidad G2
Returns: Curva resultante de la fusión de dos curvas
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
Crea una curva por isolínea de superficie.
baseSurface: Superficie base
direction: si el valor es 0, la isolínea transcurre a lo largo de la dirección u, si es 1, a lo largo de la dirección v
parameter: fijo para el valor de curva de otro parámetro de superficie
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
Obtiene un CoordinateSystem con origen en el punto del parámetro especificado. XAxis se alinea con la normal de la curva, YAxis se alinea con la curva tangente a este punto y ZAxis se alinea con el vector hacia arriba o binormal en este punto
param: El parámetro en que se debe evaluar
Returns: CoordinateSystem en el parámetro de curva
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
Devuelve un plano cuya normal se alinea con la tangente de la curva. Los parámetros se ajustan de forma que 0 siempre es el punto inicial y 1 siempre es el punto final.
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtDistance(System.Double)
Crea un punto en una longitud de arco concreta a lo largo de la curva
segmentLength: La distancia a lo largo de la curva en que se debe evaluar
Returns: El punto en la longitud de arco especificada
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
Devuelve puntos espaciados uniformemente a lo largo de la longitud de la curva en función de la entrada de número de divisiones
divisions: Número de divisiones
Returns: Puntos espaciados uniformemente a lo largo de la longitud de curva

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
Devuelve puntos espaciados a lo largo de la curva con una longitud de cordón uniforme que se basa en la entrada de número de divisiones
divisions: Número de divisiones
Returns: Lista de puntos en la curva

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Devuelve puntos espaciados uniformemente a lo largo de la curva con la longitud de segmento especificada y a partir del punto determinado
point: El punto de referencia a partir del cual se debe medir
segmentLength: La distancia a lo largo de la curva en que se debe evaluar
Returns: Lista de puntos en la curva

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Devuelve puntos espaciados en la curva con la longitud de cordón especificada a partir del punto determinado
point: El punto de referencia a partir del cual se debe medir
chordLength: Longitud de cuerda
Returns: Lista de puntos en la curva

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
Devuelve un CoordinateSystem a la distancia especificada del punto de inicio de la curva. El eje Y se encuentra en posición tangente a la curva y el eje X es la curvatura.
segmentLength: La distancia a lo largo de la curva en que se debe evaluar
Returns: CoordinateSystem en curva
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtDistance(System.Double)
Devuelve un CoordinateSystem a la distancia especificada del punto de inicio de la curva. El eje Y se encuentra en posición tangente a la curva y el eje X es la curvatura.
segmentLength: La distancia a lo largo de la curva en que se debe evaluar
Returns: CoordinateSystem en curva
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
Devuelve un plano a la distancia especificada a lo largo de la curva desde el punto inicial. La normal del plano se alinea con la tangente de la curva.
segmentLength: La distancia a lo largo de la curva en que se debe evaluar
Returns: Plano en curva
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PlaneAtDistance(System.Double)
Devuelve un plano a la distancia especificada a lo largo de la curva desde el punto inicial. La normal del plano se alinea con la tangente de la curva.
segmentLength: La distancia a lo largo de la curva en que se debe evaluar
Returns: Plano en curva
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
Obtiene la longitud del segmento medida desde el punto inicial de la curva hasta el parámetro especificado.
param: Valor entre 0 y 1
Returns: Longitud de segmento
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtDistance(System.Double)
Obtiene el parámetro en una longitud de arco concreta a lo largo de la curva.
segmentLength: La distancia a lo largo de la curva en que se debe evaluar
Returns: El parámetro
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.LengthBetweenParameters(System.Double,System.Double)
Obtiene la longitud de arco entre dos puntos de parámetros en la curva
startParam: El inicio del dominio
endParam: El final del dominio
Returns: La longitud del arco entre los dos parámetros
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Obtiene el parámetro en un punto determinado de la curva. Si el punto no está en la curva, obtiene el parámetro más cercano. Si la curva de entrada es una PolyCurve, esta función devolverá un parámetro válido solo si el punto se encuentra en la PolyCurve. Para otros tipos de curva, esta función devolverá el parámetro a lo largo de la curva que se encuentre en el punto más cercano al punto de entrada.
point: Un punto a lo largo o cerca de la curva
Returns: El parámetro de la curva para PolyCurves o el parámetro más cercano a lo largo de la curva para otros tipos de curvas.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.DivideEqually(System.Int32)
Divide una curva en el número especificado de curvas de longitud iguales.
divisions: Número de divisiones.
Returns: Una matriz de curvas tras la división
chopcurve,segment,slices

Autodesk.DesignScript.Geometry.Curve.DivideByDistance(System.Int32)
Divide una curva en el número especificado de curvas con distancias iguales entre el inicio y el final de cada curva (cordones iguales).
divisions: Número de divisiones.
Returns: Una matriz de curvas tras la división
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByLengthFromParameter(System.Double,System.Double)
Divide una curva en curvas de la longitud especificada, medida desde la ubicación del parámetro especificado
length: Longitud de curvas tras la división
parameter: Ubicación del parámetro desde la cual medir
Returns: Matriz de curvas tras la división
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByDistanceFromParameter(System.Double,System.Double)
Divide una curva en curvas de la longitud de cordón especificada, medida desde la ubicación del parámetro especificado
distance: Longitud de cordón para cada curva obtenida a partir de la división
parameter: Ubicación del parámetro desde la cual medir
Returns: Una matriz de curvas tras la división
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimStart(System.Double)
Elimina el inicio de la curva en el parámetro especificado
startParameter: El parámetro en que iniciar el recorte
Returns: Una nueva curva con el inicio eliminado
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimEnd(System.Double)
Elimina el final de la curva en el parámetro especificado
endParameter: El parámetro en que iniciar el recorte
Returns: Una nueva curva con el final eliminado
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrim(System.Double,System.Double)
Elimina el principio y el final de la curva en los parámetros especificados.
startParameter: El parámetro en que iniciar el recorte
endParameter: El parámetro en que iniciar el recorte
Returns: Una nueva curva con los segmentos exteriores eliminados
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.ParameterTrimInterior(System.Double,System.Double)
Elimina la parte interior de una curva en los parámetros especificados
startParameter: El parámetro en que iniciar el recorte
endParameter: El parámetro en que iniciar el recorte
Returns: Una nueva curva con el segmento interior eliminado
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimSegments(System.Double[])
Elimina varios segmentos de la curva. Los segmentos descartados son el primero, tercero, quinto, etc
parameters: Una lista de parámetros en que dividir la curva
Returns: Una matriz de curvas que descarta los segmentos 1, 3, 5
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
Elimina varios segmentos de la curva. Los segmentos descartados son el segundo, el cuarto y el sexto, entre otros, si el valor booleano es "true" (verdadero).
parameters: Una lista de parámetros en que dividir la curva
discardEvenSegments: Active o desactive para descartar los segmentos pares.
Returns: Una matriz de curvas que descarta los segmentos 2, 4, 6... (si el booleano es true)
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double)
Divide una curva en dos partes en el parámetro especificado.
parameter: El parámetro en que realizar la división
Returns: Dos curvas restantes tras la división
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double)
Divide una curva en dos partes en el parámetro especificado
parameter: El parámetro en que realizar la división
Returns: Dos curvas restantes tras la división
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double[])
Divide una curva en varias partes en los parámetros especificados
parameters: Una lista de parámetros en que dividir la curva
Returns: Curvas creadas a partir de la división
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Une un conjunto de curvas al final de la PolyCurve. Voltea las curvas para garantizar la conectividad.
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany

Autodesk.DesignScript.Geometry.Curve.Join(Autodesk.DesignScript.Geometry.Curve)
Une la curva y la curva de entrada en una nueva PolyCurve manteniendo exactamente las curvas originales.
curve: La curva con la cual realizar la unión
Returns: Una PolyCurve compuesta por dos curvas
convertcurve,curve2polycurve,joincurve,concat

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
Extiende una curva la distancia especificada en un extremo determinado por un punto de selección. Se extenderá el lado seleccionado. Las curvas cerradas como círculos y elipses no se pueden extender.
distance: Distancia que se debe extender
pickSide: Un punto en el extremo que se debe extender
Returns: La curva extendida
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
Extiende una curva la distancia especificada por el extremo inicial. Las curvas cerradas como círculos y elipses no se pueden extender.
distance: Distancia que se debe extender
Returns: La curva extendida
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
Extiende una curva la distancia especificada por el final. Las curvas cerradas como círculos y elipses no se pueden extender.
distance: Distancia que se debe extender
Returns: La curva extendida
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Patch
Aplica un parche a una curva cerrada.
Returns: Una superficie en el interior de la curva de Curve
fill,profiletosurf,loop,loop2surf,edgesurf

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Proyecta una curva de entrada a lo largo de una dirección de proyección determinada en una geometría base especificada. Geometría que se proyectará en la lista de vectores de geometrías proyectadas en la geometría base.