Autodesk.DesignScript.Geometry.UV.ToString
Permite obtener una representación de cadena del UV.

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
Compara dos UV.
other: El otro UV
Returns: Si los dos objetos son iguales

Autodesk.DesignScript.Geometry.UV.GetHashCode
Obtiene un código hash para este tipo
Returns: Un código hash exclusivo para este objeto

Autodesk.DesignScript.Geometry.UV.ByCoordinates(System.Double,System.Double)
Crea un UV a partir de dos dobles.
u: U value
v: V value
Returns: UV created by coordinates
surfaceparam,parameters,uv,uvs