Autodesk.DesignScript.Geometry.Surface.ToString
Permite obtener una representación de cadena de la superficie.

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Fusiona un conjunto de superficies en una única superficie. Este método puede devolver una PolySurface si la unión resultante es no múltiple o tiene varias caras.
surfaces: Un conjunto de superficies.
Returns: Unión de superficies
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Crea una superficie mediante la solevación entre curvas de sección transversal de entrada.
crossSections: Curves to loft through
Returns: Surface created by loft
loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
Crea una superficie mediante la solevación entre líneas de sección transversal. Ligeramente más rápido, pero con resultados menos suaves que los de Surface.ByLoft.
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Soleva una superficie a través de las secciones transversales con la curva guía (o carril) especificada. La curva guía debe intersecar con todas las curvas de sección transversal.
loftbyrail

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Soleva una superficie a través de las secciones transversales con las curvas guías (o carriles) especificadas. Las curvas guías deben intersecar con todas las curvas de sección transversal.
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Crea una superficie mediante el barrido de una curva de sección transversal a lo largo de una trayectoria.
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea una superficie de polígono conectando los puntos de entrada de un polígono cerrado y aplicando a esta un parche.
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Barre la curva de sección transversal a lo largo de una trayectoria guiado por dos carriles.
path: Ruta de entrada de la cual se debe realizar el barrido.
guideRail: Raíl para guiar la orientación del barrido.
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Crea una superficie barriendo la curva de perfil alrededor del rayo de eje formado por el punto de origen en la dirección del vector del eje. El ángulo inicial es start_angle y el barrido se realiza en el ángulo de sweep_angle, que se expresan en ambos casos en grados.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Crea una superficie mediante el relleno del interior de un contorno cerrado definido por curvas de entrada.
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
La diferencia booleana de esta superficie y la unión de las superficies de entrada. Este método puede devolver una PolySurface si el valor booleano resultante es no múltiple o tiene varias caras.
others: Otras superficies que sustraer
Returns: PolySurface o superficie booleana resultantes
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Recorte la superficie con una colección de uno o varios bucles en la superficie de entrada. Uno de los bucles debe ser el bucle de contorno de la superficie de entrada. Además, es necesario añadir uno o varios bucles internos para los agujeros.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
Devuelve la normal de superficie al punto de entrada en la superficie.
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
Obtiene una representación NURBS de la superficie. Este método puede aproximar la superficie en determinadas circunstancias.

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Obtiene una representación NURBS de la superficie dentro de la tolerancia especificada. Este método puede aproximar la superficie en determinadas circunstancias.
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Engrosa la superficie hasta convertirla en un sólido y realiza la extrusión en la dirección de las normales de superficie en ambos lados de la superficie.
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Engrosa la superficie hasta convertirla en un sólido y realiza la extrusión en la dirección de las normales de superficie. Si el parámetro both_sides es True, la superficie se engrosa en ambos lados.
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
Desfasa la superficie en la dirección de la normal de superficie aplicando la distancia especificada.
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
El sistema de coordenadas devuelto utiliza xAxis, yAxis y zAxis para representar uDir, vDir y la normal. La longitud de xAxis e yAxis representa las curvaturas.
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
Devuelve un CoordinateSystem alineado con las principales direcciones de curvatura.
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
Devuelve el vector tangente U en los parámetros U y V especificados.
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
Devuelve el vector tangente V en los parámetros U y V especificados.
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
Devuelve el vector de la normal en los parámetros U y V especificados.
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
Devuelve las derivadas en las coordenadas U y V de entrada.
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
Devuelve los vectores de dirección principales en los parámetros U y V.
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
Crea una curva de línea de parámetro en la superficie especificada. Crea una curva que representa un parámetro U o V en la superficie. Se traza una línea de parámetro en la dirección de incremento del parámetro U o V en parámetro constante opuesto a U o V. La curva resultante coincide con la parametrización de la superficie y su rango se enlaza al rango del parámetro Superficie. El tipo de curva devuelto dependerá del tipo de superficie.
isoDirection: Si la dirección == 0, se crea una línea de parámetro U, si la dirección == 1, se crea una línea de parámetro V.
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Devuelve una nueva superficie con la normal volteada. No aplica ningún cambio en esta superficie.
Returns: Surface, which is the same as the input surface but with flipped normals

Autodesk.DesignScript.Geometry.Surface.Join(Autodesk.DesignScript.Geometry.Surface)
Combina esta superficie y la superficie de entrada en una PolySurface.
topolysurface

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Combina esta superficie y las superficies de entrada en una PolySurface.
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Proyecta la Geometry de entrada sobre esta superficie en la dirección del vector de entrada. Este método de proyección solo admite actualmente puntos o curvas.
projecttosurface,projectonto