Autodesk.DesignScript.Geometry.PolySurface.ToString
Permite obtener una representación de cadena de la PolySurface.

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Crea una PolySurface mediante el barrido de una curva a lo largo de un carril.
rail: Curva a lo largo de la cual se debe realizar el barrido
profile: Perfil de barrido
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Localizar superficies por punto. Toma la primera intersección hacia delante. Devuelve una superficie si el punto es el interior de una superficie, dos si el punto es el interior de una arista y varias si el punto es un vértice.
surfacesatpoint,findsurfaces,extractsurfaces

Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
Devuelve el número de superficies de la PolySurface.
Returns: Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
Devuelve el número de aristas de la PolySurface.
Returns: Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
Devuelve el número de vértices de la PolySurface.
Returns: Number of vertices