Autodesk.DesignScript.Geometry.NurbsCurve.ToString
Permite obtener una representación de cadena de la NurbsCurve.

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea una BSplineCurve mediante puntos de control explícitos. NOTA 1: las BSplineCurve con grado=1 tienen discontinuidades G1, las cuales causan problemas en extrusión, barrido y otras operaciones. Se recomienda evitarlas y utilizar PolyCurve en su lugar. NOTA 2: si la curva es periódica (cerrada), el primer y el último punto DEBEN coincidir.
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Crea una BSplineCurve mediante puntos de control explícitos. NOTA 1: las BSplineCurve con grado=1 tienen discontinuidades G1, las cuales causan problemas en extrusión, barrido y otras operaciones. Se recomienda evitarlas y utilizar PolyCurve en su lugar. NOTA 2: si la curva es periódica (cerrada), el primer y el último punto DEBEN coincidir.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Crea una BSplineCurve mediante puntos de control explícitos. NOTA 1: las BSplineCurve con grado=1 tienen discontinuidades G1, las cuales causan problemas en extrusión, barrido y otras operaciones. Se recomienda evitarlas y utilizar PolyCurve en su lugar. NOTA 2: si la curva es periódica (cerrada), el primer y el último punto DEBEN coincidir.
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
Crea una BSplineCurve a partir de los vértices de control, los grosores y los nodos. Según lo que aparece en los documentos de ASM: Grado: debe ser mayor que 1 (spline lineal por segmentos) y menor que 26 (el máximo de grados base admitido para B-splines por ASM). Grosores: todos los valores de grosor (si se suministran) deben ser positivos. Los grosores inferiores a 1e-11 se rechazarán y la función producirá un error. Nodos: el vector del nodo debe tener una secuencia no decreciente. La multiplicidad de nodos interior no debe ser mayor que su grado +1 en el nodo inicial/final ni mayor que el grado en el caso de nodos internos (esto permite representar superficies con discontinuidades G1). Tenga en cuenta que se admiten los vectores de nodos no bloqueados, pero que estos se convertirán a nodos bloqueados, con los cambios correspondientes aplicados al punto de control y a los datos de grosor. Matriz de nodos: el tamaño de la matriz debe ser num_control_points + grado + 1.
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea una BSplineCurve mediante la interpolación entre puntos.
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Crea una BSplineCurve mediante la interpolación entre puntos. NOTA 2: si esta curva es periódica (cerrada), el primer y el último punto DEBEN coincidir.
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Crea una BSplineCurve mediante la interpolación entre puntos con el grado especificado.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Devuelve una BSplineCurve a través de los puntos, con direcciones tangentes.
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
Obtiene los puntos de control de la NurbsCurve. Estos son los puntos interpolados por la curva.
Returns: Una matriz de puntos

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
Los nudos de la curva. Los nudos son una serie de valores de parámetros (dobles) utilizados para determinar dónde y cómo los puntos de control afectan a la curva.
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
Devuelve los grosores de los puntos de control de NurbsCurve. Estos determinan la influencia de cada uno de los puntos de control en la forma de la curva.
Returns: Weights of nurbs curve
ptweight