Autodesk.DesignScript.Geometry.Circle.ToString
Permite obtener una representación de cadena del círculo.

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Crea un círculo con punto central y radio en el plano XY universal, con el plano Z universal como normal.
centerPoint: Center point of circle
radius: Radius
Returns: Circle created with center point and radius
circle

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadiusNormal(Autodesk.DesignScript.Geometry.Point,System.Double,Autodesk.DesignScript.Geometry.Vector)
Crea un círculo con punto central, radio y dirección normal especificados.
centerPoint: Center point of circle
radius: Radius
normal: Normal direction vector
Returns: Circle created with center point radius and normal
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
Crea un círculo centrado en el origen de plano de entrada (raíz), que se encuentra, en el plano de entrada, con el radio especificado.
plane: Root of plane used to center circle
radius: Radius
Returns: Circle created with plane and radius
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Crea un círculo que pasa por tres puntos de entrada.
p1: 1st point of circle
p2: 2nd point of circle
p3: 3rd point of circle
circle

Autodesk.DesignScript.Geometry.Circle.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Círculo de ajuste óptimo a través de puntos.
points: Lista de puntos a los que se ajusta el círculo
Returns: Circle created from points
circle,approximate