Autodesk.DesignScript.Geometry.IndexGroup.ToString
Permite obtener una representación de cadena del IndexGroup.

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
Compara dos IndexGroup.
other: El otro IndexGroup
Returns: Si los dos objetos son iguales

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
Obtiene un código hash para este tipo
Returns: Un código hash exclusivo para este objeto

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
Crea un IndexGroup que almacena cuatro índices.
a: Index a
b: Index b
c: Index c
d: Index d
Returns: IndexGroup
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Crea un IndexGroup que almacena tres índices.
a: Index a
b: Index b
c: Index c
Returns: IndexGroup
tri,polygon,mesh,meshes