Autodesk.DesignScript.Geometry.EllipseArc.ToString
Permite obtener una representación de cadena del EllipseArc.

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Crea un EllipseArc en un plano con los radios especificados a lo largo de los ejes X e Y y los ángulos a través de los cuales se realiza el barrido.
plane: Plano que contiene el arco de la elipse
xRadius: El radio del EllipseArc en la dirección X del plano
yRadius: El radio del EllipseArc en la dirección Y del plano
startAngle: El ángulo inicial del arco medido desde el eje X positivo del plano de entrada
sweepAngle: El ángulo de barrido desde el ángulo inicial en grados.
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiStartAngleSweepAngle(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Crea un EllipseArc en un plano con los radios especificados a lo largo de los ejes X e Y y los ángulos a través de los cuales se realiza el barrido
plane: El plano en que se encuentra el EllipseArc
xRadius: El radio del EllipseArc en la dirección X del plano
yRadius: El radio del EllipseArc en la dirección Y del plano
startAngle: El ángulo inicial del arco medido desde el eje X positivo del plano de entrada
sweepAngle: El ángulo de barrido desde el ángulo inicial en grados
ellipsearc,arcs