Autodesk.DesignScript.Geometry.Mesh.ToString
Permite obtener una representación de cadena de la malla.

Autodesk.DesignScript.Geometry.Mesh.ByPointsFaceIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
Crea una malla a partir de una colección de puntos y una colección de IndexGroups que hacen referencia a la colección de puntos.
vertexPositions: List of points that determine vertex positions
indices: Indices for vertices
Returns: Mesh created from points
mesh,meshes