Autodesk.DesignScript.Geometry.Cuboid.ToString
Permite obtener una representación de cadena del cubo.

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(System.Double,System.Double,System.Double)
Crea un cubo centrado en el origen de SCU, con anchura, longitud y altura.
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Crea un cubo centrado en el punto de entrada, con anchura, longitud y altura especificadas.
origin: Origin point
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Crea un cubo centrado en el origen de SCU, con anchura, longitud y altura.
coordinateSystem: Sistema de coordenadas principal (centro del cubo)
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created from lengths
box,cube,cubebysize,bycoord,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Crea un cubo que abarca del punto inferior al punto superior.
lowPoint: Corner low point of cuboid
highPoint: Corner high point of cuboid
Returns: Cuboind created by corners
box,cube,byminmax,by corners,by points,cubes

Autodesk.DesignScript.Geometry.Cuboid.Length
Devuelve la distancia de longitud.                         Nota: se devuelven las cotas de entrada del cubo, NO las                   cotas de espacio real. Dicho de otra forma, si crea un cubo                   con la anchura del eje X y longitud 10 y lo transforma en un CoordinateSystem con                   una escala de 2 en X, la anchura seguirá siendo 10. ASM no permite                   extraer los vértices de un cuerpo de forma previsible, así que                    es imposible determinar las cotas tras una transformación.

Autodesk.DesignScript.Geometry.Cuboid.Width
Devuelve la distancia de anchura.                         Nota: se devuelven las cotas de entrada del cubo, NO las                   cotas de espacio real. Dicho de otra forma, si crea un cubo                   con la anchura del eje X y longitud 10 y lo transforma en un CoordinateSystem con                   una escala de 2 en X, la anchura seguirá siendo 10. ASM no permite                   extraer los vértices de un cuerpo de forma previsible, así que                    es imposible determinar las cotas tras una transformación.

Autodesk.DesignScript.Geometry.Cuboid.Height
Devuelve la distancia de altura.                         Nota: se devuelven las cotas de entrada del cubo, NO las                   cotas de espacio real. Dicho de otra forma, si crea un cubo                   con la anchura del eje X y longitud 10 y lo transforma en un CoordinateSystem con                   una escala de 2 en X, la anchura seguirá siendo 10. ASM no permite                   extraer los vértices de un cuerpo de forma previsible, así que                    es imposible determinar las cotas tras una transformación.