Autodesk.DesignScript.Geometry.Plane.ToString
Permite obtener una representación de cadena del plano.

Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Crea un plano centrado en el punto raíz, con el vector normal de entrada.
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crea un plano "orientado", colocado en el origen del punto con el vector normal, pero con una orientación específica al eje X. Esto no afecta a las operaciones de división, intersección y proyección, entre otras; solo especifica la orientación del CoordinateSystem de entrada.
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Los ejes X e Y se encuentran en el plano. El eje Z es el producto vectorial de los dos vectores.
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Ajusta un plano a los puntos de entrada. Básicamente un ajuste a un diagrama de dispersión de puntos 3D.
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Crea el plano que contiene la línea de entrada de entrada y el punto externo. El punto no puede encontrarse en la línea ni en el eje de la línea.
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
Crea un plano en el plano XY universal.
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
Crea un plano en el plano XZ universal.
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
Crea un plano en el plano YZ universal.
Returns: Plane at YZ plane of world

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
Genera un nuevo CoordinateSystem que representa este plano. Se basa en el origen y en la base de los ejes X e Y.
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
Crea un nuevo desfase de plano en este plano en la dirección normal aplicando la distancia especificada.
alongnormal,moveplane