Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
Permite obtener una representación de cadena de la TSplineTopology.

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
Devuelve vértice en índice especificado
index: Índice en el que obtener vértice
Returns: Vértice de T-Spline
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
Devuelve arista en índice especificado
index: Índice en el que obtener arista
Returns: Arista de T-Spline
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
Devuelve cara en índice especificado
index: Índice en el que obtener cara
Returns: Cara de T-Spline
tspline,face,byindex