Autodesk.DesignScript.Geometry.Rectangle.ToString
Permite obtener una representación de cadena del rectángulo.

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea un rectángulo mediante cuatro puntos de esquina.
points: List of corner points of rectangle
Returns: Rectangle created by corner points
rectbypointarray

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Crea un rectángulo mediante cuatro puntos de esquina.
p1: 1st corner point of rectangle
p2: 2nd corner point of rectangle
p3: 3rd corner point of rectangle
p4: 4th corner point of rectangle
Returns: Rectangle created by corner points
rectbypoints

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Crea un rectángulo centrado en el origen del SCU en el plano XY del SCU con la anchura (longitud del eje X) y longitud (longitud del eje Y) especificadas.
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Crea un rectángulo centrado en la raíz del plano de entrada, con la anchura (longitud del eje X del plano) y la longitud de entrada (longitud del eje Y del plano).
plane: Plane used to center rectangle
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crea un rectángulo centrado en el origen de entrada del plano XY del CoordinateSystem con la anchura (longitud del eje X) y la longitud (longitud del eje Y) especificadas.
coordinateSystem: Sistema de coordenadas del rectángulo (centro del rectángulo)
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created from width and length
rectbylengths