Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
Permite obtener una representación de cadena de la TSplineReflection.

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
Crea reflexión radial para simetría de T-Spline por plano especificado con recuento de segmentos especificados y ángulo especificado (en grados) entre cada par de segmentos.
plane: Plano cuya normal es eje para reflexión radial de T-Spline. Especificado en coordenadas universales
segmentsCount: Número de segmentos de reflexión radial
segmentAngle: Ángulo entre cada par de segmentos de simetría radial (en grados). Si se ajusta en 0, se define por (360/segmentsCount)
Returns: Reflexión radial de T-Spline
tspline,symmetry,reflection,radial