Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
Permite obtener una representación de cadena del CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.Identity
Crea un CoordinateSystem como el sistema de coordenadas universales.
Origen en 0, 0, 0; eje X en 1, 0, 0; eje Y en 0, 1, 0; eje Z en 0, 0, 1.
zero,wcs

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
Crea un CoordinateSystem con origen en el punto de entrada con los ejes X e Y
definidos como los ejes X e Y de SCU.
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByPlane(Autodesk.DesignScript.Geometry.Plane)
Crea un CoordinateSystem con origen igual al origen de plano de entrada.
Los ejes X e Y se encuentran en el plano, alineados con los ejes X e Y de plano.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crea un CoordinateSystem en el origen definido por los ejes X e Y,
y el eje Z ignorado por completo. Los vectores de entrada se normalizan antes de crear
el CoordinateSystem.
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
Determina si es posible obtener el valor inverso de este CoordinateSystem.
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
Comprueba la ortogonal de escala. Por ejemplo, si tiene un componente de corte.
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
Comprueba la ortogonal de escala y si todos los vectores están normalizados.
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
Crea un punto que representa el origen del CoordinateSystem.
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
Devuelve el eje X del CoordinateSystem.
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
Devuelve el eje Y del CoordinateSystem.
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
Devuelve el eje Z del CoordinateSystem.
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
Devuelve el escala del eje X del CoordinateSystem: la longitud del vector del eje X.

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
Devuelve la escala del eje Y del CoordinateSystem: la longitud del vector del eje Y.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
Devuelve la escala del eje Z del CoordinateSystem: la longitud del vector del eje Z.

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
Obtiene el valor inverso de este CoordinateSystem. Si se aplica este CoordinateSystem a un elemento de Geometry, se invierte el original.

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Aplica el argumento CoordinateSystem después de este. Resultado = este * otro.

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Aplica el argumento CoordinateSystem antes de este. Resultado = otro * este.

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
Devuelve un vector que contiene los factores de escala X, Y y Z.
Returns: Vector con escala ajustada
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
Determina si dos CoordinateSystems son iguales.
other: otro sistema de coordenadas
Returns: devuelve "true" (verdadero) si los sistemas de coordenadas son iguales.

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
Traslada cualquier CoordinateSystem especificado conforme a los
desplazamientos en las direcciones X, Y y Z definidos en SCU.
xTranslation: Desplazamiento en el eje X.
yTranslation: Desplazamiento en el eje Y.
zTranslation: Desplazamiento en el eje Z.
Returns: CoordinateSystem transformado.
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
Traslada el objeto en la dirección y la magnitud del vector de entrada.
direction: Vector para dirección de traslación
Returns: Sistema de coordenadas convertido
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Traslada cualquier tipo de CoordinateSystem la distancia especificada
en la dirección indicada.
direction: Vector de dirección de desplazamiento
distance: Distancia de desplazamiento en la dirección indicada
Returns: Sistema de coordenadas convertido
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforma este CoordinateSystem del CoordinateSystem de origen a un
nuevo CoordinateSystem de contexto.
Returns: CoordinateSystem transformado.

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Rota un objeto sobre un origen y un eje el número de grados especificado.
origin: Punto de origen
axis: Eje de vector para rotación
degrees: Grados que rotar
Returns: Sistema de coordenadas rotado
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rota un objeto sobre el origen y la normal del plano especificado por un determinado
grado
plane: Plano desde el que obtener la normal
degrees: Valor de rotación en grados
Returns: Sistema de coordenadas rotado
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
Escala de forma uniforme sobre el origen.
amount: Cantidad de ajuste de escala
Returns: Sistema de coordenadas con escala ajustada
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
Escala de forma no uniforme sobre el origen.
xamount: Cantidad de ajuste de escala en el eje X
yamount: Cantidad de ajuste de escala en el eje Y
zamount: Cantidad de ajuste de escala en el eje Z
Returns: Sistema de coordenadas con escala ajustada
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Escala de forma no uniforme sobre el plano especificado.
plane: Plano alrededor del que se aplica la escala
xamount: Cantidad de ajuste de escala en el eje X
yamount: Cantidad de ajuste de escala en el eje Y
zamount: Cantidad de ajuste de escala en el eje Z
Returns: Sistema de coordenadas con escala ajustada
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Escala de forma uniforme alrededor de un punto concreto, mediante
basePoint: Ajuste de escala del punto base
from: Punto de origen de ajuste de escala
to: Punto de destino de ajuste de escala
Returns: Sistema de coordenadas con escala ajustada
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Ajusta la escala en una cota mediante a los puntos base, inicial y final. El eje de escala se define mediante la línea entre el punto base y el punto inicial.
basePoint: Ajuste de escala del punto base
from: Punto de origen de ajuste de escala
to: Punto de destino de ajuste de escala
Returns: Sistema de coordenadas con escala ajustada
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Escala en dos dimensiones conforme a la base y dos puntos de selección. Los puntos de selección se proyectan al plano base para determinar los factores de escala 2D.
basePlane: Ajuste de escala del punto base
from: Punto de origen de ajuste de escala
to: Punto de destino de ajuste de escala
Returns: Sistema de coordenadas con escala ajustada
resize,size,from,to,scale2d,2d