Autodesk.DesignScript.Geometry.Arc.ToString
Permite obtener una representación de cadena del arco.

Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea un arco que mejor se aproxima a una colección de puntos
points: Lista de puntos a los que mejor se ajusta el arco
Returns: Arc created by best fit through points
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Crea un arco o biarco tangente mediante puntos de inicio y final y tangencias de inicio y final.
point1: Punto de inicio del biarco
vector1: Vector tangente para el inicio del biarco
point2: Punto para el final del biarco
vector2: Vector tangente para el final del biarco
arc,tangent

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Crea un arco del punto inicial al punto final con la tangente inicial al vector.
startPoint: Start point of arc
endPoint: End point of arc
startTangent: Start tangent direction vector
arc,tangent,arcs