Autodesk.DesignScript.Geometry.Properties.Resources.LowerModelerExtentExceeded
Busca una cadena localizada similar a Las entradas se encuentran fuera del rango de modelado permitido; considere la posibilidad de elegir el parámetro {0} con un rango de modelado entre {1} y {2} en el cuadro de diálogo "Configuración => Rango de trabajo de geometría".

Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
Busca una cadena localizada similar a Se ha superado la extensión de modelado permitida; considere la posibilidad de elegir valores más pequeños.

Autodesk.DesignScript.Geometry.Properties.Resources.UpperModelerExtentExceeded
Busca una cadena localizada similar a Las entradas se encuentran fuera del rango de modelado permitido; considere la posibilidad de elegir el parámetro {0} con un rango de modelado entre {1} y {2} en el cuadro de diálogo "Configuración => Rango de trabajo de geometría".