Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
Mecanismo de registro del tipo de geometría.
hostType: Interfaces derivadas del tipo de IGeometryEntity.
contructor: Un delegado para construir Geometry.

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
Traslada la geometría en la dirección especificada conforme a la longitud del vector.
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Traslada cualquier tipo de geometría conforme a la distancia especificada en la
dirección indicada.
direction: Dirección de desplazamiento.
distance: Distancia de desplazamiento en la dirección indicada.
Returns: Geometry transformada.
move,along vector,distance

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforma la geometría conforme a la transformación especificada de CoordinateSystem.
Returns: Geometría transformada

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforma esta geometría del CoordinateSystem de origen a un
nuevo CoordinateSystem de contexto.
Returns: Geometry transformada.
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rota un objeto sobre la normal y el origen del plano el número de
grados especificado.
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
Escala de forma no uniforme sobre el origen.
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Escala de forma no uniforme sobre el plano especificado.
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Escala de forma uniforme sobre el punto especificado y utiliza dos puntos de selección como escalares.
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Escala en una dimensión conforme a la base y dos puntos de selección. El eje de escala está definido por la línea entre base y desde el punto.
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Escala en dos dimensiones conforme a la base y dos puntos de selección. Los puntos de selección se proyectan al plano base para determinar los factores de escala 2D.
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
Obtiene la distancia entre esta Geometry y otra.
other: La otra Geometry.
Returns: La distancia.
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
Obtiene el punto más cercano de esta Geometry respecto a la otra.
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
Determina si otro objeto de Geometry interseca con este.
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
Obtiene la Geometry de intersección de este objeto y otro.
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Obtiene la intersección de Geometry para este objeto y una colección de otras Geometry. Detecta la geometría común entre todos los elementos.
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
Divide esta Geometry utilizando otra como herramienta de corte.
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
Comprueba si dos objetos tienen la misma geometría representativa o los mismos valores numéricos.
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
Obtiene el BoundingBox que contiene el elemento de Geometry especificado.
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
Convertir geometría en JSON de def. del sólido
Returns: Cadena con formato JSON

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
Importa un archivo SAT y devuelve una matriz de geometrías importadas
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
Importa un archivo SAT y devuelve una matriz de geometrías importadas.
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
Exporta la geometría especificada a la ruta de archivo SAT indicada.
filePath: El nombre de archivo al que exportar la geometría.

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
Exporta la geometría especificada a la ruta de archivo SAT indicada.
filePath: El nombre de archivo al que exportar la geometría.
unitsMM: Las unidades que se van a utilizar

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
Serializa la geometría especificada en el formato SAB (Standard ACIS Binary) y devuelve datos de secuencia binarios serializados.

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Serializa una lista de geometría especificada en el formato Standard ACIS Binary (SAB) y devuelve datos de secuencia binarios serializados.
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
Obtiene el sistema de coordenadas de contexto/referencia utilizado para crear esta geometría.