Autodesk.DesignScript.Geometry.PolyCurve.ToString
Permite obtener una representación de cadena de la PolyCurve.

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Cree una PolyCurve mediante la unión de curvas. Voltea la curva según sea necesario para la conectividad. Elija una tolerancia de unión preferida entre 1e-6 y 1e-3 unidades.
curves: Curvas para unir en PolyCurve
joinTolerance: Tolerancia para determinar el tamaño de hueco permitido entre las curvas que se van a unir.
Returns: PolyCurve creada por curvas unidas
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Crea una PolyCurve conectando puntos. Configure la entrada de 'connectLastToFirst' como true para cerrar la PolyCurve.
points: Puntos para realizar la PolyCurve
connectLastToFirst: "True" (verdadero) para conectar el último punto al primero y "false" para dejarla abierta.
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.Curves
Devuelve las curvas de la PolyCurve.
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
Devuelve las curvas de la PolyCurve por índice.
index: Longitud para ubicar el punto
endOrStart: "True" (verdadero) para contar desde el final de la PolyCurve y "false" para contar desde el principio.
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
Desfasa la PolyCurve en su plano.
signedDistance: Cantidad de desfase
extendCircular: Active o desactive para establecer las esquinas como circulares.
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Empalma la PolyCurve en su plano.
radius: Radio de empalme
rightSide: "True" (verdadero) para empalmar en el lado derecho relativo al inicio de la PolyCurve, "false" (falso) para empalmar en el lado izquierdo.
Returns: Filleted polyCurve
round,smooth,radius