Autodesk.DesignScript.Geometry.Ellipse.ToString
Permite obtener una representación de cadena de la elipse.

Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Crea una elipse centrada en el punto de entrada alineado con el plano XY del SCU con los radios de ejes X e Y especificados.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by origin and radii
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crea una elipse centrada en el punto de entrada, con los dos ejes especificados. Los ejes deben estar a 90 grados el uno del otro.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from origin vectors
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crea una elipse centrada y alineada con el CoordinateSystem de entrada, con un radio x_radius en la dirección X del sistema de coordenadas y un radio y_radius en la dirección Y del sistema de coordenadas.
origin: Origin coordinate system of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by coordinate system and radii
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Crea una elipse centrada y alineada con el plano de entrada, con un radio x_radius en la dirección del eje X del plano y un radio y_radius en la dirección del eje Y del plano.
plane: Plane where ellipse arc is drawn
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from plane and radii
ellipse,aligned ellipse,ellipsebylengths