Autodesk.DesignScript.Geometry.Polygon.ToString
Permite obtener una representación de cadena del polígono.

Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Comprueba si el punto está dentro de un polígono plano sin intersecciones propias.