Autodesk.DesignScript.Geometry.Helix.ToString
Permite obtener una representación de cadena de la hélice.

Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Crea una hélice. La hélice siempre gira hacia la derecha sobre la dirección de eje proporcionada. En visualizaciones orientadas en la dirección del eje, el usuario ve que el punto rota hacia la derecha alrededor del eje a medida que se desplaza a lo largo de la curva en la dirección del parámetro de incremento. El paso es la distancia que se mueve la hélice en la dirección del eje en cada giro. Este valor puede ser positivo o negativo.
axisPoint: Axis point
axisDirection: Axis direction vector
startPoint: Helix start point
pitch: Distance of the helix per each 360 degrees in the direction of the axis
angleTurns: How many turns in degrees
Returns: Helix created by axis
helix,screw,corkscrew,thread