Autodesk.DesignScript.Geometry.Cylinder.ToString
Permite obtener una representación de cadena del cilindro.

Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Genera un cilindro sólido definido por un CoordinateSystem principal, el radio y la altura del cilindro.
coordinateSystem: Sistema de coordenadas principal
radius: Radius size
height: Cylinder height
Returns: Cylinder created from radius and height
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Crea un cilindro sólido con los puntos centrales superior e inferior especificados para el cilindro.
startPoint: Start point of cylinder
endPoint: End point of cylinder
radius: Radius  of cylinder
Returns: Cylinder created by points and radius
cylinder,tube,by center points