Autodesk.DesignScript.Geometry.Point.ToString
Permite obtener una representación de cadena del punto.

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Compara dos puntos.
other: El otro punto
Returns: Si los dos objetos son iguales

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
Obtiene un código hash para este tipo
Returns: Un código hash exclusivo para este objeto

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
Genera un punto en el plano XY con las dos coordenadas cartesianas especificadas. El componente Z es 0.
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
Obtiene el punto de origen (0,0,0).
Returns: Origin point
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
Genera un punto con las tres coordenadas cartesianas especificadas.
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Genera un punto en el sistema de coordenadas especificado con tres coordenadas cartesianas.
coordinateSystem: Sistema de coordenadas principal
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
Elimina los puntos para excluir duplicados dentro de la tolerancia de los puntos incluidos.
points: Lista de puntos de los que eliminar duplicados
tolerance: Tolerancia utilizada para la eliminación
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near