Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
Permite obtener una representación de cadena de la TSplineSurface.

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea un plano de T-Spline "orientado", colocado en el origen del punto con el vector normal, pero con una orientación específica de eje X.
Esto no afecta a las operaciones de división, intersección, proyección, etcétera, solo especifica la orientación del CoordinateSystem de entrada.
origin: Punto raíz del plano
normal: Normal del plano
xAxis: Eje X del plano
minCorner: Punto 2D de esquina mínima en coordenadas del plano
maxCorner: Punto 2D de esquina máxima en coordenadas del plano
xSpans: Número de tramos en anchura
ySpans: Número de tramos en longitud
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Superficie de T-Spline de plano
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea un plano por origen y eje X e Y.
El eje Z es el producto vectorial de los dos vectores.
origin: Punto raíz del plano
xAxis: Eje X del plano
yAxis: Eje Y del plano
minCorner: Punto 2D de esquina mínima en coordenadas del plano
maxCorner: Punto 2D de esquina máxima en coordenadas del plano
xSpans: Número de tramos en anchura
ySpans: Número de tramos en longitud
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Superficie de T-Spline de plano
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCylinderRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Construye un cilindro de la T-Spline definido por un CoordinateSystem superior, el radio y la altura del cilindro
cs: El centro y la base del cilindro se ajustarán en el plano X-Y de este sistema de coordenadas.
radius: Radio de un cilindro
height: Altura de un cilindro
radiusSpans: Número de tramos en circunferencia
heightSpans: Número de tramos en altura
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Superficie de T-Spline cilíndrica
tspline,cylinder,radius,height

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea un cono de T-Spline con el radio base especificado en el punto inicial
y lo extiende hasta su vértice, en el punto final.
startPoint: Punto inicial de un cono
endPoint: Punto final de un cono
radius: Radio de la base del cono
radiusSpans: Número de tramos en circunferencia
heightSpans: Número de tramos en altura
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Superficie de T-Spline cónica
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea un cono de T-Spline con los radios especificados del punto inicial al punto final, con radios especificados al inicio y al final.
Este objeto no tiene vértice y tiene forma de tronco de cono.
startPoint: Punto inicial de un cono
endPoint: Punto final de un cono
startRadius: Radio inicial de un cono
endRadius: Radio final de un cono
radiusSpans: Número de tramos en circunferencia
heightSpans: Número de tramos en altura
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Superficie de T-Spline cónica
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea un cono de T-Spline con punto base en el origen del CoordinateSystem que se extiende en la dirección del eje Z del CoordinateSystem
y presenta una base circular en el plano XY del CoordinateSystem.
cs: El centro y la base del cono se ajustarán en el plano X-Y de este sistema de coordenadas.
height: Altura de un cono
radius: Radio de un cono
radiusSpans: Número de tramos en circunferencia
heightSpans: Número de tramos en altura
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Superficie de T-Spline cónica
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea un cono de T-Spline con punto base en el origen del CoordinateSystem que se extiende en la dirección del eje Z del CoordinateSystem
y presenta una base circular en el plano XY de CoordinateSystem.
cs: El centro y la base del cono se ajustarán en el plano X-Y de este sistema de coordenadas.
height: Altura de un cono
startRadius: Radio inicial de un cono
endRadius: Radio final de un cono
radiusSpans: Número de tramos en circunferencia
heightSpans: Número de tramos en altura
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Superficie de T-Spline cónica
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea una esfera de T-Spline que contiene cuatro puntos de entrada en la superficie.
points: Cuatro puntos en lista para crear una esfera. Los puntos no deben ser coplanares
radiusSpans: Número de tramos radiales
heightSpans: Número de tramos en altura
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Superficie de T-Spline esférica
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea un toroide de T-Spline con un centro y unos radios especificados, alineado con el plano XY universal por defecto
center: Centro de un toroide
innerRadius: Radio interior de un toroide
outerRadius: Radio exterior de un toroide
innerRadiusSpans: Número de tramos radiales interiores
outerRadiusSpans: Número de tramos radiales exteriores
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Superficie de T-Spline toroidal
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea un cuadro de T-Spline centrado en el punto de entrada, con anchura, longitud y altura especificadas.
origin: Centro de un cuadro
width: Anchura de un cuadro
length: Longitud de un cuadro
height: Altura de un cuadro
xSpans: Número de tramos en anchura
ySpans: Número de tramos en longitud
zSpans: Número de tramos en altura
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Cubo de T-Spline
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea un cuadro de T-Spline centrado y orientado al CoordinateSystem de entrada, con anchura, longitud y altura especificadas.
cs: El plano X-Y del cuadro se alineará con el plano X correspondiente.
width: Anchura de un cuadro
length: Longitud de un cuadro
height: Altura de un cuadro
xSpans: Número de tramos en anchura
ySpans: Número de tramos en longitud
zSpans: Número de tramos en altura
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Cubo de T-Spline
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea un cuadro de T-Spline que abarca del punto inferior al punto superior.
lowPoint: Primer punto de esquina
highPoint: Segundo punto de esquina
xSpans: Número de tramos en anchura
ySpans: Número de tramos en longitud
zSpans: Número de tramos en altura
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Cubo de T-Spline
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea una esfera de malla cuadrada de T-Spline con centro en el origen del CoordinateSystem y un radio especificado
cs: Sistema de coordenadas local
radius: Radio de esfera de malla cuadrada
spans: Número de tramos en dos dimensiones de los lados de la esfera de malla cuadrada.
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Esfera de malla cuadrada de T-Spline
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea una esfera de malla cuadrada de T-Spline con un centro y un radio especificados, alineada con el plano XY universal por defecto
center: Punto central de esfera de malla cuadrada
radius: Radio de esfera de malla cuadrada
spans: Número de tramos en dos dimensiones de los lados de la esfera de malla cuadrada
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Esfera de malla cuadrada de T-Spline
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Crea una superficie de T-Spline a partir de una superficie NURBS mediante una estrategia uniforme.
La superficie NURBS de entrada se vuelve a crear con nudos uniformes colocados en intervalos de longitud de arco o
paramétricos iguales según el correspondiente indicador useArcLen, y aproximada por
superficie NURBS de grado 3. La T-Spline de salida se divide por los recuentos de tramos especificados
en la direcciones U y V.
nurbsSurface: Superficie NURBS de entrada
uSpans: Número de tramos requeridos en la dirección U
vSpans: Número de tramos requeridos en la dirección V
uUseArcLen: Si se utiliza la longitud de arco o la subdivisión paramétrica en la dirección paramétrica U
vUseArcLen: Si se utiliza la longitud de arco o la subdivisión paramétrica en la dirección paramétrica V
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
Crea una superficie de T-Spline a partir de una superficie NURBS mediante una estrategia de subdivisión de curvatura.
La superficie NURBS se vuelve a crear en grado 3. La T-Spline de salida tiene recuentos de tramos y
se posiciona en cada dirección detectada automáticamente según la curvatura.
nurbsSurface: Superficie NURBS de entrada
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByExtrude(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Construye una T-Spline mediante la extrusión de una curva en el vector especificado.
curve: Curva de perfil
direction: Extruir vector
frontDistance: Extruir distancia por dirección de vector
backDistance: Extruir distancia respecto a dirección de vector
frontSpans: Número de tramos por dirección de vector. No se efectuará extrusión por dirección de vector si se pasa 0
backSpans: Número de tramos respecto a dirección de vector. No se efectuará extrusión por dirección de vector si se pasa 0
profileSpans: Número de tramos en dirección del perfil. Se define automáticamente si es 0 o menos
uniform: Utilizar estrategia uniforme o de curvatura para la distribución de tramos a lo largo dirección del perfil
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
tspline,extrude,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Crea una T-Spline mediante el barrido de una curva de sección transversal a lo largo de una trayectoria.
profile: Curva de perfil
path: Curva de trayectoria
parallel: Los tramos deben ser paralelos en la dirección de la trayectoria
pathSpans: Número de tramos en la trayectoria
profileSpans: Número de tramos en el perfil. Se define automáticamente si es 0 o menos
pathUniform: Utilizar estrategia uniforme o de curvatura para la distribución de tramos a lo largo de la trayectoria
profileUniform: Utilizar estrategia uniforme o de curvatura para la distribución de tramos a lo largo del perfil
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Crea una superficie de T-Spline mediante el barrido de la curva de perfil alrededor del eje formado
por el origen del eje y la dirección del eje. El ángulo inicial es start_angle y el barrido se realiza en el ángulo de sweep_angle, que se expresan en ambos casos en grados.
profile: Curva de perfil
axisOrigin: Centro de rotación
axisDirection: Eje de rotación
startAngle: Ángulo en el que iniciar la rotación
sweepAngle: Ángulo en el que finalizar la rotación
radialSpans: Número de tramos en radio
axialSpans: Número de tramos en altura. Se define automáticamente si es 0 o menos
uniform: Utilizar estrategia uniforme o de curvatura para la distribución de tramos
symmetry: Opciones de simetría de una superficie de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Crea una superficie de tubería a partir de una red de curvas o líneas.
Se crea una unión lisa en cada intersección de curva.
Algunos parámetros toman un solo valor o lista - dos valores por curva.
curves: Lista de curvas con las que crear tuberías
defaultRadius: Radio por defecto para las tuberías creadas
snappingTolerance: Tolerancia utilizada para detectar intersecciones de curva
segmentsCount: Número de segmentos de cada tubería. Se permite un único valor o una lista, dos veces la longitud del número de curvas.
endRotations: Valores de rotaciones finales para cada conducto (en grados). Un solo valor o lista, se permite una longitud doble del recuento de curvas
endRadii: Valores de radios finales para cada conducto. Un solo valor o lista, se permite una longitud doble del recuento de curvas
endPercentage: Valores (de 0 a 1) del extremo de cada curva de entrada al inicio de la malla de conductos. Un solo valor o lista, se permite una longitud doble del recuento de curvas
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Cree una superficie de tuberías a partir de una red de curvas o líneas.
Se crea una unión suave en cada intersección de la curva.
Algunos parámetros adoptan un único valor o una lista, un valor por curva.
curves: Lista de curvas con las que crear tuberías
defaultRadius: Radio por defecto para las tuberías creadas
snappingTolerance: Tolerancia utilizada para detectar intersecciones de curva
segmentsCount: Número de segmentos de cada curva. El tamaño de la lista puede ser el número de curvas, o bien 1 para la replicación o 0 para la determinación automática.
autoHandleStart: Si el valor es true, se generan automáticamente los parámetros del identificador al inicio de cada curva y se omiten los parámetros personalizados de rotationsAtStart, radiiAtStart y positionsAtStart.
autoHandleEnd: Si el valor es true, se generan automáticamente los parámetros del identificador al final de cada curva y se omiten los parámetros personalizados de rotationsAtEnd, radiiAtEnd y positionsAtEnd.
startRotations: Ángulo de rotación personalizado en grados para cada identificador de tubería al inicio de cada curva. Este parámetro se omitirá si autoHandleStart se establece en true. El tamaño de la lista puede ser el número de curvas o 1 para la replicación.
endRotations: Ángulo de rotación personalizado en grados para cada identificador de tubería al final de cada curva. Este parámetro se omitirá si autoHandleEnd se establece en true. El tamaño de la lista puede ser el número de curvas o 1 para la replicación.
startRadii: Radio personalizado para cada identificador de tubería al inicio de cada curva. Este parámetro se omitirá si autoHandleStart se establece en true. El tamaño de la lista puede ser el número de curvas o 1 para la replicación.
endRadii: Radio personalizado para cada identificador de tubería al final de cada curva. Este parámetro se omitirá si autoHandleEnd se establece en true. El tamaño de la lista puede ser el número de curvas o 1 para la replicación.
startPositions: Posición personalizada de cada identificador de tubería al inicio de cada curva en forma de porcentaje entre 0 y 1 a lo largo de la longitud de arco de la curva. Este parámetro se omitirá si autoHandleStart se establece en "true" (verdadero). El tamaño de la lista puede ser el número de curvas o 1 para la replicación. Las posiciones inicial y final no deben superponerse entre sí en cada curva. La posición inicial ideal debe ser próxima a 0, mientras que la posición final ideal debe ser próxima a 1.
endPositions: Posición personalizada de cada identificador de tubería al inicio de cada curva en forma de porcentaje entre 0 y 1 a lo largo de la longitud de arco de la curva. Este parámetro se omitirá si autoHandleEnd se establece en "true" (verdadero). El tamaño de la lista puede ser el número de curvas o 1 para la replicación. Las posiciones inicial y final no deben superponerse entre sí en cada curva. La posición inicial ideal debe ser próxima a 0, mientras que la posición final ideal debe ser próxima a 1.
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
Combina superficies de T-Spline especificadas en una sola.
Las superficies no se pueden conectar entre sí.
Si al menos una superficie está en modo de cuadro, la superficie de salida también estará en modo de cuadro.
tSplineSurfaces: Superficies de T-Spline que combinar
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
Si T-Spline está en modo de cuadro o suavizado
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
Si T-Spline está abierta.
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Convierte la superficie de T-Spline en sólido o superficie según la forma
matchTopology: Determina si el cuerpo resultante tiene la misma topología que T-Spline
Returns: Entidad de topología (sólido o superficie)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
Convierte la superficie de T-Spline en malla. La malla puede tener triángulos y cuadrados.
minSegments: Número mínimo de segmentos en cada dirección. Al menos se producirá siempre un segmento.
tolerance: Distancia máxima permitida de la malla a la superficie. Si se define en cero o en un valor negativo, se desactivará
Returns: Entidad de malla
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
Suelda la lista especificada de vértices en un solo vértice.
vertices: Vértices que soldar
newPosition: Posición del pinzamiento de vértice resultante. Se utiliza la posición media de los pinzamientos si se pasa null.
keepSubdCreases: Mantener los pliegues subdivididos de la topología de entrada
Returns: Superficie de T-Spline con vértices soldados
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Anula la soldadura de todas las aristas especificadas. Anulará la soldadura de cada vértice de todas las aristas.
edges: Conjunto de aristas de las que anular la soldadura
Returns: Superficie de T-Spline con aristas sin soldar
tspline,unweld,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Crea coincidencia con T-Spline y bucle cerrado de curvas
tsEdges: Bucle de arista de T-Spline cerrado con el que crear coincidencia
curves: Bucle de curva cerrado con el que crear coincidencia
continuity: Continuidad de geometría con el que intentar hacer coincidir: G0, G1, G2
useArclength: Si se utiliza alineación de arcLength mientras se crea coincidencia
useRefinement: Si es true, se añadirán puntos de control extra a la T-Spline para hacer coincidir las superficies dentro de una tole­rancia especificada.
numRefinementSteps: Número máximo de pasos de refinado. Se ignora si useRefinement se define en false
refinementTolerance: Tolerancia que conseguir. Se ignora si useRefinement se define en false
usePropagation: Si se utiliza propagación mientras se crea coincidencia
widthOfPropagation: Determina la cantidad de superficie afectada por la coincidencia. Se ignora si usePropagation se define en false
tangentScale: Escala de tangente. Se ignora si la continuidad no se define en G1
curvParamWeight: Peso de parámetro de curvatura. Se ignora si la continuidad no se define en G2
flipSourceTargetAlignment: Si se invierte la dirección de alineación
Returns: Superficie de T-Spline posicionada entre las aristas de borde de T-Spline y el bucle de curva
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Crear una coincidencia con T-Spline y bucle cerrado de curvas
tsEdges: Bucle de arista de T-Spline cerrado con el que crear una coincidencia
curves: Bucle de curva cerrado con el que crear una coincidencia
continuity: Continuidad de geometría para el intento de coincidencia: G0, G1, G2
useArclength: Si se utiliza la alineación de arcLength mientras se crea una coincidencia
useRefinement: Si el valor es true, se añadirán puntos de control adicionales a la T-Spline para hacer coincidir las superficies dentro de una tole­rancia especificada.
numRefinementSteps: Número máximo de pasos de refinamiento. Se omitirá si useRefinement se establece en false.
refinementTolerance: Tolerancia que conseguir. Se omitirá si useRefinement se establece en false.
usePropagation: Si se utiliza la propagación mientras se crea una coincidencia
widthOfPropagation: Determina la cantidad de superficie afectada por la coincidencia. Se omitirá si usePropagation se establece en false.
scale: Escala de tangente para G1 o escala de curvatura para G2. Se omitirá si la continuidad es G0.
flipSourceTargetAlignment: Si se invierte la dirección de alineación
Returns: Superficie de T-Spline colocada entre las aristas de borde de T-Spline y el bucle de curva
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Crea una coincidencia con T-Spline y bucle cerrado de aristas de BRep. Primero,
el bucle de arista se convierte a bucle de curva y después se efectúa la coincidencia
tsEdges: Bucle de arista de T-Spline cerrado con el que crear coincidencia
brepEdges: Bucle de arista de BRep cerrado con el que crear coincidencia
continuity: Continuidad de geometría con el que intentar hacer coincidir: G0, G1, G2
useArclength: Si se utiliza alineación de arcLength mientras se crea coincidencia
useRefinement: Si es true, se añadirán puntos de control extra a la T-Spline para hacer coincidir las superficies dentro de una tole­rancia especificada.
numRefinementSteps: Número máximo de pasos de refinado. Se ignora si useRefinement se define en false
refinementTolerance: Tolerancia que conseguir. Se ignora si useRefinement se define en false
usePropagation: Si se utiliza propagación mientras se crea coincidencia
widthOfPropagation: Determina la cantidad de superficie afectada por la coincidencia. Se ignora si usePropagation se define en false
tangentScale: Escala de tangente. Se ignora si la continuidad no se define en G1
curvParamWeight: Peso de parámetro de curvatura. Se ignora si la continuidad no se define en G2
flipSourceTargetAlignment: Si se invierte la dirección de alineación
Returns: Superficie de T-Spline posicionada entre las aristas de borde de T-Spline y el bucle de arista de BRep especificados
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Crear una coincidencia con T-Spline y bucle cerrado de aristas de BRep. El bucle
se convierte primero en un bucle de curva y, a continuación, se realiza la coincidencia.
tsEdges: Bucle de arista de T-Spline cerrado con el que crear una coincidencia
brepEdges: Bucle de arista de BRep cerrado con el que crear una coincidencia
continuity: Continuidad de geometría para el intento de coincidencia: G0, G1, G2
useArclength: Si se utiliza la alineación de arcLength mientras se crea una coincidencia
useRefinement: Si el valor es true, se añadirán puntos de control adicionales a la T-Spline para hacer coincidir las superficies dentro de una tole­rancia especificada.
numRefinementSteps: Número máximo de pasos de refinamiento. Se omitirá si useRefinement se establece en false.
refinementTolerance: Tolerancia que conseguir. Se omitirá si useRefinement se establece en false.
usePropagation: Si se utiliza la propagación mientras se crea una coincidencia
widthOfPropagation: Determina la cantidad de superficie afectada por la coincidencia. Se omitirá si usePropagation se establece en false.
scale: Escala de tangente para G1 o escala de curvatura para G2. Se omitirá si la continuidad es G0.
flipSourceTargetAlignment: Si se invierte la dirección de alineación
Returns: Superficie de T-Spline colocada entre las aristas de borde de T-Spline y el bucle de arista de BRep especificados
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
Cambia el estilo de visualización de T-Spline.
Visualización suave si se pasa true, de lo contrario es de cuadro.
enable: Activar o desactivar visualización suave
Returns: T-Spline con estilo de visualización elegido
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Crea puente entre dos conjuntos de caras. Los elementos del primer grupo
se consideran subordinados de esta superficie. Los elementos del segundo
grupo pueden ser subordinados de esta superficie o pertenecer a
otra superficie. La topología en cada grupo quizá no sea adyacente,
pero debe crear el mismo recuento de bucles diferenciados.
firstGroup: Primer grupo de caras en las que crear puente
secondGroup: Segundo grupo de caras en las que crear puente
followCurves: Creando puente en curvas para bucle de tipología
diferenciado (se usan líneas rectas si se pasa lista vacía, si se pasa una
curva, se replica si se detecta más de un bucle de entrada)
frameRotations: Número de rotaciones completas alrededor
de la normal de los marcos en la curva con puente para cada bucle
diferenciado de topología (se usa 0 si se pasa lista vacía, si se pasa un valor,
se replica si se detecta más de un bucle de entrada)
spansCounts: Número de segmentos a lo largo del puente para
cada bucle diferenciado de topología. El recuento de tramos de cada grupo debe ser
mayor que el correspondiente número de rotaciones (se usa 1 si se pasa
lista vacía, si se pasa un valor, se replica si se detecta más de
un bucle de entrada)
cleanBorderBridges: Elimina puentes entre aristas de borde.
keepSubdCreases: Mantiene los pliegues subdivididos de la
topología de entrada
firstAlignVertices: Lista de vértices de orientación para
cada bucle diferenciado de topología del primer grupo (el número de vértices debe
ser el mismo que los bucles de entrada detectados o la lista puede estar vacía)
secondAlignVertices: Lista de vértices de orientación para
cada bucle diferenciado de topología del segundo grupo (el número de vértices debe
ser el mismo que los bucles de entrada detectados o la lista puede estar vacía)
flipAlignmentFlags: Lista de indicadores que muestran si
voltear la alineación de puente del bucle de topología correspondiente
(se define en false si se pasa lista vacía, si se pasa un valor, se replica
para cada bucle de entrada detectado)
Returns: Superficie de T-Spline con topología, conectada por puente
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Crea puente entre conjunto de caras y conjunto de aristas. Los elementos del
primer grupo se consideran subordinados de esta superficie. Los elementos
del segundo grupo pueden ser subordinados de esta superficie o pertenecer
a otra superficie. La topología en cada grupo quizá no sea
adyacente, pero debe crear el mismo recuento de bucles diferenciados.
firstGroup: Primer grupo de caras en las que crear puente
secondGroup: Segundo grupo de caras en las que crear puente
followCurves: Creando puente en curvas para bucle de tipología
diferenciado (se usan líneas rectas si se pasa lista vacía, si se pasa una
curva, se replica si se detecta más de un bucle de entrada)
frameRotations: Número de rotaciones completas alrededor
de la normal de los marcos en la curva con puente para cada bucle
diferenciado de topología (se usa 0 si se pasa lista vacía, si se pasa un valor,
se replica si se detecta más de un bucle de entrada)
spansCounts: Número de segmentos a lo largo del puente para
cada bucle diferenciado de topología. El recuento de tramos de cada grupo debe ser
mayor que el correspondiente número de rotaciones (se usa 1 si se pasa
lista vacía, si se pasa un valor, se replica si se detecta más de
un bucle de entrada)
cleanBorderBridges: Elimina puentes entre aristas de borde.
keepSubdCreases: Mantiene los pliegues subdivididos de la
topología de entrada
firstAlignVertices: Lista de vértices de orientación para
cada bucle diferenciado de topología del primer grupo (el número de vértices debe
ser el mismo que los bucles de entrada detectados o la lista puede estar vacía)
secondAlignVertices: Lista de vértices de orientación para
cada bucle diferenciado de topología del segundo grupo (el número de vértices debe
ser el mismo que los bucles de entrada detectados o la lista puede estar vacía)
flipAlignmentFlags: Lista de indicadores que muestran si
voltear la alineación de puente del bucle de topología correspondiente
(se define en false si se pasa lista vacía, si se pasa un valor, se replica
para cada bucle de entrada detectado)
Returns: Superficie de T-Spline con topología, conectada por puente
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Crea puente entre conjunto de aristas y conjunto de caras. Los elementos del
primer grupo se consideran subordinados de esta superficie. Los elementos del
segundo grupo pueden ser subordinados de esta superficie o pertenecer
a otra superficie. La topología en cada grupo quizá no sea
adyacente, pero debe crear el mismo recuento de bucles diferenciados.
firstGroup: Primer grupo de aristas en las que crear puente
secondGroup: Segundo grupo de caras en las que crear puente
followCurves: Creando puente en curvas para bucle de tipología
diferenciado (se usan líneas rectas si se pasa lista vacía, si se pasa una
curva, se replica si se detecta más de un bucle de entrada)
frameRotations: Número de rotaciones completas alrededor
de la normal de los marcos en la curva con puente para cada bucle
diferenciado de topología (se usa 0 si se pasa lista vacía, si se pasa un valor,
se replica si se detecta más de un bucle de entrada)
spansCounts: Número de segmentos a lo largo del puente para
cada bucle diferenciado de topología. El recuento de tramos de cada grupo debe ser
mayor que el correspondiente número de rotaciones (se usa 1 si se pasa
lista vacía, si se pasa un valor, se replica si se detecta más de
un bucle de entrada)
cleanBorderBridges: Elimina puentes entre aristas de borde.
keepSubdCreases: Mantiene los pliegues subdivididos de la
topología de entrada
firstAlignVertices: Lista de vértices de orientación para
cada bucle diferenciado de topología del primer grupo (el número de vértices debe
ser el mismo que los bucles de entrada detectados o la lista puede estar vacía)
secondAlignVertices: Lista de vértices de orientación para
cada bucle diferenciado de topología del segundo grupo (el número de vértices debe
ser el mismo que los bucles de entrada detectados o la lista puede estar vacía)
flipAlignmentFlags: Lista de indicadores que muestran si
voltear la alineación de puente del bucle de topología correspondiente
(se define en false si se pasa lista vacía, si se pasa un valor, se replica
para cada bucle de entrada detectado)
Returns: Superficie de T-Spline con topología, conectada por puente
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Crea puente entre dos grupos de aristas. Los elementos del
primer grupo se consideran subordinados de esta superficie. Los elementos del
segundo grupo pueden ser subordinados de esta superficie o pertenecer
a otra superficie. La topología en cada grupo podría no ser
adyacente, pero debe crear el mismo recuento de bucles diferenciados.
firstGroup: Primer grupo de aristas en las que crear puente
secondGroup: Segundo grupo de caras en las que crear puente
followCurves: Creando puente en curvas para bucle de tipología
diferenciado (se usan líneas rectas si se pasa lista vacía, si se pasa una
curva, se replica si se detecta más de un bucle de entrada)
frameRotations: Número de rotaciones completas alrededor
de la normal de los marcos en la curva con puente para cada bucle
diferenciado de topología (se usa 0 si se pasa lista vacía, si se pasa un valor,
se replica si se detecta más de un bucle de entrada)
spansCounts: Número de segmentos a lo largo del puente para
cada bucle diferenciado de topología. El recuento de tramos de cada grupo debe ser
mayor que el correspondiente número de rotaciones (se usa 1 si se pasa
lista vacía, si se pasa un valor, se replica si se detecta más de
un bucle de entrada)
cleanBorderBridges: Elimina puentes entre aristas de borde.
keepSubdCreases: Mantiene los pliegues subdivididos de la
topología de entrada
firstAlignVertices: Lista de vértices de orientación para
cada bucle diferenciado de topología del primer grupo (el número de vértices debe
ser el mismo que los bucles de entrada detectados o la lista puede estar vacía)
secondAlignVertices: Lista de vértices de orientación para
cada bucle diferenciado de topología del segundo grupo (el número de vértices debe
ser el mismo que los bucles de entrada detectados o la lista puede estar vacía)
flipAlignmentFlags: Lista de indicadores que muestran si
voltear la alineación de puente del bucle de topología correspondiente
(se define en false si se pasa lista vacía, si se pasa un valor, se replica
para cada bucle de entrada detectado)
Returns: Superficie de T-Spline con topología, conectada por puente
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
Rellenar agujeros en una T-Spline
edges: Conjunto de aristas con agujero dentro. Las aristas deben estar en el borde.
fillMethod: Método para rellenar agujero: 0 - triangulación, 1 - n-gonos, 2 - contraer, 3 - contraer y soldar
keepSubdCreases: Mantener los pliegues subdivididos de la topología de entrada
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
Comprime toda la topología de la superficie y convierte los índices en contiguos. Esta función mantiene el orden relativo de los índices.
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
Adelantar la interpolación mueve los puntos de control a sus ubicaciones paramétricas en la superficie. Invertir la interpolación genera un punto en la superficie para cada punto de control original y mueve dicho punto de control a su punto de superficie correspondiente.
reverse: Dirección de interpolación: adelante si se define en false, atrás en caso contrario
Returns: T-Spline interpolada en la dirección especificada
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Aplana puntos de control de vértices especificados en un solo plano.
Este comando requiere entrar un mínimo de cuatro vértices
vertices: Lista de vértices
Returns: Superficie de T-SPline con vértices aplanados
tspline,flatten,vertices

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Plane)
Aplana puntos de control de vértices especificados en un solo plano
que será paralelo al plano especificado.
Este comando requiere entrar un mínimo de cuatro vértices
vertices: Lista de vértices
parallelPlane: Plano al que ajustar vértices paralelos
Returns: Superficie de T-SPline con vértices aplanados
tspline,flatten,vertices,fitparallel

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Copia las caras elegidas en la superficie nueva. La superficie nueva no tiene simetría
faces: Caras que duplicar
Returns: Superficie de T-Spline solo con caras seleccionadas
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Mueve vértices especificados en el vector especificado
vertices: Lista de vértices que mover
vector: Dirección en la que mover
onSurface: Indicador que muestra si se utiliza superficie o puntos de control de vértices

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSS(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface},System.String)
Exporta un conjunto especificado de superficies de T-Spline a un archivo de escena de T-Spline
tSplineSurfaces: Conjunto de superficies de T-Spline que exportar
filePath: Ruta del archivo en el que guardar
Returns: Ruta del archivo donde se guarda el conjunto de T-Spline
tspline,export,save,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface,System.String)
Exporta superficie de T-Spline a archivo de malla de T-Spline
tSplineSurface: Superficie de T-Spline que exportar
filePath: Ruta del archivo en el que guardar
Returns: Ruta del archivo donde se guarda la superficie de T-Spline
tspline,export,save,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
Escribe una superficie de T-Spline en una cadena en formato de malla de T-Spline.
tSplineSurface: Superficie de T-Spline que serializar
Returns: Cadena en la que se serializa la superficie de T-Spline
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
Crea una superficie de T-Spline a partir de la cadena en formato de malla de T-Spline.
content: Representación de cadena del archivo de malla de T-Spline
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Superficie de T-Spline recién cargada en lista
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
Carga una superficie de T-Spline de un archivo de malla de T-Spline especificado
filePath: Ruta del archivo del que cargar
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Superficie de T-Spline recién cargada en lista
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.IO.FileInfo,System.Boolean)
Carga una superficie de T-Spline de un archivo de malla de T-Spline especificado
file: Archivo del que cargar
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Superficie de T-Spline recién cargada en lista
tspline,import,load,tsm,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
Carga conjunto de superficies de T-Spline de archivo de escena de T-Spline especificado
filePath: Ruta del archivo del que cargar
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Conjunto de superficies de T-Spline recién cargadas
tspline,import,load,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.IO.FileInfo,System.Boolean)
Carga conjunto de superficies de T-Spline de archivo de escena de T-Spline especificado
file: Archivo del que cargar
inSmoothMode: Mostrar superficie de T-Spline en visualización de cuadro o suave
Returns: Conjunto de superficies de T-Spline recién cargadas
tspline,import,load,tss,file