Autodesk.DesignScript.Geometry.Edge.ToString
Permite obtener una representación de cadena de la arista.

Autodesk.DesignScript.Geometry.Edge.CurveGeometry
La curva subyacente que forma la arista.

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
Las caras adyacentes a esta arista.

Autodesk.DesignScript.Geometry.Edge.StartVertex
El vértice en que empieza esta arista.

Autodesk.DesignScript.Geometry.Edge.EndVertex
El vértice en que termina esta arista.