Autodesk.DesignScript.Geometry.Cone.ToString
Permite obtener una representación de cadena del cono.

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Crea un cono con el radio base especificado en el punto inicial y lo extiende hasta su vértice, en el punto final.
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Crea un cono cuyo eje se traza del punto de inicio al punto final y que utiliza los radios especificados para inicio y fin. Este objeto no tiene vértice y parece un cono recortado.
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crea un cono con punto base en el origen del CoordinateSystem que se extiende en la dirección del eje Z del CoordinateSystem según el valor especificado y presenta una base circular en el plano XY de CoordinateSystem.

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Crea un cono con punto base en el origen del CoordinateSystem que se extiende en la dirección del eje Z del CoordinateSystem según el valor especificado y presenta bases circulares en el plano XY de CoordinateSystem.
cone,cone by height,cones