DSCore.List.Cycle(System.Collections.IList,System.Int32)
Crée une liste en concaténant des copies de la liste indiquée.
list: Liste à répéter.
amount: Nombre de répétitions.
Liste des listes répétées de type: var[]..[]
repeat,repeated,duplicate,repeated list,concat list