DSCore.DummyPythonEvaluator
L'évaluateur Python ne fera que générer une erreur d'évaluation.
Il est principalement utilisé pour indiquer qu'un véritable évaluateur Python n'a pas pu être trouvé.

DSCore.DummyPythonEvaluator.Evaluate(System.String,System.Collections.IList,System.Collections.IList)
Génère une exception avec le message affecté