DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Ecrire l'image dans un chemin d'accès avec le nom de fichier spécifié.
image: Image à enregistrer
Aucune sortie
write image,image,file,filepath