Autodesk.DesignScript.Geometry.PolySurface.ToString
Obtenir une représentation de la polysurface sous forme de chaîne

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Créer une polysurface via le balayage d'une courbe le long d'un rail.
rail: Courbe de balayage
profile: Profil de balayage
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Rechercher les surfaces par point. Récupère la première intersection dans la direction avant. Renvoie une surface si l'intérieur de la surface est atteint, deux si l'intérieur de l'arête est atteint, et de nombreuses surfaces si le sommet est atteint
surfacesatpoint,findsurfaces,extractsurfaces

Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
Renvoie le nombre de surfaces de la polysurface.
Returns: Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
Renvoie le nombre d'arêtes de la polysurface.
Returns: Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
Renvoie le nombre de sommets de la polysurface.
Returns: Number of vertices