Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
Obtenir une représentation de la chaîne TSplineSurface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créer un « orienté " plan T-Spline, positionnés au point d'origine avec le vecteur normal, mais avec une orientation de l'axe X.
Cela n'a aucune incidence sur la scission, intersection, projet, etc., il n'indique l'orientation du CoordinateSystem d'entrée.
origin: Point racine du plan
normal: Normale de plan
xAxis: Axe X du plan
minCorner: Point 2D de coin minimal dans les coordonnées du plan
maxCorner: Point 2D de coin maximal dans les coordonnées du plan
xSpans: Nombre de travées dans la largeur
ySpans: Nombre de travées dans la longueur
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Le plan de la surface de T-spline
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créer un plan par l'origine et l'axe X, Y.
L'axe Z est le produit vectoriel de deux vecteurs.
origin: Point racine du plan
xAxis: Axe X du plan
yAxis: Axe Y du plan
minCorner: Point 2D de coin minimal dans les coordonnées du plan
maxCorner: Point 2D de coin maximal dans les coordonnées du plan
xSpans: Nombre de travées dans la largeur
ySpans: Nombre de travées dans la longueur
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Le plan de la surface de T-spline
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créer un Cone avec les T-Splines rayon de base donné au point de départ
Prolongement d'un sommet au niveau du point de fin.
startPoint: Le point de départ d'un cône
endPoint: Point de fin d'un cône
radius: Rayon de la base du cône
radiusSpans: Nombre de travées dans la circonférence
heightSpans: Nombre de travées dans Hauteur
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Conique de la surface de T-spline
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créer un Cone avec un axe T-Splines à partir du point de départ au point d'arrivée, avec un rayon donné au début et à la fin.
Cet objet ne possède pas de sommet, et sous la forme d'un tronc de cône.
startPoint: Le point de départ d'un cône
endPoint: Point de fin d'un cône
startRadius: Rayon de départ du cône
endRadius: Rayon de fin d'un cône
radiusSpans: Nombre de travées dans la circonférence
heightSpans: Nombre de travées dans Hauteur
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Conique de la surface de T-spline
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créez un cône de T-splines avec le point de base au niveau de l'origine du système de coordonnées, s'étendant dans la direction de l'axe Z de ce dernier,
avec une base circulaire sur le plan XY du système de coordonnées.
cs: Le centre et la base du cône seront ajustés au plan X-Y de ce système de coordonnées
height: Hauteur du cône
radius: Rayon d'un cône
radiusSpans: Nombre de travées dans la circonférence
heightSpans: Nombre de travées dans Hauteur
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Conique de la surface de T-spline
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créer un Cone de T-Splines avec le point de base au niveau de l'origine du CoordinateSystem, s'étendant dans la direction de l'axe Z du CoordinateSystem,
avec sa base circulaire dans le plan XY du CoordinateSystem.
cs: Le centre et la base seront ajustés au plan X-Y de ce système de coordonnées
height: Hauteur du cône
startRadius: Rayon de départ du cône
endRadius: Rayon de fin d'un cône
radiusSpans: Nombre de travées dans la circonférence
heightSpans: Nombre de travées dans Hauteur
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Conique de la surface de T-spline
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créez une sphère T-Spline contenant quatre points d'entrée sur la surface.
points: Quatre points dans la liste pour créer une sphère. Les points ne doivent pas être coplanaires
radiusSpans: Nombre de travées radiale
heightSpans: Nombre de travées dans Hauteur
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: La surface T-Spline sphérique
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créer un tore T-Splines sur Centre et rayon, aligné sur le plan de l'univers XY par défaut
center: Centre d'un tore
innerRadius: Rayon interne du tore
outerRadius: Le rayon externe du tore
innerRadiusSpans: Nombre de travées radial interne
outerRadiusSpans: Nombre de travées Radial externe
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: La surface T-Spline toroïdale
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créez une boîte T-Spline centrée au niveau du point d'entrée, avec la largeur, de la longueur et de la hauteur.
origin: Centre d'une boîte
width: Largeur de la boîte
length: Longueur de la boîte
height: Hauteur de la boîte
xSpans: Nombre de travées dans la largeur
ySpans: Nombre de travées dans la longueur
zSpans: Nombre de travées dans Hauteur
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Cuboid T-Spline
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créez une boîte T-Spline centré et orienté au CoordinateSystem d'entrée, avec la largeur, de la longueur et de la hauteur.
cs: Le plan X-Y de la zone sera aligné avec la valeur X correspondante
width: Largeur de la boîte
length: Longueur de la boîte
height: Hauteur de la boîte
xSpans: Nombre de travées dans la largeur
ySpans: Nombre de travées dans la longueur
zSpans: Nombre de travées dans Hauteur
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Cuboid T-Spline
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créez une boîte T-Spline étendue à partir d'un point bas à point haut.
lowPoint: Premier coin
highPoint: Deuxième coin
xSpans: Nombre de travées dans la largeur
ySpans: Nombre de travées dans la longueur
zSpans: Nombre de travées dans Hauteur
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Cuboid T-Spline
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créer un quadball T-Splines au niveau de l'origine du CoordinateSystem avec un centre et un rayon donné
cs: Système de coordonnées local
radius: Quadball rayon
spans: Nombre de travées dans deux cotes des côtés du quadball
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Quadball T-Spline
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créer un quadball T-Splines sur Centre et rayon, aligné sur le plan de l'univers XY par défaut
center: Un point de centre
radius: Quadball rayon
spans: Nombre de travées dans deux cotes des côtés du quadball
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Quadball T-Spline
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Construire la surface T-spline de surface NURBS à l'aide de stratégie uniforme.
Entrée surface NURBS est recréé avec des noeuds placés à égale ou paramétrique
Longueur de l'arc intervalles en fonction correspondant useArcLen indicateur et approximativement par
Degré 3 surface NURBS. Sortie de la T-spline est divisée par le nombre de travée donnée
dans les directions U et V.
nurbsSurface: Entrée d'une surface NURBS
uSpans: Nombre de travées requis dans la direction U.
vSpans: Nombre de travées requis dans la direction V
uUseArcLen: Si vous utilisez la longueur d'arc ou de subdivision paramétrique dans la direction U paramétrique
vUseArcLen: Si vous utilisez la longueur d'arc ou de subdivision paramétrique dans la direction V paramétrique
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
Construire la surface T-spline courbure de surface NURBS à l'aide de la subdivision de stratégie.
Reconstruction d'une surface NURBS au degré 3. de sortie de la T-spline est étendue et
Positions dans chaque direction détectée automatiquement en fonction de la courbure.
nurbsSurface: Entrée d'une surface NURBS
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByExtrude(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Construire une T-Spline par extrusion d'une courbe le long d'un vecteur donné.
curve: Courbe de profil
direction: Vecteur d'extrusion
frontDistance: Distance d'extrusion selon la direction du vecteur
backDistance: Distance d'extrusion par rapport à la direction du vecteur
frontSpans: Nombre de périodes selon la direction du vecteur. Aucune extrusion par direction de vecteur ne sera effectuée si 0 est transmis
backSpans: Nombre de travées par rapport à la direction du vecteur. Aucune extrusion par rapport à la direction du vecteur ne sera effectuée si 0 est transmis
profileSpans: Nombre de travées dans la direction du profil. Automatiquement défini si 0 ou moins
uniform: Utiliser une stratégie uniforme ou de courbure pour la répartition des travées le long de la direction de profil
inSmoothMode: Afficher la surface de la T-spline dans une boîte ou une visualisation uniforme
tspline,extrude,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Créer un corps T-Spline par balayage d'une Curve de profil de coupe le long d'une trajectoire.
profile: Courbe de profil
path: La courbe de la trajectoire
parallel: Est travées doivent être parallèles dans le chemin Directio
pathSpans: Nombre de travées dans le chemin
profileSpans: Nombre de travées dans le profil. Automatiquement définie si 0 ou moins
pathUniform: Utiliser une valeur uniforme ou courbure stratégie de travées de distribution le long de la trajectoire
profileUniform: Utiliser une valeur uniforme ou courbure stratégie de travées de distribution le long de la ligne de profil en long
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Créer une surface de T-Spline par balayage de la Curve du profil autour de l'axe formé
par l'origine et la direction de l'axe, en commençant par l'angle initial dans degrés,
et de balayage par sweep_angle en degrés.
profile: Courbe de profil
axisOrigin: Centre de rotation
axisDirection: Axe de rotation
startAngle: Angle de rotation de départ à partir de
sweepAngle: Angle pour terminer la rotation à
radialSpans: Nombre de travées dans un rayon
axialSpans: Nombre de travées dans la hauteur. Automatiquement définie si 0 ou moins
uniform: Utiliser une valeur uniforme ou pour les travées de la répartition de la stratégie de courbure
symmetry: Options de symétrie de la surface de T-spline
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Créer une surface de tuyaux d'un réseau de courbes ou de lignes.
Une jonction est créée à chaque intersection de courbes.
Certains paramètres de prendre une seule valeur ou liste - deux valies par courbe.
curves: Une liste de courbes pour créer des canalisations à partir de
defaultRadius: Rayon par défaut de la création des canalisations
snappingTolerance: Tolérance utilisée pour détecter les intersections de courbes
segmentsCount: Nombre de segments de chaque canalisation. Valeur unique ou liste, deux fois plus de temps que les courbes, sont autorisés
endRotations: Valeurs des rotations de fin de chaque canalisation (en degrés). Valeur unique ou liste, deux fois plus de temps que les courbes, sont autorisés
endRadii: Les valeurs des rayons de fin de chaque canalisation. Valeur unique ou liste, deux fois plus de temps que les courbes, sont autorisés
endPercentage: Valeurs (0 à 1) à la fin de chaque courbe d'entrée au début de la canalisation. Valeur unique ou liste, deux fois plus de temps que les courbes, sont autorisés
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Créez une surface de tuyaux hors d'un réseau de courbes ou de lignes.
Une jonction lisse est créée à chaque intersection de courbes.
Certains paramètres utilisent une seule valeur ou liste - une valeur par courbe.
curves: Liste de courbes à partir desquelles créer des canalisations
defaultRadius: Rayon par défaut des canalisations créées
snappingTolerance: Tolérance utilisée pour détecter les intersections de courbes
segmentsCount: Nombre de segments pour chaque courbe. La taille de la liste peut correspondre au nombre de courbes ou être égal à 1 pour la réplication ou à 0 pour la détermination automatique.
autoHandleStart: Si la valeur est True, les paramètres de la poignée située au début de chaque courbe sont générés automatiquement, et les paramètres personnalisés rotationsAtStart, radiiAtStart et positionsAtStart sont ignorés.
autoHandleEnd: Si la valeur est True, les paramètres de la poignée située à la fin de chaque courbe sont générés automatiquement, et les paramètres personnalisés rotationsAtEnd, radiiAtEnd et positionsAtEnd sont ignorés.
startRotations: Angle de rotation personnalisé en degrés pour chaque poignée de canalisation au début de chaque courbe. Ce paramètre est ignoré lorsque autoHandleStart est défini sur True. La taille de la liste peut correspondre au nombre de courbes ou être égal à 1 pour la réplication.
endRotations: Angle de rotation personnalisé en degrés pour chaque poignée de canalisation à la fin de chaque courbe. Ce paramètre est ignoré lorsque autoHandleEnd est défini sur True. La taille de la liste peut correspondre au nombre de courbes ou être égal à 1 pour la réplication.
startRadii: Rayon personnalisé pour chaque poignée de canalisation au début de chaque courbe. Ce paramètre est ignoré lorsque autoHandleStart est défini sur True. La taille de la liste peut correspondre au nombre de courbes ou être égal à 1 pour la réplication.
endRadii: Rayon personnalisé pour chaque poignée de canalisation à la fin de chaque courbe. Ce paramètre est ignoré lorsque autoHandleEnd est défini sur True. La taille de la liste peut correspondre au nombre de courbes ou être égal à 1 pour la réplication.
startPositions: Position personnalisée de chaque poignée de canalisation au début de chaque courbe, en pourcentage, entre 0 et 1 sur la longueur d'arc de la courbe. Ce paramètre est ignoré lorsque l'élément autoHandleStart est défini sur True. La taille de la liste peut correspondre au nombre de courbes ou être égal à 1 pour la réplication. Les positions de début et de fin ne doivent pas se chevaucher sur chaque courbe. Idéalement, la position de début doit être proche de 0 et la position de fin doit être proche de 1.
endPositions: Position personnalisée de chaque poignée de canalisation à la fin de chaque courbe, en pourcentage, entre 0 et 1 sur la longueur d'arc de la courbe. Ce paramètre est ignoré lorsque l'élément autoHandleEnd est défini sur True. La taille de la liste peut correspondre au nombre de courbes ou être égal à 1 pour la réplication. Les positions de début et de fin ne doivent pas se chevaucher sur chaque courbe. Idéalement, la position de début doit être proche de 0 et la position de fin doit être proche de 1.
inSmoothMode: Afficher la surface de la T-spline dans une boîte ou une visualisation uniforme
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
Combiner selon les surfaces T-Spline en un seul.
surface peut ne pas être reliées les unes aux autres.
Si au moins une surface est en mode Boîte - surface de sortie seront dans le mode boîte.
tSplineSurfaces: Les surfaces T-Spline pour combiner
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
Si dans la boîte T-Spline ou mode lissage
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
Si T-Spline est ouvert.
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Convertir surface TSpline pour un solide ou une surface en fonction de la forme
matchTopology: Détermine doit généré a la même topologie que de corps TSpline a
Returns: Entité de topologie (solide ou surface)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
Convertir T-Spline de surface au maillage. Le maillage peut contenir des triangles et des quadrilatères.
minSegments: Le nombre minimal de segments dans chaque direction. Au moins un segment sera toujours généré.
tolerance: Distance maximale autorisée entre le maillage de la surface. Pour une valeur égale à zéro ou négative. Valeur désactiver son utilisation
Returns: Entité de maillage
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
Soudure liste donnée de sommets en un seul sommet.
vertices: Sommets à souder
newPosition: Position de la poignée de sommet. La moyenne de la position des poignées est utilisée si une valeur nulle est transmise.
keepSubdCreases: Conserver la subd-creases de la topologie d'entrée
Returns: La surface TSpline avec les sommets soudés
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Boolean)
Souder les sommets du premier et deuxième groupes pairwise.
Le premier groupe est considéré comme sommets de la T-Spline.
deuxième groupe de sommets peut être de cette surface ou dans les autres.
Dans le cas des différents T-Splines Combiner est effectuée avant l'opération de soudure
firstGroup: Le premier groupe de sommets à souder
secondGroup: Deuxième groupe de vecrtices à souder
keepSubdCreases: Conserver la subd-creases de la topologie d'entrée
Returns: La surface TSpline avec les sommets soudés
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Annulez la soudure de toutes les arêtes, cela annulera la soudure de chaque sommet sur toutes les arêtes.
edges: Un jeu d'arêtes pour lesquelles annuler la soudure
Returns: Surface TSpline avec des arêtes non soudées
tspline,unweld,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Annulez la soudure de tous les sommets indiqués. Les soudures de toutes les arêtes de chaque sommet seront annulées.
vertices: Un jeu de sommets pour lesquels annuler la soudure
Returns: Surface TSpline avec des sommets non soudés
tspline,unweld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Créer avec T-Spline et boucle fermée de courbes
tsEdges: Arête T-Spline boucle fermée pour créer une correspondance avec
curves: Pour créer une boucle fermée avec
continuity: Géométrie continuité tente de faire correspondre: G0, G1 et G2
useArclength: Si Utiliser Longueur axe lors de la construction de correspondance
useRefinement: Si True, les points de contrôle supplémentaires seront ajoutées à la T-Spline afin de faire correspondre les surfaces dans un Tole ­ rance.
numRefinementSteps: Nombre maximum de pas d'affinement. Ignorée si useRefinement est définie sur Faux
refinementTolerance: Tolérance de sélection. Ignorée si useRefinement est définie sur Faux
usePropagation: Si vous souhaitez utiliser la propagation lors de la construction de correspondance
widthOfPropagation: Permet de déterminer dans quelle proportion la surface est concernée par la correspondance. Ignorée si usePropagation est définie sur Faux
tangentScale: Echelle tangente. Si la continuité n'est pas définie sur G1 est ignoré
curvParamWeight: Carvature Param Poids. Si la continuité n'est pas définie sur G2 est ignoré
flipSourceTargetAlignment: Si vous souhaitez inverser le sens de l'axe
Returns: Surface de T-spline donné de T-Spline positionnés entre les arêtes de bordure et Boucle de courbe
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Créer une correspondance avec la T-Spline et la boucle fermée de courbes
tsEdges: Boucle d'arête de T-Spline avec laquelle créer une correspondance
curves: Boucle d'arête fermée avec laquelle créer une correspondance
continuity: Continuité de géométrie avec laquelle essayer d'établir une correspondance: G0, G1 et G2
useArclength: Indique si l'alignement avec la valeur arcLength doit être utilisé lors de l'établissement de la correspondance
useRefinement: Si la valeur est True, des points de contrôle supplémentaires seront ajoutés à la T-Spline afin d'établir une correspondance avec les surfaces selon une certaine tolérance.
numRefinementSteps: Nombre maximal d'étapes d'affinement. Paramètre ignoré si useRefinement est défini sur False.
refinementTolerance: Tolérance à atteindre. Paramètre ignoré si useRefinement est défini sur False.
usePropagation: Indique si la propagation doit être utilisée lors de l'établissement de correspondance
widthOfPropagation: Permet de déterminer dans quelle proportion la surface est concernée par la correspondance. Paramètre ignoré si usePropagation est défini sur False.
scale: Echelle tangente pour G1 ou échelle de courbure pour G2. Paramètre ignoré si la continuité est G0.
flipSourceTargetAlignment: Indique si le sens de l'axe doit être inversé
Returns: Surface de T-Spline située entre les arêtes de bordure de la T-Spline et la boucle de la courbe
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Créer avec T-Spline et de représentation des limites de la boucle fermée d'arêtes. First,
Arête Boucle est convertie en boucle de courbe et correspondance est effectuée
tsEdges: Arête T-Spline boucle fermée pour créer une correspondance avec
brepEdges: Arête BRep en boucle fermée pour créer une correspondance avec
continuity: Géométrie continuité tente de faire correspondre: G0, G1 et G2
useArclength: Si Utiliser Longueur axe lors de la construction de correspondance
useRefinement: Si True, les points de contrôle supplémentaires seront ajoutées à la T-Spline afin de faire correspondre les surfaces dans un Tole ­ rance.
numRefinementSteps: Nombre maximum de pas d'affinement. Ignorée si useRefinement est définie sur Faux
refinementTolerance: Tolérance de sélection. Ignorée si useRefinement est définie sur Faux
usePropagation: Si vous souhaitez utiliser la propagation lors de la construction de correspondance
widthOfPropagation: Permet de déterminer dans quelle proportion la surface est concernée par la correspondance. Ignorée si usePropagation est définie sur Faux
tangentScale: Echelle tangente. Si la continuité n'est pas définie sur G1 est ignoré
curvParamWeight: Carvature Param Poids. Si la continuité n'est pas définie sur G2 est ignoré
flipSourceTargetAlignment: Si vous souhaitez inverser le sens de l'axe
Returns: Surface de T-spline donné de T-Spline positionnés entre les arêtes de bordure et boucle arête BRep
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
Changer de style de visualisation de T-Spline.
Lisser la visualisation Si True transmise, sinon.
enable: Activer ou désactiver le lissage de visualisation
Returns: T-Spline avec style de visualisation choisie
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Création d'un pont entre deux jeux de faces. Les éléments du premier groupe
sont considérés comme des enfants de cette surface. Les éléments de la deuxième
groupe peuvent être soit des enfants de cette surface ou appartiennent à
Une surface différente. Topologie au sein de chaque groupe peut ne pas être adjacent,
mais doit créer le même nombre de boucles distinctes.
firstGroup: Le premier groupe de faces de pont
secondGroup: Deuxième groupe de faces de pont
followCurves: Relier des courbes pour chaque topologie
Boucle (lignes droites sont utilisées si liste vide est transmise, si une courbe
réussite est répliqué si plusieurs entrées boucle est détecté)
frameRotations: Nombre total des rotations autour
la normale des cadres le long de la courbe pour chaque transition
Boucle de topologie (0 est utilisée si liste vide est transmise, si une valeur
réussite est répliqué si plusieurs entrées boucle est détecté)
spansCounts: Le nombre de segments le long du pont pour le système d'exploitation
Chaque boucle de topologie. Nombre de travées pour chaque groupe doit être
supérieur à nombre correspondant de rotations (1 est utilisé si vide
La liste est transmise, si la valeur transmise est répliquée si plus de
Une boucle d'entrée est détecté)
cleanBorderBridges: Supprimer les ponts entre les arêtes de bordure.
keepSubdCreases: Conserver la subd-creases du
Topologie d'entrée
firstAlignVertices: Liste de sommets pour orienter
chaque topologie boucle à partir du premier groupe (le nombre de sommets doivent
La saisie de détection de boucles ou de liste peut être vide)
secondAlignVertices: Liste de sommets pour orienter
chaque topologie boucle dans le second groupe (le nombre de sommets doivent
La saisie de détection de boucles ou de liste peut être vide)
flipAlignmentFlags: Liste des drapeaux indiquant si
Pour inverser l'axe du pont pour topologie correspondant de la boucle.
(False est définie si liste vide est transmise, si la valeur transmise est répliqué
Pour chaque boucle d'entrée détecté)
Returns: La surface TSpline avec une topologie, relié par un pont
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Créer un pont entre des faces et des arêtes. Les articles de la
Le premier groupe sont considérés comme des enfants de cette surface. Les éléments de
Le second groupe peuvent être des enfants de cette surface ou appartiennent
Pour une surface différente. Topologie au sein de chaque groupe peut ne pas être
adjacentes, mais doit créer le même nombre de boucles distinctes.
firstGroup: Le premier groupe de faces de pont
secondGroup: Deuxième groupe d'arêtes pont
followCurves: Relier des courbes pour chaque topologie
Boucle (lignes droites sont utilisées si liste vide est transmise, si une courbe
réussite est répliqué si plusieurs entrées boucle est détecté)
frameRotations: Nombre total des rotations autour
la normale des cadres le long de la courbe pour chaque transition
Boucle de topologie (0 est utilisée si liste vide est transmise, si une valeur
réussite est répliqué si plusieurs entrées boucle est détecté)
spansCounts: Le nombre de segments le long du pont pour le système d'exploitation
Chaque boucle de topologie. Nombre de travées pour chaque groupe doit être
supérieur à nombre correspondant de rotations (1 est utilisé si vide
La liste est transmise, si la valeur transmise est répliquée si plus de
Une boucle d'entrée est détecté)
cleanBorderBridges: Supprimer les ponts entre les arêtes de bordure.
keepSubdCreases: Conserver la subd-creases du
Topologie d'entrée
firstAlignVertices: Liste de sommets pour orienter
chaque topologie boucle à partir du premier groupe (le nombre de sommets doivent
La saisie de détection de boucles ou de liste peut être vide)
secondAlignVertices: Liste de sommets pour orienter
chaque topologie boucle dans le second groupe (le nombre de sommets doivent
La saisie de détection de boucles ou de liste peut être vide)
flipAlignmentFlags: Liste des drapeaux indiquant si
Pour inverser l'axe du pont pour topologie correspondant de la boucle.
(False est définie si liste vide est transmise, si la valeur transmise est répliqué
Pour chaque boucle d'entrée détecté)
Returns: La surface TSpline avec une topologie, relié par un pont
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Création de pont entre le jeu d'arêtes et de faces. Les articles de la
Le premier groupe sont considérés comme des enfants de cette surface. Les éléments de
Le second groupe peuvent être des enfants de cette surface ou appartiennent
Pour une surface différente. Topologie au sein de chaque groupe peut ne pas être
adjacentes, mais doit créer le même nombre de boucles distinctes.
firstGroup: Le premier groupe d'arêtes pont
secondGroup: Deuxième groupe de faces de pont
followCurves: Relier des courbes pour chaque topologie
Boucle (lignes droites sont utilisées si liste vide est transmise, si une courbe
réussite est répliqué si plusieurs entrées boucle est détecté)
frameRotations: Nombre total des rotations autour
la normale des cadres le long de la courbe pour chaque transition
Boucle de topologie (0 est utilisée si liste vide est transmise, si une valeur
réussite est répliqué si plusieurs entrées boucle est détecté)
spansCounts: Le nombre de segments le long du pont pour le système d'exploitation
Chaque boucle de topologie. Nombre de travées pour chaque groupe doit être
supérieur à nombre correspondant de rotations (1 est utilisé si vide
La liste est transmise, si la valeur transmise est répliquée si plus de
Une boucle d'entrée est détecté)
cleanBorderBridges: Supprimer les ponts entre les arêtes de bordure.
keepSubdCreases: Conserver la subd-creases du
Topologie d'entrée
firstAlignVertices: Liste de sommets pour orienter
chaque topologie boucle à partir du premier groupe (le nombre de sommets doivent
La saisie de détection de boucles ou de liste peut être vide)
secondAlignVertices: Liste de sommets pour orienter
chaque topologie boucle dans le second groupe (le nombre de sommets doivent
La saisie de détection de boucles ou de liste peut être vide)
flipAlignmentFlags: Liste des drapeaux indiquant si
Pour inverser l'axe du pont pour topologie correspondant de la boucle.
(False est définie si liste vide est transmise, si la valeur transmise est répliqué
Pour chaque boucle d'entrée détecté)
Returns: La surface TSpline avec une topologie, relié par un pont
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Création d'un pont entre deux jeux d'arêtes. Les articles de la
Le premier groupe sont considérés comme des enfants de cette surface. Les éléments de
Le second groupe peut être enfants de cette surface ou appartiennent
Pour une surface différente. Topologie au sein de chaque groupe peut ne pas être
adjacent mais doit créer le même nombre de boucles distinctes.
firstGroup: Le premier groupe d'arêtes pont
secondGroup: Deuxième groupe d'arêtes pont
followCurves: Relier des courbes pour chaque topologie
Boucle (lignes droites sont utilisées si liste vide est transmise, si une courbe
réussite est répliqué si plusieurs entrées boucle est détecté)
frameRotations: Nombre total des rotations autour
la normale des cadres le long de la courbe pour chaque transition
Boucle de topologie (0 est utilisée si liste vide est transmise, si une valeur
réussite est répliqué si plusieurs entrées boucle est détecté)
spansCounts: Le nombre de segments le long du pont pour le système d'exploitation
Chaque boucle de topologie. Nombre de travées pour chaque groupe doit être
supérieur à nombre correspondant de rotations (1 est utilisé si vide
La liste est transmise, si la valeur transmise est répliquée si plus de
Une boucle d'entrée est détecté)
cleanBorderBridges: Supprimer les ponts entre les arêtes de bordure.
keepSubdCreases: Conserver la subd-creases du
Topologie d'entrée
firstAlignVertices: Liste de sommets pour orienter
chaque topologie boucle à partir du premier groupe (le nombre de sommets doivent
La saisie de détection de boucles ou de liste peut être vide)
secondAlignVertices: Liste de sommets pour orienter
chaque topologie boucle dans le second groupe (le nombre de sommets doivent
La saisie de détection de boucles ou de liste peut être vide)
flipAlignmentFlags: Liste des drapeaux indiquant si
Pour inverser l'axe du pont pour topologie correspondant de la boucle.
(False est définie si liste vide est transmise, si la valeur transmise est répliqué
Pour chaque boucle d'entrée détecté)
Returns: La surface TSpline avec une topologie, relié par un pont
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
Remplir les trous dans une T-Spline
edges: Jeu d'arêtes avec perçage intérieur. Arêtes doivent être bordure.
fillMethod: Méthode utilisée pour le remplissage de perçage: 0 - maillage par approximation, 1 - polygones, 2 - Réduire, 3 - Réduire et Soudure
keepSubdCreases: Conserver la subd-creases de la topologie d'entrée
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
Compresser tous la topologie dans la surface et rendre les index contiguës. Cette fonction maintient la relative de l'index.
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
Avant l'interpolation déplace les points de contrôle à leur emplacement paramétrique sur la surface. Inverser l'interpolation génère un point sur la surface pour chaque point de contrôle d'origine et déplace le point de contrôle à son point de surface.
reverse: Direction d'interpolation: avant Si faux, inverser sinon
Returns: Interpolé T-Spline dans la direction donnée
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Aplanir les points de contrôle des sommets à un seul plan de coupe.
Cette commande requiert une entrée d'au moins quatre sommets
vertices: Liste de sommets
Returns: Surface de T-spline avec les sommets aplanie
tspline,flatten,vertices

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Plane)
Aplanir les points de contrôle des sommets à un seul plan
qui sera parallèle à ce plan.
Cette commande requiert une entrée d'au moins quatre sommets
vertices: Liste de sommets
parallelPlane: Pour ajuster les sommets parallèle au plan
Returns: Surface de T-spline avec les sommets aplanie
tspline,flatten,vertices,fitparallel

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Copiez les faces sélectionnées vers la nouvelle surface. Nouvelle surface n'a pas de symétrie
faces: Les faces à dupliquer
Returns: Surface de T-spline avec option Faces uniquement
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Déplacer sommets le long d'un vecteur donné.
vertices: Liste de sommets à déplacer
vector: Direction pour vous déplacer le long de
onSurface: Drapeau indiquant si la surface ou les points de contrôle des sommets

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSS(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface},System.String)
Exporter jeu donné de surfaces T-Spline pour le fichier de la scène
tSplineSurfaces: Jeu de surfaces T-Spline à exporter
filePath: Chemin d'accès au fichier à enregistrer
Returns: Le chemin d'accès du fichier dans lequel le jeu est enregistré
tspline,export,save,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface,System.String)
Exportation de la surface de T-spline donné au fichier de maillage T-Spline
tSplineSurface: Surface de T-spline à exporter
filePath: Chemin d'accès au fichier à enregistrer
Returns: Chemin de fichier à l'endroit où la surface T-spline est enregistré
tspline,export,save,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
Ecrire la surface T-Spline dans une chaîne au format de maillage T-Spline.
tSplineSurface: Surface de T-Spline à sérialiser
Returns: Chaîne dans laquelle la surface de T-Spline est sérialisée
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
Créez une surface T-Spline à partir de la chaîne au format de maillage T-Spline.
content: Représentation sous forme de chaîne du fichier de maillage T-Spline
inSmoothMode: Afficher la surface de la T-Spline dans la boîte ou Lissage de visualisation
Returns: La surface T-Spline récemment chargée dans la liste
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
Charger une surface de T-spline à partir du fichier de maillage T-Spline
filePath: Chemin d'accès au fichier à charger depuis
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: La surface T-Spline récemment chargés dans la liste
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.IO.FileInfo,System.Boolean)
Charger une surface de T-spline à partir du fichier de maillage T-Spline
file: Chargement à partir du fichier
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: La surface T-Spline récemment chargés dans la liste
tspline,import,load,tsm,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
Charge un jeu de surfaces T-Spline à partir du fichier de scène T-Spline
filePath: Chemin d'accès au fichier à charger depuis
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Un ensemble de surfaces T-Spline nouvellement chargé
tspline,import,load,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.IO.FileInfo,System.Boolean)
Charge un jeu de surfaces T-Spline à partir du fichier de scène T-Spline
file: Chargement à partir du fichier
inSmoothMode: Afficher la surface de la T-spline dans la boîte ou Lissage de visualisation
Returns: Un ensemble de surfaces T-Spline nouvellement chargé
tspline,import,load,tss,file