Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
Mécanisme d'enregistrement de type de géométrie.
hostType: Type des interfaces dérivées IGeometryEntity.
contructor: Un représentant pour construire une Geometry.

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
Transformer la géométrie dans la direction donnée selon la longueur du vecteur
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Transforme tout type de géométrie selon la distance donnée dans la
direction donnée.
direction: Direction du déplacement.
distance: Distance de déplacement le long d'une direction donnée.
Returns: Géométrie transformée.
move,along vector,distance

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforme la géométrie selon la transformation appliquée au système de coordonnées indiqué
Returns: Géométrie transformée

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Fait passer cette géométrie d'un CoordinateSystem source à un nouveau
CoordinateSystem de contexte.
Returns: Géométrie transformée.
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Fait pivoter un objet autour d'une origine et d'un axe en fonction d'un
degré spécifié
around,axis,degrees

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Fait pivoter l'objet autour de l'origine et de la normale du plan en fonction d'un
degré spécifié
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
Mettre à l'échelle de façon non uniforme autour de l'origine
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Mettre à l'échelle de façon non uniforme autour d'un plan donné
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Mettre à l'échelle dans une dimension en fonction d'une base et de 2 points de sélection. L'axe de mise à l'échelle est déterminé par la ligne située entre la base et le point de départ.
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Mettre à l'échelle dans 2 dimensions en fonction d'une base et de 2 points de sélection. Les deux points de sélection sont projetés sur le plan de base pour définir les facteurs d'échelle 2D
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
Obtenir la distance entre cette Geometry et une autre
other: L'autre Geometry
Returns: Distance
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
Obtenir le point le plus proche sur cette Geometry par rapport à l'autre
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
Déterminer si un autre objet de Geometry entrecoupe cet objet
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
Obtenir la Geometry d'intersection pour cet objet et un autre
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Obtenir l'intersection de Geometry pour cet objet et un ensemble d'autres Geometries. Trouve la géométrie commune de tous les participants.
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
Scinder cette Geometry en utilisant une autre Geometry comme "outil" de coupe
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
Vérifier si les deux objets possèdent la même géométrie représentative ou les mêmes valeurs numériques
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
Obtenir la BoundingBox contenant l'élément de Geometry spécifié
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
Convertir la géométrie en JSON Solid Def
Returns: Chaîne JSON formatée

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
Importe un fichier SAT et renvoie un réseau des géométries importées
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
Importe un fichier SAT et renvoie un réseau des géométries importées
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.FromSolidDef(System.String)
Importe une chaîne JSON et renvoie un tableau de géométries importées
solidDefJson: Chaîne JSON contenant une géométrie formatée en solid def
Returns: Liste des géométries converties

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
Exporte la géométrie spécifiée vers le chemin de fichier SAT indiqué
filePath: Nom du fichier vers lequel exporter la géométrie

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
Exporte la géométrie spécifiée vers le chemin de fichier SAT indiqué
filePath: Nom du fichier vers lequel exporter la géométrie
unitsMM: Les unités à utiliser

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String,System.Double)
Exporte une liste de géométries spécifiées vers le chemin de fichier SAT indiqué

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
Sérialise la géométrie spécifiée au format SAB (Standard ACIS Binary) et renvoie des données de flux binaires sérialisées

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Sérialise une liste de géométries spécifiées au format SAB (Standard ACIS Binary) et renvoie des données de flux binaires sérialisées
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
Obtenir le système de coordonnées de contexte/référence utilisé pour créer cette géométrie.