Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
Obtenir une représentation du CoordinateSystem sous forme de chaîne

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
Créer un CoordinateSystem avec une origine au point d'entrée, avec les axes X et Y
définis en tant qu'axes X et Y SCG.
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByPlane(Autodesk.DesignScript.Geometry.Plane)
Créer un CoordinateSystem avec une origine égale à l'origine du plan d'entrée et
les axes X et Y situés dans le plan, alignés avec les axes X et Y du plan.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Créer un CoordinateSystem au niveau de l'origine défini par les axes X et Y.
Les vecteurs d'entrée sont normalisés avant la création du CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Créer un CoordinateSystem au niveau de l'origine défini par les axes X et Y, l'axe
Z étant complètement ignoré. Les vecteurs d'entrée sont normalisés avant la création
du CoordinateSystem.
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Crée un CoordinateSystem en fonction des paramètres de coordonnées cylindriques spécifiés par rapport au système de coordonnées spécifié

Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Crée un CoordinateSystem en fonction des paramètres de coordonnées sphériques spécifiés par rapport au système de coordonnées spécifié

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
Déterminer s'il est possible d'obtenir l'inverse de ce CoordinateSystem
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
Permet de tester si la mise à l'échelle est orthogonale, c'est-à-dire si elle comporte un composant de cisaillement.
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
Permet de tester si la mise à l'échelle est orthogonale et si tous les vecteurs sont normalisés.
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
Crée un point représentant l'origine du CoordinateSystem.
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
Renvoie l'axe X du CoordinateSystem.
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
Renvoie l'axe Y du CoordinateSystem.
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
Renvoie l'axe Z du CoordinateSystem.
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
Renvoie la mise à l'échelle de l'axe X du CoordinateSystem: la longueur du vecteur de l'axe X.

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
Renvoie la mise à l'échelle de l'axe Y du CoordinateSystem: la longueur du vecteur de l'axe Y.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
Renvoie la mise à l'échelle de l'axe Z du CoordinateSystem: la longueur du vecteur de l'axe Z.

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
Obtenir l'inverse de ce CoordinateSystem - l'application de ce système de coordonnées à un élément de Geometry inverse le système d'origine.

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Appliquer l'argument CoordinateSystem après celui-ci. Résultat = celui-ci * autre

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Appliquer l'argument CoordinateSystem avant celui-ci. Résultat = autre * celui-ci

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
Renvoie un vecteur contenant les facteurs d'échelle X, Y et Z
Returns: Vecteur mis à l'échelle
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
Déterminer si deux CoordinateSystems sont égaux
other: autre système de coordonnées
Returns: renvoie True si les systèmes de coordonnées sont égaux

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
Convertit tout CoordinateSystem indiqué en fonction des déplacements dans les directions X, Y
et Z définies dans le SCG respectivement.
xTranslation: Déplacement le long de l'axe X.
yTranslation: Déplacement le long de l'axe Y.
zTranslation: Déplacement le long de l'axe Z.
Returns: CoordinateSystem transformé.
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
Convertir l'objet dans la direction et la magnitude du vecteur d'entrée.
direction: Vecteur pour la direction de conversion
Returns: Système de coordonnées converti
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Convertit tout type de CoordinateSystem en fonction de la distance indiquée dans la
direction donnée.
direction: Vecteur de direction du déplacement
distance: Distance de déplacement le long de la direction donnée
Returns: Système de coordonnées converti
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforme ce CoordinateSystem d'un CoordinateSystem source en nouveau
CoordinateSystem de contexte.
Returns: CoordinateSystem transformé.

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Fait pivoter un objet autour d'une origine et d'un axe en fonction d'un degré spécifié
origin: Point d'origine
axis: Axe de vecteur pour la rotation
degrees: Degrés de pivotement
Returns: Système de coordonnées pivoté
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Fait pivoter un objet autour de l'origine et de la normale du plan donné d'un
degré spécifié
plane: Plan à partir duquel obtenir la normale
degrees: Valeur de rotation en degrés
Returns: Système de coordonnées pivoté
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
Mettre à l'échelle uniformément autour de l'origine
amount: Valeur de mise à l'échelle
Returns: Système de coordonnées mis à l'échelle
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
Mettre à l'échelle de façon non uniforme autour de l'origine
xamount: Valeur de mise à l'échelle sur l'axe X
yamount: Valeur de mise à l'échelle sur l'axe Y
zamount: Valeur de mise à l'échelle sur l'axe Z
Returns: Système de coordonnées mis à l'échelle
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Mettre à l'échelle de façon non uniforme autour d'un plan donné
plane: Plan autour duquel effectuer la mise à l'échelle
xamount: Valeur de mise à l'échelle sur l'axe X
yamount: Valeur de mise à l'échelle sur l'axe Y
zamount: Valeur de mise à l'échelle sur l'axe Z
Returns: Système de coordonnées mis à l'échelle
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Mettre à l'échelle uniformément autour d'un point donné à l'aide de
basePoint: Point de base de mise à l'échelle
from: Point à partir duquel effectuer la mise à l'échelle
to: Point vers lequel effectuer la mise à l'échelle
Returns: Système de coordonnées mis à l'échelle
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Mettez à l'échelle dans une cote en fonction d'un point de base, d'un point de départ (depuis) et d'un point de fin (vers). L'axe de mise à l'échelle est déterminé par la ligne située entre le point de base et le point de départ.
basePoint: Point de base de mise à l'échelle
from: Point à partir duquel effectuer la mise à l'échelle
to: Point vers lequel effectuer la mise à l'échelle
Returns: Système de coordonnées mis à l'échelle
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Mettre à l'échelle dans 2 dimensions en fonction d'une base et de 2 points de sélection. Les deux points de sélection sont projetés sur le plan de base pour définir les facteurs d'échelle 2D
basePlane: Point de base de mise à l'échelle
from: Point à partir duquel effectuer la mise à l'échelle
to: Point vers lequel effectuer la mise à l'échelle
Returns: Système de coordonnées mis à l'échelle
resize,size,from,to,scale2d,2d