Autodesk.DesignScript.Geometry.Cylinder.ToString
Obtenir une représentation du Cylinder sous forme de chaîne

Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Créer un Cylinder solide défini par un CoordinateSystem parent, le rayon et la hauteur du cylindre
coordinateSystem: Système de coordonnées parent
radius: Radius size
height: Cylinder height
Returns: Cylinder created from radius and height
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Créer un Cylinder solide en fonction des points centraux inférieur et supérieur du Cylinder.
startPoint: Start point of cylinder
endPoint: End point of cylinder
radius: Radius  of cylinder
Returns: Cylinder created by points and radius
cylinder,tube,by center points