Autodesk.DesignScript.Geometry.PolyCurve.ToString
Obtenir une représentation de la PolyCurve sous forme de chaîne

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Créer une PolyCurve en joignant les courbes. Inverse la courbe selon les besoins pour la connectivité. Choisissez une tolérance de jonction entre 1e-6 et 1e-3.
curves: Courbes à joindre pour former la polycurve
joinTolerance: Tolérance pour déterminer la taille de l'écart autorisé entre les courbes à joindre
Returns: Polycourbe créée par des courbes jointes
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Créer une PolyCurve en reliant des points. Définir l'entrée 'connectLastToFirst' sur vrai pour fermer la PolyCurve.
points: Points de création de polycourbe
connectLastToFirst: True pour connecter le dernier point au premier point, False pour laisser ouvert
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.Curves
Renvoie les courbes de la polycourbe
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
Renvoie la courbe de la polycourbe par index
index: Longueur pour localiser un point
endOrStart: True pour compter à partir de la fin de la polycourbe, False pour compter à partir du début de la polycourbe
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
Prolonge la polycourbe avec un arc tangent
length: Longueur de l'arc d'extension
radius: Rayon de l'arc
endOrStart: extension de la fin ou du début de la polycourbe

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
Décaler la polycourbe dans son plan.
signedDistance: Valeur de décalage
extendCircular: Activer/Désactiver pour rendre les coins circulaires
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Raccorder la polycourbe dans son plan.
radius: Rayon du congé
rightSide: True pour définir un congé sur le côté droit par rapport au début de la polycourbe, False pour définir un congé sur le côté gauche
Returns: Filleted polyCurve
round,smooth,radius