Autodesk.DesignScript.Geometry.BoundingBox.ToString
Obtenir une représentation de la BoundingBox sous forme de chaîne

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Comparer deux BoundingBox
other: L'autre BoundingBox
Returns: Si les deux objets sont égaux

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
Obtenir un code de hachage pour ce type
Returns: Un code de hachage unique pour cet objet

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
Créer une BoundingBox alignée sur l'axe autour de la Geometry d'entrée.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Créer une BoundingBox alignée sur l'axe autour des géométries d'entrée.
geom: Geometries to determine bounding box
Returns: Bounding box enclosing geometries
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
Créer une BoundingBox non alignée sur l'axe autour de la Geometry d'entrée, orientée dans les axes X, Y et Z du CoordinateSystem.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
Créer une BoundingBox non alignée sur l'axe autour des géométries d'entrée, orientée dans les axes X, Y et Z du CoordinateSystem.
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
Crée une BoundingBox à partir des coordonnées minimum (coin arrière gauche inférieur de la zone), jusqu'aux coordonnées maximum (coin avant supérieur droit de la zone). CoordinateSystem se transforme de l'espace de coordonnées de la zone à l'espace de modèle. Cette méthode est conçue pour correspondre à l'API de Revit, ce qui vous permet d'extraire les paramètres d'une BoundingBox Revit, sans aucune conversion.
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
CoordinateSystem dans lequel est définie cette BoundingBox

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Obtenir l'intersection de deux BoundingBoxes
other: Other bounding box to intersect
Returns: Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Déterminer si deux BoundingBoxes s'entrecoupent
other: Other bounding box
Returns: Do bounding boxes intersect
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
Déterminer si la BoundingBox est vide
Returns: Returns true if the bounding box is empty