Autodesk.DesignScript.Geometry.Curve.ToString
Obtenir une représentation de la Curve sous forme de chaîne

Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
Créer une courbe par ligne de surface dans l'espace UV
baseSurface: Surface à utiliser
startParams: UV de départ de la courbe
endParams: UV de fin de la courbe
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Créer une courbe qui fusionne entre deux courbes
curve1: Première courbe à fusionner
curve2: Deuxième courbe à fusionner
endOrStart1: indicateur de l'extrémité de la curve1 à fusionner
endOrStart2: indicateur de l'extrémité de la curve1 à fusionner
isG2Continuous: indicateur indiquant si la courbe obtenue est de type continuité G1 ou G2
Returns: Courbe résultant de la fusion de deux courbes
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
Créer une courbe par isoligne de surface
baseSurface: Surface de base
direction: si une isoligne 0 se trouve le long de la direction U, si 1 se trouve le long de la direction V.
parameter: fixe pour la valeur de la courbe d'un autre paramètre de surface
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
Obtenir un CoordinateSystem avec une origine au niveau du point selon le paramètre indiqué. L'axe X est aligné sur la normale de la courbe, l'axe Y est aligné sur la tangente de la courbe au niveau de ce point, et l'axe Z est aligné sur le vecteur vers le haut ou la binormale au niveau de ce point.
param: Le paramètre d'évaluation
Returns: Système de coordonnées au niveau du paramètre de la courbe
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
Renvoie un plan dont la normale est alignée sur la tangente de la Curve. Les paramètres sont ajustés de sorte que 0 est toujours le point de début et 1 est toujours le point de fin.
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtDistance(System.Double)
Obtenir un point au niveau d'une longueur d'arc spécifique le long de la courbe
segmentLength: Distance le long de la courbe sur laquelle effectuer l'évaluation
Returns: Le point sur la longueur d'arc donnée
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
Renvoie des points espacés régulièrement le long de la longueur de la courbe en fonction du nombre saisi de divisions
divisions: Nombre de divisions
Returns: Points espacés régulièrement le long de la longueur de la courbe

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
Renvoie des points espacés régulièrement le long de la courbe de même longueur de corde basée sur le nombre saisi de divisions
divisions: Nombre de divisions
Returns: Liste des points sur la courbe

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Renvoie des points espacés régulièrement le long de la courbe au niveau de la longueur d'un segment donné, en commençant à partir du point donné
point: Le point de référence à partir duquel mesurer
segmentLength: La distance le long de la courbe sur laquelle effectuer l'évaluation
Returns: Liste de points sur la courbe

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Renvoie des points espacés régulièrement sur la courbe à une longueur de corde spécifiée, en commençant à partir du point donné
point: Le point de référence à partir duquel mesurer
chordLength: Longueur de corde
Returns: Liste de points sur la courbe

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
Renvoie un CoordinateSystem à une distance spécifiée à partir du point de début de la Curve. L'axe Y est tangent à la Curve, l'axe X est la courbure.
segmentLength: La distance le long de la courbe sur laquelle effectuer l'évaluation
Returns: CoordinateSystem sur la courbe
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtDistance(System.Double)
Renvoie un CoordinateSystem à une distance spécifiée à partir du point de départ de la Curve. L'axe y est tangent à la Curve et l'axe X est la courbure.
segmentLength: Distance le long de la courbe sur laquelle effectuer l'évaluation
Returns: CoordinateSystem sur la courbe
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
Renvoie un plan à la distance spécifiée le long de la Curve à partir du point de début. La normale du plan s'aligne sur la tangente de la Curve.
segmentLength: La distance le long de la courbe sur laquelle effectuer l'évaluation
Returns: Plan sur la courbe
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PlaneAtDistance(System.Double)
Renvoie un plan à la distance spécifiée le long de la Curvecourbe, à partir du point de départ. La normale du plan s'aligne sur la tangente de la courbe.
segmentLength: Distance le long de la courbe sur laquelle effectuer l'évaluation
Returns: Plan sur la courbe
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
Obtenez la longueur de segment mesurée entre le point de départ de la courbe et le paramètre spécifié.
param: Valeur comprise entre 0 et 1
Returns: Longueur de segment
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtDistance(System.Double)
Obtenir le paramètre à une longueur d'arc spécifique le long de la courbe.
segmentLength: La distance le long de la courbe sur laquelle effectuer l'évaluation
Returns: Le paramètre
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.LengthBetweenParameters(System.Double,System.Double)
Obtenir la longueur d'arc entre deux points de paramètre sur la courbe
startParam: Le début du domaine
endParam: La fin du domaine
Returns: La longueur d'arc entre les deux paramètres
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Obtenez le paramètre à un point spécifique le long de la courbe. Si le point n'est pas sur la courbe, le paramètre le plus proche est obtenu. Si la courbe d'entrée est une polycourbe, cette fonction ne renvoie un paramètre valide que si le point se trouve sur la polycourbe. Pour les autres types de courbes, cette fonction renvoie le paramètre le long de la courbe qui se trouve au niveau du point le plus proche du point d'entrée.
point: Un point le long ou à proximité de la courbe
Returns: Paramètre sur la courbe pour les éléments PolyCurve ou paramètre le plus proche le long de la courbe pour les autres types de courbes.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.DivideEqually(System.Int32)
Divise la courbe en courbes de longueur égale en fonction du nombre spécifié
divisions: Nombre de divisions
Returns: Un réseau de Curves après division
chopcurve,segment,slices

Autodesk.DesignScript.Geometry.Curve.DivideByDistance(System.Int32)
Divise la courbe en un nombre donné de courbes avec des distances égales entre le début et la fin de chaque courbe (cordes égales).
divisions: Nombre de divisions
Returns: Un réseau de Curves après division
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByLengthFromParameter(System.Double,System.Double)
Divise la courbe en courbes d'une longueur donnée mesurée à partir de l'emplacement de paramètre spécifié
length: Longueur des courbes après division
parameter: Emplacement de paramètre pour mesurer à partir de
Returns: Réseau de Curves après division
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByDistanceFromParameter(System.Double,System.Double)
Divise la courbe en courbes de longueur de corde donnée mesurée à partir de l'emplacement de paramètre spécifié
distance: Longueur de corde de chaque courbe obtenue à partir de la scission
parameter: Emplacement de paramètre pour mesurer à partir de
Returns: Un réseau de Curves après division
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimStart(System.Double)
Supprime le début de la Curve selon le paramètre spécifié
startParameter: Le paramètre de départ de l'ajustement
Returns: Une nouvelle Curve dont le début est supprimé
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimEnd(System.Double)
Supprime la fin de la Curve selon le paramètre spécifié
endParameter: Le paramètre de départ de l'ajustement
Returns: Une nouvelle Curve dont la fin est supprimée
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrim(System.Double,System.Double)
Supprime le début et la fin de la Curve en fonction des paramètres spécifiés.
startParameter: Le paramètre de départ de l'ajustement
endParameter: Le paramètre de départ de l'ajustement
Returns: Une nouvelle Curve dont les segments extérieurs sont supprimés
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.ParameterTrimInterior(System.Double,System.Double)
Supprime la partie intérieure d'une Curve en fonction des paramètres spécifiés
startParameter: Le paramètre de départ de l'ajustement
endParameter: Le paramètre de départ de l'ajustement
Returns: Une nouvelle Curve dont le segment intérieur est supprimé
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimSegments(System.Double[])
Supprime plusieurs segments de la courbe, en éliminant le 1er, 3ème, 5ème... segment
parameters: Une liste de paramètres en fonction desquels scinder la courbe
Returns: Un réseau de courbes éliminant le 1er, 3ème, 5ème... segment
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
Supprime plusieurs segments de la courbe, en éliminant les 2e, 4e, 6e... segments si la valeur booléenne est True
parameters: Une liste de paramètres de scission de la courbe
discardEvenSegments: Activer/Désactiver pour supprimer les segments réguliers
Returns: Un réseau de courbes éliminant les 2e, 4e, 6e... segments si la valeur booléenne est True
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double)
Scinder une Curve en deux parties en fonction du paramètre indiqué
parameter: Le paramètre de scission
Returns: Deux Curves restantes après la scission
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double)
Scinder une Curve en deux parties en fonction du paramètre donné
parameter: Le paramètre en fonction duquel effectuer la scission
Returns: Deux Curves restantes après la scission
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double[])
Scinder une Curve en plusieurs parties en fonction des paramètres donnés
parameters: Une liste de paramètres en fonction desquels scinder la courbe
Returns: Courbes créées par la scission
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Joignez un ensemble de courbes à la fin de la polycourbe. Inverse les courbes pour garantir la connectivité.
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany

Autodesk.DesignScript.Geometry.Curve.Join(Autodesk.DesignScript.Geometry.Curve)
Joindre cette courbe et la courbe d'entrée dans une nouvelle PolyCurve, en conservant les courbes d'origine telles quelles.
curve: La courbe cible
Returns: Une PolyCurve constituée de deux courbes
convertcurve,curve2polycurve,joincurve,concat

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
Prolonger une Curve selon une distance donnée à une extrémité définie par un point de sélection. La partie sélectionnée sera étendue. Les courbes fermées telles que les Circles et les ellipses ne peuvent pas être prolongées.
distance: Distance de prolongement
pickSide: Un point sur l'extrémité à étendre
Returns: La Curve prolongée
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
Prolongez une Curve selon une distance donnée sur son point de départ. Les courbes fermées telles que les Circles et les Ellipses ne peuvent pas être prolongées.
distance: Distance de prolongement
Returns: La Curve prolongée
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
Prolonger une Curve selon une distance donnée sur son extrémité. Les courbes fermées telles que les Circles et les Ellipses ne peuvent pas être prolongées.
distance: Distance de prolongement
Returns: La Curve prolongée
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Patch
Corriger une Curve fermée
Returns: Une surface à l'intérieur de la Curve
fill,profiletosurf,loop,loop2surf,edgesurf

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projette une courbe d'entrée le long d'une direction de projection donnée sur une géométrie de base donnée. Géométrie à projeter sur la liste des vecteurs de géométries projetées dans la géométrie de base.