Autodesk.DesignScript.Geometry.Properties.Resources.LowerModelerExtentExceeded
Recherche une chaîne localisée semblable à Vos entrées sont hors de l'intervalle de modélisation autorisé. Choisissez le paramètre {0} avec un intervalle de modélisation compris entre {1} et {2} dans la boîte de dialogue "Paramètres => Intervalle utile de géométrie".

Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
Recherche une chaîne localisée semblable à Vous avez dépassé les limites de modélisation autorisées. Sélectionnez des valeurs plus petites.

Autodesk.DesignScript.Geometry.Properties.Resources.UpperModelerExtentExceeded
Recherche une chaîne localisée semblable à Vos entrées sont hors de l'intervalle de modélisation autorisé. Choisissez le paramètre {0} avec un intervalle de modélisation compris entre {1} et {2} dans la boîte de dialogue "Paramètres => Intervalle utile de géométrie".