Autodesk.DesignScript.Geometry.Ellipse.ToString
Obtenir une représentation de l'ellipse sous forme de chaîne

Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Créer une ellipse centrée au niveau du point d'entrée, alignée avec le plan XY du SCG, avec les rayons des axes X et Y spécifiés.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by origin and radii
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Créer une ellipse centrée au niveau du point d'entrée, avec deux axes spécifiés. Les axes doivent être positionnés à 90 degrés l'un par rapport à l'autre.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from origin vectors
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Créer une ellipse centrée et alignée avec le CoordinateSystem d'entrée, avec un rayon x_radius dans la direction X du système de coordonnées, et un rayon y_radius dans la direction Y du système de coordonnées.
origin: Origin coordinate system of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by coordinate system and radii
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Créer une ellipse centrée et alignée avec le plan d'entrée, avec un rayon x_radius dans la direction de l'axe X du plan, et un rayon y_radius dans la direction de l'axe Y du plan.
plane: Plane where ellipse arc is drawn
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from plane and radii
ellipse,aligned ellipse,ellipsebylengths