Autodesk.DesignScript.Geometry.EllipseArc.ToString
Obtenir une représentation de l'EllipseArc sous forme de chaîne

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Créer un EllipseArc dans un plan avec les rayons indiqués le long des axes X et Y et les angles de balayage
plane: Plan contenant l'arc de l'ellipse
xRadius: Le rayon de l'EllipseArc dans la direction X du plan
yRadius: Le rayon de l'EllipseArc dans la direction Y du plan
startAngle: L'angle de départ de l'arc mesuré à partir de l'axe X positif dans le plan d'entrée
sweepAngle: L'angle de balayage à partir de l'angle de départ en degrés
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiStartAngleSweepAngle(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Créer un EllipseArc dans un plan avec les rayons indiqués le long des axes X et Y et les angles de balayage
plane: Le plan dans lequel est contenu l'EllipseArc
xRadius: Le rayon de l'EllipseArc dans la direction X du plan
yRadius: Le rayon de l'EllipseArc dans la direction Y du plan
startAngle: L'angle de départ de l'arc tel que mesuré à partir de l'axe X positif du plan d'entrée
sweepAngle: L'angle de balayage à partir de l'angle de départ en degrés
ellipsearc,arcs