Autodesk.DesignScript.Geometry.Sphere.ToString
Obtenir une représentation de la sphère sous forme de chaîne

Autodesk.DesignScript.Geometry.Sphere.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Créer une sphère solide centrée au niveau du point d'entrée, avec un rayon donné.
Brep,brep