Autodesk.DesignScript.Geometry.IndexGroup.ToString
Obtenir une représentation de l'IndexGroup sous forme de chaîne

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
Comparer deux IndexGroup
other: L'autre IndexGroup
Returns: Si les deux objets sont égaux

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
Obtenir un code de hachage pour ce type
Returns: Un code de hachage unique pour cet objet

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
Créer un IndexGroup stockant quatre index
a: Index a
b: Index b
c: Index c
d: Index d
Returns: IndexGroup
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Créer un IndexGroup stockant trois index
a: Index a
b: Index b
c: Index c
Returns: IndexGroup
tri,polygon,mesh,meshes