Autodesk.DesignScript.Geometry.Vector.ToString
Obtenir une représentation du vecteur sous forme de chaîne

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Comparer les deux vecteurs
other: L'autre vecteur
Returns: Si les deux objets sont égaux

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
Obtenir un code de hachage pour ce type
Returns: Un code de hachage unique pour cet objet

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Former un vecteur à l'aide de 3 coordonnées euclidiennes
x: Coordonnée X
y: Coordonnée Y
z: Coordonnée Z
Returns: Vector created by coordinates
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Former un vecteur à l'aide de 3 coordonnées euclidiennes et normaliser le vecteur
x: Coordonnée X
y: Coordonnée Y
z: Coordonnée Z
normalized: True pour normaliser le vecteur, False pour ne pas normaliser
Returns: Vector created by coordinates
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Former un vecteur à l'aide de deux points de fin. Le résultat est un vecteur compris entre le début et le point de fin.
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
Obtenir le vecteur d'axe X canonique (1,0,0)
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
Obtenir le vecteur d'axe Y canonique (0,1,0)
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
Obtenir le vecteur d'axe Z canonique (0,0,1)
z,basis,up

Autodesk.DesignScript.Geometry.Vector.Cross(Autodesk.DesignScript.Geometry.Vector)
Former le produit vectoriel de deux vecteurs
perpendicular

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Former le produit scalaire de deux vecteurs
vec: a second vector
Returns: Resulting dot product
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Déterminez si deux vecteurs sont parallèles.
otherVector: Autre vecteur
Returns: Returns True if the vectors are parallel; false otherwise.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Déterminez si deux vecteurs sont presque égaux. Une valeur de tolérance de 1e-5 est donnée pour gérer les problèmes de précision.
otherVector: Autre vecteur
Returns: Returns True if the vectors are almost equal; false otherwise.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transformer ce vecteur selon la matrice CoordinateSystem d'entrée.
coordinateSystem: Système de coordonnées utilisé pour transformer le vecteur
Returns: Transformed vector

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Fait pivoter un vecteur autour d'un axe selon un nombre de degrés spécifié
axis: Rotation axis vector
degrees: Number of degrees to rotate
Returns: Rotated vector
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Fait pivoter un vecteur autour de l'origine et de la normale du plan selon un degré spécifié
plane: Plan de rotation
degrees: Number of degrees to rotate
Returns: Rotated vector
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Mettre à l'échelle le vecteur uniformément autour de l'origine
scale_factor: Scale factor
Returns: Scaled vector
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
Renvoie l'angle entre les deux vecteurs en degrés, de 0 à 180.
otherVector: Other vector
Returns: Returns angle between the supplied vectors in degrees from 0 to 180.
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
Renvoie l'angle entre les deux vecteurs, dans l'intervalle [0, 180] degrés.
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Renvoie l'angle entre les deux vecteurs en degrés, de 0 à 360. Utilise l'axe de rotation pour déterminer la direction de l'angle.
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Renvoie l'angle entre les deux vecteurs, dans l'intervalle [0, 360] degrés. Utilise l'axe de rotation pour déterminer la direction de l'angle.
rotation angle