Autodesk.DesignScript.Geometry.Helix.ToString
Obtenir une représentation de l'hélice sous forme de chaîne

Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Créer une hélice. L'hélice pivote toujours dans le sens horaire autour de la direction d'axe spécifiée. Si elle est affichée le long de l'axe de direction, l'utilisateur voit le point pivoter dans le sens horaire autour de l'axe à mesure qu'il se déplace le long de la courbe dans la direction du paramètre croissant. L'inclinaison est la distance de déplacement de l'hélice dans la direction de l'axe par tour. La valeur peut être positive ou négative.
axisPoint: Axis point
axisDirection: Axis direction vector
startPoint: Helix start point
pitch: Distance of the helix per each 360 degrees in the direction of the axis
angleTurns: How many turns in degrees
Returns: Helix created by axis
helix,screw,corkscrew,thread