Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
Obtenir une représentation du TSplineTopology sous forme de chaîne

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
Retour du sommet à un index donné
index: Index de sommet
Returns: sommets de la T-Spline
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
Retour à un index donné
index: Index pour obtenir une arête
Returns: Edges T-Spline
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
Face de retour au niveau de l'index donné
index: Index de face
Returns: Face T-Spline
tspline,face,byindex