Autodesk.DesignScript.Geometry.Arc.ToString
Obtenir une représentation de l'arc sous forme de chaîne

Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Créer un arc se rapprochant le plus possible d'un ensemble de points
points: Liste des points pour l'ajustement optimal de l'arc
Returns: Arc created by best fit through points
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Créer un arc ou biarc tangent à l'aide de points de début et de fin et des tangences au début et à la fin
point1: Point de départ du biarc
vector1: Vecteur de la tangente de départ du biarc
point2: Point de fin du biarc
vector2: Vecteur de la tangente de fin du biarc
arc,tangent

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Crée un arc à partir du point de début jusqu'au point de fin avec le début tangent au vecteur
startPoint: Start point of arc
endPoint: End point of arc
startTangent: Start tangent direction vector
arc,tangent,arcs