Autodesk.DesignScript.Geometry.Cuboid.ToString
Obtenir une représentation du Cuboid sous forme de chaîne

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(System.Double,System.Double,System.Double)
Créer un Cuboid centré au niveau de l'origine SCG, avec une largeur, une longueur et une hauteur.
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Créer un Cuboid centré au point d'entrée, en fonction de la largeur, de la longueur et de la hauteur spécifiées.
origin: Origin point
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Créez un cuboïde centré au niveau de l'origine SCG, avec une largeur, une longueur et une hauteur.
coordinateSystem: Système de coordonnées parent (centre du cuboïde)
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created from lengths
box,cube,cubebysize,bycoord,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Créer un Cuboid compris entre un point bas et un point haut.
lowPoint: Corner low point of cuboid
highPoint: Corner high point of cuboid
Returns: Cuboind created by corners
box,cube,byminmax,by corners,by points,cubes

Autodesk.DesignScript.Geometry.Cuboid.Length
Renvoie la distance de longueur.                         Remarque: cette option renvoie les cotes d'entrée du cuboïde, et non les cotes de l'espace univers réelles. En d'autres termes, si vous créez un Cuboid avec la largeur de l'axe X et la longueur 10, puis le transformez en un CoordinateSystem avec une échelle de deux dans X, la largeur sera toujours 10. ASM ne permet pas d'extraire les sommets d'un corps dans un ordre prévisible, de sorte qu'il est impossible de déterminer les cotes après une transformation.

Autodesk.DesignScript.Geometry.Cuboid.Width
Renvoie la distance de largeur.                         Remarque: cette option renvoie les cotes d'entrée du Cuboid, non les cotes de l'espace univers. En d'autres termes, si vous créez un Cuboid avec la largeur de l'axe X et la longueur 10, puis le transformez en CoordinateSystem avec une échelle de 2 dans X, la largeur sera toujours 10. ASM ne permet pas d'extraire les sommets d'un corps dans un ordre prévisible, de sorte qu'il est impossible de déterminer les cotes après une transformation.

Autodesk.DesignScript.Geometry.Cuboid.Height
Renvoie la distance de hauteur.                         Remarque: cette option renvoie les cotes d'entrée du Cuboid, et non les cotes d'espace univers réelles. En d'autres termes, si vous créez un Cuboid avec la largeur de l'axe X et la longueur 10, puis le transformez en un CoordinateSystem avec l'échelle 2 dans X, la largeur sera toujours 10. ASM ne permet pas d'extraire les sommets d'un corps dans un ordre prévisible, de sorte qu'il est impossible de déterminer les cotes après une transformation.