Autodesk.DesignScript.Geometry.Rectangle.ToString
Obtenir une représentation du rectangle sous forme de chaîne

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Créer un rectangle à l'aide de quatre points de coin.
points: List of corner points of rectangle
Returns: Rectangle created by corner points
rectbypointarray

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Créer un rectangle à l'aide de quatre points de coin.
p1: 1st corner point of rectangle
p2: 2nd corner point of rectangle
p3: 3rd corner point of rectangle
p4: 4th corner point of rectangle
Returns: Rectangle created by corner points
rectbypoints

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Créer un rectangle centré au niveau de l'origine du SCG dans le plan XY du SCG, avec la largeur (longueur de l'axe X) et la longueur (longueur de l'axe Y) spécifiées.
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Créer un rectangle centré au niveau de la racine du plan d'entrée, avec la largeur d'entrée (longueur de l'axe X du plan) et la longueur d'entrée (longueur de l'axe Y du plan).
plane: Plane used to center rectangle
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Créer un rectangle centré au niveau de l'origine d'entrée dans le plan XY du CoordinateSystem, avec la largeur (longueur de l'axe X) et la longueur (longueur de l'axe Y) spécifiées.
coordinateSystem: Système de coordonnées du rectangle (centre du rectangle)
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created from width and length
rectbylengths