Autodesk.DesignScript.Geometry.Circle.ToString
Obtenir une représentation du Circle sous forme de chaîne

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Crée un Circle à l'aide d'un point central d'entrée et un rayon dans le plan XY univers, avec l'univers Z standard.
centerPoint: Center point of circle
radius: Radius
Returns: Circle created with center point and radius
circle

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadiusNormal(Autodesk.DesignScript.Geometry.Point,System.Double,Autodesk.DesignScript.Geometry.Vector)
Crée un Circle avec le point central, le rayon et la direction de normale spécifiés.
centerPoint: Center point of circle
radius: Radius
normal: Normal direction vector
Returns: Circle created with center point radius and normal
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
Créer un Circle centré au niveau de l'origine du plan d'entrée (racine), dans le plan d'entrée, avec un rayon donné.
plane: Root of plane used to center circle
radius: Radius
Returns: Circle created with plane and radius
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Créer un Circle passant par trois points d'entrée.
p1: 1st point of circle
p2: 2nd point of circle
p3: 3rd point of circle
circle

Autodesk.DesignScript.Geometry.Circle.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Ajustement optimal du Circle au travers des points
points: Liste des points pour l'ajustement du cercle
Returns: Circle created from points
circle,approximate