Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
Obtenir une représentation du TSplineReflection sous forme de chaîne

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
Créer radial réflexion pour la symétrie T-Spline en plan donné avec le nombre de segments spécifié et l'angle (en degrés) entre chaque paire de segments.
plane: Plan normale pour le rayon de l'axe de la réflexion. Dans le système de coordonnées Univers
segmentsCount: Nombre de segments de rayon de réflexion
segmentAngle: Angle entre chaque paire de segments de symétrie radiale (en degrés). Lorsque est définie sur 0, elle est définie par (360 / segmentsCount)
Returns: Réflexion de T-Spline radial
tspline,symmetry,reflection,radial