Autodesk.DesignScript.Geometry.Surface.ToString
Obtenir une représentation de la surface sous forme de chaîne

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Assemblez un ensemble de surfaces en une seule. Cette méthode peut renvoyer une polysurface si l'assemblage obtenu n'est pas multiple ou comporte plusieurs faces.
surfaces: Ensemble de surfaces.
Returns: Union des surfaces
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Créer une surface par lissage entre les Curves de profil de coupe d'entrée.
crossSections: Curves to loft through
Returns: Surface created by loft
loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
Créer une surface par lissage entre les lignes de profil de coupe d'entrée. Cette méthode est un peu plus rapide et permet d'obtenir un résultat plus lisse que Surface.ByLoft.
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Lisser une surface au travers des profils de coupe avec une courbe de guidage indiquée (également appelée "rail"). La courbe de guidage doit entrecouper toutes les courbes de profil de coupe.
loftbyrail

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Lisser une surface au travers des profils de coupe avec des courbes de guidage indiquées (également appelées "rails"). Les courbes de guidage doivent entrecouper toutes les courbes de profil de coupe.
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Créer une surface en balayant une Curve de profil de coupe le long d'une trajectoire.
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Créer une surface de polygone en reliant les points d'entrée dans un polygone fermé et en corrigeant celui-ci.
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Balayer la courbe de profil de coupe le long d'une trajectoire guidée par deux rails
path: Trajectoire d'entrée du balayage.
guideRail: Un rail de guidage pour l'orientation du balayage.
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Créer une surface par balayage de la Curve de profil autour du rayon de l'axe formé par le point d'origine dans la direction du vecteur d'axe. L'angle initial en degrés est start_angle, et le balayage est appliqué à l'angle sweep_angle en degrés.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Créer une surface en remplissant l'intérieur d'un contour fermé défini par les Curves d'entrée.
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Différence booléenne de cette surface et de l'assemblage des surfaces d'entrée. Cette méthode peut renvoyer une polysurface si l'opérateur booléen n'est pas multiple ou comporte plusieurs faces.
others: Autres surfaces à soustraire
Returns: Surface booléenne ou polysurface obtenues
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Relimitez la surface à l'aide de plusieurs boucles dans la surface d'entrée. Une des boucles doit être la boucle de contour de la surface d'entrée. Ajoutez également des boucles intérieures pour les trous.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
Renvoyer la normale de la surface au point d'entrée sur la surface.
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
Obtient une représentation NURBS de la surface. Cette méthode peut générer une surface approximative dans certaines circonstances.

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Obtient une représentation NURBS de la surface en fonction d'une tolérance spécifiée. Cette méthode peut générer une surface approximative dans certaines circonstances.
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Epaissir la surface dans un solide, en réalisant une extrusion dans la direction des normales de la surface sur les deux côtés de la surface.
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Epaissir la surface dans un solide, en réalisant une extrusion dans la direction des normales de la surface. Si le paramètre both_sides est True, la surface est épaissie sur les deux côtés.
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
Décaler la surface dans la direction de la normale de surface selon une distance spécifiée.
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
Le système de coordination renvoyé utilise xAxis, yAxis et zAxis pour représenter uDir, vDir et la normale. La longueur de xAxis et yAxis représente les courbures.
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
Renvoie un CoordinateSystem aligné avec les directions des courbures principales.
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
Renvoie le vecteur de tangente U avec les paramètres U et V spécifiés.
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
Renvoie le vecteur de tangente V avec les paramètres U et V spécifiés.
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
Renvoie le vecteur de normale avec les paramètres U et V spécifiés.
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
Renvoie les dérivés aux coordonnées U et V d'entrée.
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
Renvoie les vecteurs de direction principaux avec les paramètres U et V.
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
Créer une courbe de ligne de paramètre sur la surface indiquée. Créer une Curve qui représente une ligne de paramètre U ou V sur la surface. Une ligne de paramètre indique la direction d'un paramètre U ou V croissant à un paramètre U ou V opposé constant. La Curve obtenue correspond au paramétrage de la surface et son intervalle est délimité par l'intervalle de paramètres de surface. Le type de Curve renvoyé dépend du type de surface.
isoDirection: Si la direction == 0, crée une ligne de paramètre U, si la direction == 1, crée une ligne de paramètre V.
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Renvoie une nouvelle surface avec la normale inversée. Laisse cette surface inchangée.
Returns: Surface, which is the same as the input surface but with flipped normals

Autodesk.DesignScript.Geometry.Surface.Join(Autodesk.DesignScript.Geometry.Surface)
Combine cette surface et la surface d'entrée dans une polysurface
topolysurface

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Combine cette surface et les surfaces d'entrée dans une polysurface
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projette la Geometry d'entrée sur cette surface, dans la direction du vecteur d'entrée. Actuellement, cette méthode de projection ne prend en charge que les points ou les courbes.
projecttosurface,projectonto