Autodesk.DesignScript.Geometry.NurbsSurface.ToString
Obtenir une représentation de la NURBSSurface sous forme chaîne

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Crée une NurbsSurface avec des points interpolés et des degrés U et V spécifiés. La surface obtenue passe par tous les points.
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Crée une NurbsSurface avec des points interpolés et des degrés U et V spécifiés. La surface obtenue passe par tous les points. Le nombre de tangentes doit correspondre au nombre de points dans la direction correspondante. La surface obtenue est de degré 3 à la fois dans la direction U et la direction V.
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Crée une NurbsSurface satisfaisant à un ensemble de différentes caractéristiques de surface. Il s'agit de la méthode de raccord de surface la plus avancée. La surface obtenue va passer par tous les points. Le nombre de tangentes doit correspondre au nombre de points dans la direction correspondante. La surface obtenue est de degré 3 à la fois dans la direction U et la direction V. Les dérivés d'angle doivent être du second ordre (DP/dUdV) et doivent être fournis dans cet ordre [lowU, lowV], [highU, lowV], [lowU, highV], [highU, highV].
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Créer une NurbsSurface en utilisant des points de contrôle explicites, avec les degrés U et V indiqués.
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
Crée une NurbsSurface avec les sommets de contrôle, les noeuds, les épaisseurs et les degrés U V spécifiés. Il existe plusieurs restrictions sur les données qui, si endommagées, entraîneront l'échec de la fonction et émettront une exception. Degré: les degrés U et V doivent être >= 1 (spline linéaire par morceaux) et inférieurs à 26 (degré de base de spline B maximum pris en charge par ASM). Poids: toutes les valeurs d'épaisseur (si indiquées) doivent être strictement positives. Les épaisseurs inférieures à 1e-11 seront rejetées et la fonction échouera. Noeuds: les deux vecteurs de noeud doivent être des séquences non décroissantes. La multiplicité de noeuds intérieure ne doit pas être supérieure au degré + 1 au niveau du noeud de début/fin ni au degré au niveau d'un noeud interne (cela permet aux surfaces avec des discontinuités G1 d'être représentées). Notez que les vecteurs de noeuds non bloqués sont pris en charge, mais seront convertis en vecteurs de noeuds bloqués, avec les modifications correspondantes appliquées aux données de point de contrôle/d'épaisseur.
lines
0.4

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
Renvoie les épaisseurs des points de contrôle de la NurbsSurface. Elles déterminent l'influence appliquée par chacun des points de contrôle sur la forme de la surface.
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
Renvoie des noeuds de surface dans la direction U. Les noeuds sont une série de valeurs de paramètres (doubles) servant à déterminer où et comment les points de contrôle affectent la surface.
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
Renvoie des noeuds de surface dans la direction V. Les noeuds sont une série de valeurs de paramètres (doubles) servant à déterminer où et comment les points de contrôle affectent la surface.
Returns: Nurbs V knots of surface