Autodesk.DesignScript.Geometry.Polygon.ToString
Obtenir une représentation du polygone sous forme de chaîne

Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Vérifie si le point se trouve à l'intérieur d'un polygone planaire sans auto-intersections.