Autodesk.DesignScript.Geometry.Edge.ToString
Obtenir une représentation de l'Edge sous forme de chaîne

Autodesk.DesignScript.Geometry.Edge.CurveGeometry
Curve sous-jacente constituant l'Edge

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
Faces adjacentes à cette Edge

Autodesk.DesignScript.Geometry.Edge.StartVertex
Sommet où commence cette Edge

Autodesk.DesignScript.Geometry.Edge.EndVertex
Sommet où se termine cette Edge