Autodesk.DesignScript.Geometry.Solid.ToString
Obtenir une représentation du solide sous forme de chaîne

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Créer un solide par lissage entre les Curves fermées de profil de coupe d'entrée, à l'aide d'une Curve de guidage. La Curve de guidage doit entrecouper toutes les Curves de profil de coupe.
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Créer un solide par lissage entre les Curves fermées de profil de coupe d'entrée, avec l'aide de Curves de guidage. Les Curves de guidage doivent entrecouper toutes les Curves de profil de coupe.
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
Créez un solide par lissage entre des profils de coupe d'entrée constitués de PolyCurves fermées. Cette opération est optimisée pour les coupes composées de segments de ligne exclusivement, avec des sommets suivant le même ordre. Si l'option de vérification et réparation est activée, la validité du solide obtenu est garantie. Si vous la désactivez, en revanche, les performances devraient s'améliorer.
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Balayer une Curve de profil fermée le long de deux Curves de rail.
path: Trajectoire d'entrée du balayage.
guideRail: Un rail de guidage pour l'orientation du balayage.
profile: The profile curve to sweep along the path
Brep,brep,sweep2,guides,sweepprofile

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Créer un solide de révolution, en balayant la courbe de profil autour du rayon d'axe formé par l'origine et le vecteur de l'axe, à partir de l'angle de départ en degrés vers l'angle de balayage en degrés.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Solid created by revolve
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
Unit une liste de solides à ce solide.
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
Différence booléenne de ce solide avec un autre

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
Obtenir une coque solide à partir des faces de ce solide
internalFaceThickness: Distance de prolongement de la coque vers l'intérieur
externalFaceThickness: Distance de prolongement de la coque vers l'extérieur
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projette la Geometry d'entrée sur ce solide, dans la direction du vecteur d'entrée. Actuellement, cette méthode de projection ne prend en charge que les points ou les courbes.
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
Sépare un solide en solides individuels s'il comporte plusieurs blocs disjoints. Renvoie le même solide s'il s'agit d'un bloc contigu unique.
Returns: séparer les solides disjoints
split,disjoint