Autodesk.DesignScript.Geometry.Point.ToString
Obtenir une représentation du point sous forme de chaîne

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Comparer les deux points
other: L'autre point
Returns: Si les deux objets sont égaux

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
Obtenir un code de hachage pour ce type
Returns: Un code de hachage unique pour cet objet

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
Former un point dans le plan XY selon deux coordonnées cartésiennes. Le composant Z est défini sur 0.
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
Obtenir le point d'origine (0,0,0)
Returns: Origin point
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
Former un point en fonction de 3 coordonnées cartésiennes
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Former un point dans le système de coordonnées indiqué avec trois coordonnées cartésiennes
coordinateSystem: Système de coordonnées parent
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
Réduire les points pour exclure les doublons dans la marge de tolérance des points inclus
points: Liste de points à partir de laquelle réduire les doublons
tolerance: Tolérance utilisée pour la réduction
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near