Autodesk.DesignScript.Geometry.Plane.ToString
Obtenir une représentation du plan sous forme de chaîne

Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Créer un plan centré au niveau du point d'origine, avec le vecteur de la normal d'entrée.
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Créez un plan "orienté ", positionné au niveau du point d'origine avec la normale du vecteur, mais avec une orientation de l'axe X spécifique. Cela n'a aucune incidence sur les opérations liées à la scission, à l'intersection, au projet, etc. Cela indique uniquement l'orientation du système de coordonnées d'entrée.
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Les axes X et Y se trouvent dans le plan. L'axe Z est le produit vectoriel de deux vecteurs.
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Ajuste un plan aux points d'entrée; il s'agit d'un ajustement de nuages de points 3D.
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Créer le plan contenant la ligne d'entrée et le point externe. Le point ne peut pas se trouver sur la ligne ou dans l'axe de la ligne.
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
Crée un plan dans l'univers XY
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
Crée un plan dans le plan XZ univers
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
Crée un plan dans l'univers YZ
Returns: Plane at YZ plane of world

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
Crée un CoordinateSystem représentant ce plan. Il est basé sur l'origine et sur les axes X et Y.
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
Créer un plan décalé par ce plan dans la direction de la normale en fonction de la distance spécifiée.
alongnormal,moveplane