Autodesk.DesignScript.Geometry.NurbsCurve.ToString
Obtenir une représentation de la NURBSCurve sous forme de chaîne

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Créer une BSplineCurve à l'aide de points de contrôle explicites. Remarque 1: les BSplineCurves avec un degré = 1 possèdent des discontinuités G1, qui entraînent des problèmes au niveau de l'extrusion, du balayage et d'autres opérations. Elles doivent être évitées. Utilisez une polycourbe. Remarque 2: si la courbe est périodique (fermée), le premier point et le dernier point DOIVENT être les mêmes.
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Créer une BSplineCurve à l'aide de points de contrôle explicites. Remarque 1: les BSplineCurves avec un degré = 1 possèdent des discontinuités G1, qui entraînent des problèmes au niveau de l'extrusion, du balayage et d'autres opérations. Elles doivent être évitées. Utilisez une polycourbe. Remarque 2: si la courbe est périodique (fermée), le premier point et le dernier point DOIVENT être les mêmes.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Créer une BSplineCurve à l'aide de points de contrôle explicites. Remarque 1: les BSplineCurves avec un degré = 1 possèdent des discontinuités G1, qui entraînent des problèmes au niveau de l'extrusion, du balayage et d'autres opérations. Elles doivent être évitées. Utilisez une polycourbe. Remarque 2: si la courbe est périodique (fermée), le premier point et le dernier point DOIVENT être les mêmes.
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
Créer une BSplineCurve à partir des sommets de contrôle, des épaisseurs et des noeuds. Dans les documents ASM: degré: doit être supérieur à 1 (spline linéaire par morceaux) et inférieur à 26 (degré de base B-spline maximum pris en charge par ASM). Epaisseurs: toutes les valeurs d'épaisseur (si indiquées) doivent être strictement positives. Les épaisseurs inférieures à 1e-11 sont rejetées et la fonction échoue. Noeuds: le vecteur nodal doit être une séquence non décroissante. La multiplicité de noeuds intérieurs ne doit pas être supérieure au degré + 1 au niveau du noeud de début/fin et au degré au niveau d'un noeud interne (cela permet aux courbes possédant des discontinuités G1 d'être représentées). Notez que les vecteurs de noeud non bloqués sont pris en charge, mais seront convertis en noeuds bloqués, avec les modifications correspondantes appliquées aux données de point de contrôle/d'épaisseur. Réseau de noeuds: la taille du réseau doit être num_control_points + degré + 1
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Créer une BSplineCurve par interpolation entre des points.
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Créer une BSplineCurve par interpolation entre des points. Remarque 2: si la courbe est périodique (fermée), le premier et le dernier point doivent être les mêmes.
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Créer une BSplineCurve par interpolation entre des points avec le degré spécifié.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Renvoie une BSplineCurve au travers des points, avec des directions tangentes.
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
Obtenir les points de contrôle de la NurbsCurve. Il s'agit des points que la courbe interpole.
Returns: Un réseau de points

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
Noeuds de la courbe. Les noeuds sont une série de valeurs de paramètres (doubles) servant à déterminer où et comment les points de contrôle affectent la courbe.
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
Renvoie les épaisseurs des points de contrôle de la NurbsCurve. Elles déterminent l'influence de chaque point de contrôle sur la forme de la courbe.
Returns: Weights of nurbs curve
ptweight