Autodesk.DesignScript.Geometry.UV.ToString
Obtenir une représentation de l'UV sous forme de chaîne

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
Comparer les deux UV
other: L'autre UV
Returns: Si les deux objets sont égaux

Autodesk.DesignScript.Geometry.UV.GetHashCode
Obtenir un code de hachage pour ce type
Returns: Un code de hachage unique pour cet objet

Autodesk.DesignScript.Geometry.UV.ByCoordinates(System.Double,System.Double)
Créer un UV à partir de deux doubles.
u: U value
v: V value
Returns: UV created by coordinates
surfaceparam,parameters,uv,uvs