Autodesk.DesignScript.Geometry.Face.ToString
Obtenir une représentation de la face sous forme de chaîne

Autodesk.DesignScript.Geometry.Face.SurfaceGeometry
Surface sous-jacente constituant la face
Returns: Surface representation of face