Autodesk.DesignScript.Geometry.Cone.ToString
Obtenir une représentation du Cone sous forme de chaîne

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Créer un Cone avec un rayon de base donné au point de début, en l'étendant jusqu'à un sommet au niveau du point de fin.
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Créer un Cone avec un axe situé entre le point de début et le point de fin, avec les rayons indiqués au début et à la fin. Cet objet ne possède pas de sommet, et ne peut être considéré comme un Cone ajusté.
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crée un Cone avec le point de base au niveau de l'origine du CoordinateSystem, en l'étendant dans la direction de l'axe Z du CoordinateSystem, avec une base circulaire dans le plan XY du CoordinateSystem.

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Crée un Cone avec le point de base au niveau de l'origine du CoordinateSystem, s'étendant dans la longueur de la direction de l'axe Z du CoordinateSystem, avec une base circulaire dans le plan XY du CoordinateSystem.
cone,cone by height,cones