Autodesk.DesignScript.Geometry.Mesh.ToString
Obtenir une représentation du maillage sous forme de chaîne

Autodesk.DesignScript.Geometry.Mesh.ByPointsFaceIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
Créer un maillage à partir d'un ensemble de points et un ensemble d'IndexGroups référençant l'ensemble de points
vertexPositions: List of points that determine vertex positions
indices: Indices for vertices
Returns: Mesh created from points
mesh,meshes