DSCore.DummyPythonEvaluator
Средство оценки Python, которое возвращает ошибку при выполнении оценки.
Используется преимущественно для указания того, что не удалось найти действительное средство оценки Python.

DSCore.DummyPythonEvaluator.Evaluate(System.String,System.Collections.IList,System.Collections.IList)
Отображение исключения с назначенным сообщением