DSCore.DateTime.Components(System.DateTime)
Извлечение отдельных компонентов DateTime.
dateTime: Значение DateTime для получения компонентов
Числовое представление года (1–9999)
Числовое представление месяца (1–12)
Числовое представление дня (1–[число дней в месяце])
Числовое представление часа (0–23)
Числовое представление минут (0–59)
Числовое представление секунд (0–59)
Числовое представление секунд (0–999)