Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Построение окружности с центром во входной точке, с радиусом в мировой плоскости XY и нормалью на оси Z.
centerPoint: Центральная точка окружности
radius: Радиус
Returns: Окружность, созданная по центру и радиусу
circle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
Создание окружности с центром в начале координат плоскости, находящейся во входной плоскости, с заданным радиусом.
plane: Корневая точка плоскости, используемая для центрирования окружности
radius: Радиус
Returns: Окружность, созданная по плоскости и радиусу
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Создание окружности, проходящей через три входные точки.
p1: Первая точка окружности
p2: Вторая точка окружности
p3: Третья точка окружности
circle