Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Создание линии, касательной к исходной кривой, расположенной в точке параметра исходной кривой.
curve: Базовая кривая для касательной линии
parameter: Значение параметра
Returns: Касательная линия
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Построение прямой линии заданной длины, начинающейся в начальной точке и проходящей в направлении вектора.
startPoint: Начальная точка линии
direction: Вектор направления
length: Длина линии
Returns: Линия по начальному направлению и длине
linebyvector,lines