Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Создание объекта IndexGroup, содержащего три индекса
a: Индекс a
b: Индекс b
c: Индекс c
Returns: Группа индексов
tri,polygon,mesh,meshes