Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Построение дуги от начальной до конечной точки, начальная часть которой расположена по касательной к вектору
startPoint: Начальная точка дуги
endPoint: Конечная точка дуги
startTangent: Вектор направления касательной в начале
arc,tangent,arcs