Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Построение вектора на основе 3 евклидовых координат
x: Координата X
y: Координата Y
z: Координата Z
Returns: Вектор, созданный по координатам
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Построение вектора на основе 3 евклидовых координат и нормализация вектора
x: Координата X
y: Координата Y
z: Координата Z
normalized: Значение true для нормализации вектора, в противном случае — false
Returns: Вектор, созданный по координатам
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Получение скалярного произведения двух векторов
vec: второй вектор
Returns: Итоговое скалярное произведение
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Определение того, параллельны ли два вектора.
otherVector: Другой вектор
Returns: Возврат значения true, если векторы параллельны; в противном случае — false.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Определение того, являются ли два вектора почти равными. Значение допуска 1e-5, заданное для устранения проблем, связанных с точностью.
otherVector: Другой вектор
Returns: Возврат значения true, если векторы почти равны; в противном случае — false.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Преобразование этого вектора с помощью входной матрицы CoordinateSystem.
coordinateSystem: Система координат, используемая для преобразования вектора
Returns: Преобразованный вектор

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Поворот вектора вокруг оси с заданным значением кривизны
axis: Вектор оси вращения
degrees: Количество градусов для поворота
Returns: Повернутый вектор
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Поворот вектора относительно нормали и начала координат плоскости на заданное
количество градусов
plane: Плоскость вращения
degrees: Количество градусов для поворота
Returns: Повернутый вектор
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Равномерное масштабирование вектора относительно начала координат
scale_factor: Масштабный коэффициент
Returns: Масштабированный вектор
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Возврат угла между двумя векторами в диапазоне от 0 до 360 градусов. Для определения направления угла используется ось вращения.
otherVector: Другой вектор
rotationAxis: Ось вращения
Returns: Возврат угла между предоставленными векторами в градусах от 0 до 360
rotation angle,