Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Создание спирали. Спираль всегда вращается по часовой стрелке вокруг указанной оси. При просмотре по направлению оси будет видна точка поворота по часовой стрелке вокруг оси при перемещении вдоль кривой в направлении увеличения параметра. Шаг – это расстояние, на которое спираль перемещается в направлении оси, проходя одну петлю. Его значение может быть как положительным, так и отрицательным.
axisPoint: Точка оси
axisDirection: Вектор направления оси
startPoint: Начальная точка спирали
pitch: Расстояние от спирали на каждые 360 градусов в направлении оси
angleTurns: Количество витков в градусах
Returns: Спираль, созданная по оси
helix,screw,corkscrew,thread