Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Создание элемента BSplineCurve с помощью точных управляющих точек. Примечание 1: В объектах BSplineCurve со значением кривизны = 1 имеются точки разрыва G1, приводящие к проблемам при выдавливании, сдвиге и выполнении других операций. Их следует избегать. Используйте вместо них объекты PolyCurve. Примечание 2: если кривая является периодической (замкнутой), первые и последние точки должны совпадать.
points: Точки для NURBS-кривой
Returns: NURBS-кривая, созданная по точкам
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Создание элемента BSplineCurve с помощью точных управляющих точек. Примечание 1: В объектах BSplineCurve со значением кривизны = 1 имеются точки разрыва G1, приводящие к проблемам при выдавливании, сдвиге и выполнении других операций. Их следует избегать. Используйте вместо них объекты PolyCurve. Примечание 2: если кривая является периодической (замкнутой), первые и последние точки должны совпадать.
points: Точки для NURBS-кривой
degree: Степень кривой
Returns: NURBS-кривая, созданная по точкам
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Создание элемента BSplineCurve с помощью точных управляющих точек. Примечание 1: В объектах BSplineCurve со значением кривизны = 1 имеются точки разрыва G1, приводящие к проблемам при выдавливании, сдвиге и выполнении других операций. Их следует избегать. Используйте вместо них объекты PolyCurve. Примечание 2: если кривая является периодической (замкнутой), первые и последние точки должны совпадать.
points: Точки для NURBS-кривой
degree: Степень кривой
closeCurve: Включение/отключение для замыкания кривой
Returns: NURBS-кривая, созданная по точкам
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Создание элемента BSplineCurve путем интерполяции между точками. Примечание 2: если кривая является периодической (замкнутой), первые и последние точки должны совпадать.
points: Точки для NURBS-кривой
closeCurve: Включение/отключение для замыкания кривой
Returns: NURBS-кривая, созданная по точкам
fit,approximate,spline,lines
0.5,0.5,0.5,0.45