Autodesk.DesignScript.Geometry.Properties.Resources.OutsideAllowableModelingRange
Поиск локализованной строки, подобной строке «Введенные данные находятся за пределами допустимого диапазона моделирования. Попробуйте выбрать параметр {0} с диапазоном моделирования между {1} и {2} в диалоговом окне "Настройки" => "Общие" => "Масштабирование геометрии"».