Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Создание ориентированной плоскости, расположенной в точке начала координат с вектором нормали, но с особой ориентацией оси X. Это никак не влияет на разделение, пересечение, проецирование и другие операции; с помощью этого определяется ориентация входного объекта CoordinateSystem.
origin: Исходная точка плоскости
normal: Вектор направления нормали
xAxis: Вектор направления оси X
Returns: Плоскость по нормали к началу координат и оси X

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Создание плоскости, содержащей линию ввода и внешнюю точку. Точка не может находиться на линии или на соответствующей оси.
line: Линия, используемая для определения плоскости
point: Точка, используемая для определения плоскости
Returns: Плоскость, созданная по отрезку и точке
lines
0.4