Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Создание NurbsSurface с заданными интерполированными точками значениями кривизны U и V.  Результирующая поверхность будет проходить через все точки.
points: Сетка точек для NURBS-поверхности
uDegree: Градус в направлении U
vDegree: Градус в направлении V
Returns: NURBS-поверхность, созданная по точкам
fit,topoints