Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Преобразование Т-сплайновой поверхности в тело или поверхность в зависимости от формы
Примечание. Итоговое граничное представление может несколько отличаться от ожидаемого, если входная поверхность была создана в более поздней версии Т-сплайновой поверхности, чем версия, загруженная в Dynamo, поскольку в этом случае в преобразовании используется копия поверхности, уровень версии которой понижается до версии Dynamo.
matchTopology: Определение того, должно ли итоговое тело иметь такую же топологию, как входная Т-сплайновая поверхность.
Returns: Объект топологии (Solid или Surface)
tspline,brep,solid,surface