Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Создание одной или нескольких поликривых путем группировки соединенных кривых. Выберите предпочтительный допуск соединения между элементами 1e-6 и 1e-3.
curves: Кривые, которые нужно сгруппировать для создания одного или нескольких объектов PolyCurve
joinTolerance: Допуск для определения размера допустимого зазора между объединяемыми кривыми

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Сложная кривая сопряжения на соответствующей плоскости.
radius: Радиус сопряжения
rightSide: Значение true для сопряжения справа относительно начала сложной кривой, false — слева
Returns: Скругленная сложная кривая
round,smooth,radius