Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Создание тела вращения путем сдвига кривой профиля вокруг луча оси, представляющего собой вектор оси с началом в точке значения начального угла в градусах, который заканчивается значением угла сдвига в градусах.
profile: Кривая профиля для вращения
axisOrigin: Начало вращающейся оси
axisDirection: Направление вращающейся оси
startAngle: Начальный угол в градусах
sweepAngle: Угол сдвига в градусах
Returns: Тело, созданное путем вращения
Brep,brep,lathe,revolveprofile