Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Создание кубоида, центрированного по входной точке, с определенной шириной, длиной и высотой.
origin: Исходная точка
width: Ширина кубоида
length: Длина кубоида
height: Высота кубоида
Returns: Кубоид, созданный по длинам
box,cube,cubebysize,bycenter,cubes