Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Создание поверхности посредством лофтинга между входными кривыми поперечного сечения.
crossSections: Кривые для лофта
Returns: Поверхность, созданная лофтом
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Лофтинг поверхности через поперечные сечения с использованием заданных направляющих кривых. Направляющие кривые должны пересекать все кривые поперечного сечения.
crossSections: Кривые для лофта
guideCurves: Направляющие кривые для лофта
Returns: Поверхность, созданная лофтом
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Создание поверхности путем сдвига кривой поперечного сечения вдоль траектории.
profile: Кривая для сдвига
path: Кривая траектории, используемая создания для сдвига
Returns: Поверхность, созданная путем сдвига профиля вдоль траектории
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Создание поверхности полигона, соединяющей входные точки в замкнутом полигоне и замыкающей его.
points: Список точек периметра
Returns: Поверхность, созданная по точкам периметра
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Создание поверхности путем сдвига кривой профиля вокруг луча оси, представляющего собой вектор оси с началом в точке значения start_angle в градусах, заканчивающийся значением sweep_angle в градусах.
profile: Кривая профиля для вращения
axisOrigin: Начало вращающейся оси
axisDirection: Направление вращающейся оси
startAngle: Начальный угол в градусах
sweepAngle: Угол сдвига в градусах
Returns: Поверхность, созданная вращением профиля
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Создание поверхности путем заполнения пространства внутри замкнутой границы, определяемой входными кривыми.
closedCurve: Замкнутая кривая, используемая как граница поверхности
Returns: Поверхность, созданная путем замыкания
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Получение представления NURBS для поверхности в пределах заданного допуска. При использовании данного метода можно в определенных условиях аппроксимировать поверхность.
tolerance: Заданный допуск
Returns: Представление NURBS-поверхности для поверхности
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Утолщение поверхности до формирования тела с выдавливанием в направлении нормалей поверхности с обеих сторон поверхности.
thickness: Величина утолщения
Returns: Утолщенная поверхность как тело
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Утолщение поверхности до формирования тела с выдавливанием в направлении нормалей поверхности. Если для параметра both_sides установлено значение «истина», поверхность будет утолщена с обеих сторон.
thickness: Величина утолщения
both_sides: True для утолщения с обеих сторон, false для утолщения с одной стороны
Returns: Утолщенная поверхность как тело
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
В полученной системе координат используются параметры xAxis, yAxis и zAxis для обозначения uDir, vDir и нормали. Длина xAxis и yAxis обозначает величину кривизны.
u: Компонент U параметра
v: Компонент V параметра
Returns: Система координат на основе нормали, направления U и направления V в положении UV на поверхности

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Получение новой поверхности с перевернутой нормалью. Поверхность при этом остается без изменений.
Returns: Поверхность, которая совпадает с входной поверхностью, но с отраженными нормалями