Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Построение прямоугольника, центрированного в начале координат МСК в плоскости XY МСК с заданной шириной (расстояние по оси X) и длиной (расстояние по оси Y).
width: Ширина прямоугольника
length: Длина прямоугольника
Returns: Прямоугольник, созданный по ширине и длине
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Построение прямоугольника, центрированного в корне входной плоскости с входной шириной (расстояние по оси плоскости X) и длиной (расстояние по оси плоскости Y).
plane: Плоскость, используемая для центрирования прямоугольника
width: Ширина прямоугольника
length: Длина прямоугольника
Returns: Прямоугольник, созданный по ширине и длине
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Построение прямоугольника, центрированного во входном начале координат CoordinateSystem в плоскости XY с заданной шириной (расстояние по оси X) и длиной (расстояние по оси Y).
coordinateSystem: Система координат прямоугольника (центр прямоугольника)
width: Ширина прямоугольника
length: Длина прямоугольника
Returns: Прямоугольник, созданный по ширине и длине
rectbylengths