Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Построение эллипса с центрированием по входной точке и выравниванием по плоскости XY МСК с заданными значениями радиуса X и Y.
origin: Исходная точка эллипса
xAxisRadius: Радиус на оси X
yAxisRadius: Радиус на оси Y
Returns: Эллипс, созданный по началу координат и радиусам
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Построение эллипса с центром во входной точке с двумя заданными осями. Оси должны быть под углом 90 градусов друг к другу.
origin: Исходная точка эллипса
xAxisRadius: Радиус на оси X
yAxisRadius: Радиус на оси Y
Returns: Эллипс, созданный по векторам начала координат
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Построение эллипса с центрированием и выравниванием по входному объекту CoordinateSystem, со значением радиуса x_radius в направлении оси X, и y_radius — в направлении оси Y.
origin: Исходная система координат эллипса
xAxisRadius: Радиус на оси X
yAxisRadius: Радиус на оси Y
Returns: Эллипс, созданный по системе координат и радиусам
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Построение эллипса с центрированием и выравниванием по входной плоскости, со значением радиуса x_radius в направлении оси X, и y_radius — в направлении оси Y.
plane: Плоскость, на которой строится дуга эллипса
xAxisRadius: Радиус на оси X
yAxisRadius: Радиус на оси Y
Returns: Эллипс, созданный по плоскости и радиусам
ellipse,aligned ellipse,ellipsebylengths