Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Получение пересечения двух элементов BoundingBox
other: Другая ограничивающая рамка для пересечения
Returns: Ограничивающая рамка, полученная в результате пересечения ограничивающих рамок

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Определите, пересекаются ли два элемента BoundingBoxes
other: Другая ограничивающая рамка
Returns: Имеется ли пересечение ограничивающих рамок
get overlap