DSCore.DummyPythonEvaluator
평가 시에만 오류가 발생하는 Python 평가기입니다.
실제 Python 평가기를 찾을 수 없음을 나타내는 데 주로 사용됩니다.

DSCore.DummyPythonEvaluator.Evaluate(System.String,System.Collections.IList,System.Collections.IList)
지정된 메시지로 예외가 발생합니다.