DSCore.DateTime.Components(System.DateTime)
DateTime의 개별 구성요소를 추출합니다.
dateTime: 구성요소를 가져올 DateTime
연도의 숫자 표현(1-9999)
월의 숫자 표현(1-12)
날짜의 숫자 표현(1-[월의 일수])
시간의 숫자 표현(0-23)
분의 숫자 표현(0-59)
초의 숫자 표현(0-59)
초의 숫자 표현(0-999)