DSCore.List.IndexOf(System.Collections.IList,System.Object)
지정된 리스트에 있는 요소의 색인을 반환합니다. 지정된 리스트와 대상 요소 간의 일치는 엄격한 일치여야 합니다(예: 정수 대 정수, double 대 double, 문자열 대 문자열, 객체 대 객체 등).
list: 요소를 찾을 리스트입니다.
element: 색인이 반환될 요소입니다.
리스트에 있는 요소의 색인입니다. 엄격한 일치를 찾을 수 없는 경우 유효하지 않은 색인 -1이 반환됩니다.
index,indexof