Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
시작점에서 끝점까지 벡터의 시작 접선을 사용하여 호를 만듭니다
startPoint: 호의 시작점
endPoint: 호의 끝점
startTangent: 시작 접선 방향 벡터
arc,tangent,arcs