Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
입력 점을 중심으로 지정된 폭, 길이, 높이의 직육면체를 만듭니다.
origin: 원점
width: 직육면체의 폭
length: 직육면체의 길이
height: 직육면체의 높이
Returns: 길이로 작성된 직육면체
box,cube,cubebysize,bycenter,cubes