Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
회전의 솔리드를 만들고, 시작 각도(도)에서 스윕 각도(도)까지 원점에 의해 형성된 광선 축과 벡터 축 주위로 종단 곡선을 스윕합니다.
profile: 회전할 종단 곡선
axisOrigin: 회전 축 원점
axisDirection: 회전 축 방향
startAngle: 시작 각도(도)
sweepAngle: 스윕 각도(도)
Returns: 회전에 의해 작성된 솔리드
Brep,brep,lathe,revolveprofile