Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
벡터 법선에 원점을 두고 특정한 X축 방향으로 "방향이 지정된" 평면을 만듭니다. 분할, 교차, 투영 등의 작업에 영향을 미치지 않으며 입력 CoordinateSystem의 방향만을 지정합니다.
origin: 평면의 원점
normal: 법선 방향 벡터
xAxis: X축 방향 벡터
Returns: 원점 법선 및 X축을 기준으로 한 평면

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
입력 선 및 외부 점이 포함된 평면을 만듭니다. 점은 선 또는 선 축에 놓을 수 없습니다.
line: 평면을 결정하는 데 사용되는 선
point: 평면을 결정하는 데 사용되는 점
Returns: 선 및 점에서 작성된 평면
lines
0.4