Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
WCS XY 평면에 WCS 원점을 중심으로 지정된 폭(X축 길이)과 길이(Y축 길이)를 사용하여 직사각형을 작성합니다.
width: 직사각형의 폭
length: 직사각형의 길이
Returns: 폭 및 길이로 작성된 직사각형
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
입력 평면 루트를 중심으로 입력 폭(평면 X축 길이)과 길이(평면 Y축 길이)를 사용하여 직사각형을 작성합니다.
plane: 직사각형을 중앙에 놓는 데 사용되는 평면
width: 직사각형의 폭
length: 직사각형의 길이
Returns: 폭 및 길이로 작성된 직사각형
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
좌표 시스템 XY 평면에 입력 원점을 중심으로 지정된 폭(X축 길이)과 길이(Y축 길이)를 사용하여 직사각형을 작성합니다.
coordinateSystem: 직사각형의 좌표계(직사각형의 중심)
width: 직사각형의 폭
length: 직사각형의 길이
Returns: 폭 및 길이에서 작성된 직사각형
rectbylengths