Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
TSpline 표면을 모양에 따라 솔리드 또는 표면으로 변환합니다.
주: 이 경우 표면 복사본이 Dynamo 버전으로 다운그레이드되고 변환에 사용되므로 입력 표면이 Dynamo에 로드된 버전보다 더 높은 T-Spline 버전에서 작성될 경우 결과 B-Rep가 예기치 않게 약간 변경될 수 있습니다.
matchTopology: 결과 본체에 입력 TSpline 표면과 같은 위상이 있는지 확인합니다.
Returns: 위상 도면요소(솔리드 또는 표면)
tspline,brep,solid,surface