Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
3개의 유클리드 좌표로 벡터 형성
x: X 좌표
y: Y 좌표
z: Z 좌표
Returns: 좌표로 작성된 벡터
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
3개의 유클리드 좌표로 벡터를 형성하고 벡터 정규화
x: X 좌표
y: Y 좌표
z: Z 좌표
normalized: 벡터를 정규화하려면 True, 정규화하지 않으려면 false
Returns: 좌표로 작성된 벡터
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
두 벡터의 내적 형성
vec: 두 번째 벡터
Returns: 결과 내적
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
두 벡터가 평행한지 여부를 확인합니다.
otherVector: 기타 벡터
Returns: 벡터가 평행하면 True를 반환하고, 그렇지 않으면 False를 반환합니다.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
두 벡터가 거의 같은지 확인합니다. 정밀도 문제를 처리하기 위해 1e-5의 공차 값이 지정됩니다.
otherVector: 기타 벡터
Returns: 벡터가 거의 같으면 True를 반환하고, 그렇지 않으면 False를 반환합니다.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
이 벡터를 입력 CoordinateSystem 매트릭스로 변환합니다.
coordinateSystem: 벡터를 변환하는 데 사용되는 좌표계
Returns: 변환된 벡터

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
벡터를 축 주위로 지정된 각도만큼 회전합니다
axis: 회전 축 벡터
degrees: 회전할 각도
Returns: 회전된 벡터
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
벡터를 평면 원점 및 법선 주위로 지정된 각도만큼 회전합니다
plane: 회전 평면
degrees: 회전할 각도
Returns: 회전된 벡터
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
원점 주위로 벡터 축척을 균일하게 조정
scale_factor: 축척 비율
Returns: 축척 조정된 벡터
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
두 벡터 사이의 각도를 0~360도로 반환합니다. 회전 축을 사용하여 각도 방향을 결정합니다.
otherVector: 기타 벡터
rotationAxis: 회전 축
Returns: 제공된 벡터 사이의 각도를 0에서 360도 단위로 반환합니다.
rotation angle,