Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
입력 점을 중심으로 WCS XY 평면과 일치하도록 지정된 X 및 Y축 반지름을 사용하여 타원을 만듭니다.
origin: 타원의 원점
xAxisRadius: X축 반지름
yAxisRadius: Y축 반지름
Returns: 원점과 반지름으로 작성된 타원
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
입력 점을 중심으로 지정된 두 개의 축을 사용하여 타원을 만듭니다. 축은 서로 90도를 이뤄야 합니다.
origin: 타원의 원점
xAxisRadius: X축 반지름
yAxisRadius: Y축 반지름
Returns: 원점 벡터에서 작성된 타원
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
입력 CoordinateSystem을 중심으로 입력 CoordinateSystem과 일치하도록 CS X 방향의 x_radius 반지름 및 CS Y 방향의 y_radius 반지름을 사용하여 타원을 만듭니다.
origin: 타원의 원점 좌표계
xAxisRadius: X축 반지름
yAxisRadius: Y축 반지름
Returns: 좌표계 및 반지름으로 작성된 타원
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
입력 평면을 중심으로 입력 평면과 일치하도록 평면 X축 방향의 x_radius 반지름 및 평면 Y축 방향의 y_radius 반지름을 사용하여 타원을 만듭니다.
plane: 타원 호가 그려지는 평면
xAxisRadius: X축 반지름
yAxisRadius: Y축 반지름
Returns: 평면 및 반지름에서 작성된 타원
ellipse,aligned ellipse,ellipsebylengths