Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
입력 횡단면 곡선 사이에서 로프트하여 표면을 만듭니다.
crossSections: 로프트할 곡선
Returns: 로프트로 작성된 표면
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
지정된 안내 곡선(난간이라고도 함)을 사용하여 횡단면을 통해 표면을 로프트합니다. 안내 곡선은 모든 횡단면 곡선과 교차해야 합니다.
crossSections: 로프트할 곡선
guideCurves: 로프트를 안내하는 곡선
Returns: 로프트로 작성된 표면
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
경로를 따라 횡단면 곡선을 스윕하여 표면을 만듭니다.
profile: 스윕할 곡선
path: 스윕에 사용된 경로 곡선
Returns: 경로를 따라 프로파일을 스윕하여 작성된 표면
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
닫힌 다각형의 입력 점을 연결하고 패칭하는 다각형 표면을 만듭니다.
points: 둘레 점 리스트
Returns: 둘레 점에서 작성된 표면
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
원점에 의해 형성된 광선 축 주위로 종단 곡선을 벡터 축 방향으로 스윕(start_angle(도)에서 시작하고, sweep_angle(도) 스윕)하여 표면을 만듭니다.
profile: 회전할 종단 곡선
axisOrigin: 회전 축 원점
axisDirection: 회전 축 방향
startAngle: 시작 각도(도)
sweepAngle: 스윕 각도(도)
Returns: 프로파일을 회전하여 만든 표면
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
입력 곡선에 의해 정의된 닫힌 경계의 내부를 채워 표면을 만듭니다.
closedCurve: 서피스 경계로 사용된 닫힌 곡선
Returns: 패치로 작성된 표면
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
지정된 공차 내에서 표면의 Nurbs 표현을 가져옵니다. 이 방법은 특정 상황에서 표면과 거의 비슷할 수도 있습니다.
tolerance: 지정된 공차
Returns: 표면의 Nurbs 표면 표현
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
표면을 두껍게 하여 솔리드로 만들고, 표면의 양쪽에서 표면 법선 방향으로 돌출합니다.
thickness: 두껍게 할 양
Returns: 솔리드로 두껍게 한 표면
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
표면을 두껍게 하여 솔리드로 만들고 표면 법선 방향으로 돌출합니다. both_sides 매개변수가 true인 경우 표면이 양쪽에서 두꺼워집니다.
thickness: 두껍게 할 양
both_sides: 양쪽에서 두껍게 하려면 True, 한쪽에서 두껍게 하려면 False
Returns: 솔리드로 두껍게 한 표면
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
반환된 좌표계에서는 xAxis, yAxis 및 zAxis를 사용하여 uDir, vDir 및 법선을 표현합니다. xAxis, yAxis의 길이가 곡률을 나타냅니다.
u: 매개변수의 U 구성요소
v: 매개변수의 V 구성요소
Returns: 표면의 UV 위치에서 법선, U 방향 및 V 방향을 기준으로 한 좌표계

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
법선이 반전된 새 표면을 반환합니다. 이 표면은 변경되지 않습니다.
Returns: 입력 표면과 동일하지만 반전된 법선이 있는 표면