Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
두 BoundingBox의 교차점 가져오기
other: 교차할 다른 경계 상자
Returns: 경계 상자의 교차점에서 가져온 경계 상자

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
두 BoundingBox가 교차하는지 여부 확인
other: 기타 경계 상자
Returns: 경계 상자가 교차함
get overlap