Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
명시적 제어점을 사용하여 BSplineCurve를 만듭니다. 주 1: deg=1인 BSplineCurve에는 G1 불연속성이 있는데 이것은 돌출, 스윕 및 기타 작업에 문제를 일으키므로 사용을 피해야 합니다. 대신 PolyCurve를 사용하십시오.  주 2: 곡선이 주기적(닫힘)이면 첫 번째 점과 마지막 점이 동일해야 합니다.
points: NURBS 곡선의 점
Returns: 점에서 작성된 Nurbscurve
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
명시적 제어점을 사용하여 BSplineCurve를 만듭니다. 주 1: deg=1인 BSplineCurve에는 G1 불연속성이 있는데 이것은 돌출, 스윕 및 기타 작업에 문제를 일으키므로 사용을 피해야 합니다. 대신 PolyCurve를 사용하십시오.  주 2: 곡선이 주기적(닫힘)이면 첫 번째 점과 마지막 점이 동일해야 합니다.
points: NURBS 곡선의 점
degree: 곡선의 각도
Returns: 점에서 작성된 Nurbscurve
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
명시적 제어점을 사용하여 BSplineCurve를 만듭니다. 주 1: deg=1인 BSplineCurve에는 G1 불연속성이 있는데 이것은 돌출, 스윕 및 기타 작업에 문제를 일으키므로 사용을 피해야 합니다. 대신 PolyCurve를 사용하십시오.  주 2: 곡선이 주기적(닫힘)이면 첫 번째 점과 마지막 점이 동일해야 합니다.
points: NURBS 곡선의 점
degree: 곡선의 각도
closeCurve: 곡선 닫기로 전환
Returns: 점에서 작성된 Nurbscurve
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
점 사이를 보간하여 BSplineCurve를 만듭니다. 주 2: 곡선이 주기적인(닫힌) 경우 첫 번째와 마지막 점이 같아야 합니다.
points: NURBS 곡선의 점
closeCurve: 곡선 닫기로 전환
Returns: 점에서 작성된 Nurbscurve
fit,approximate,spline,lines
0.5,0.5,0.5,0.45