Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
지정된 보간 점과 U 및 V 각도를 사용하여 NurbsSurface를 만듭니다. 결과 표면은 모든 점을 통과합니다.
points: Nurbs 표면의 점 그리드
uDegree: U 방향의 각도
vDegree: V 방향의 각도
Returns: 점으로 작성된 Nurbs 표면
fit,topoints