Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
표준 XY 평면의 입력 중심점과 반지름을 사용하고 표준 Z을 법선으로 사용하여 원을 만듭니다.
centerPoint: 원의 중심점
radius: 반지름
Returns: 중심점 및 반지름으로 작성된 원
circle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
입력 평면 원점(루트)을 중심으로 지정된 반지름을 사용하여 입력 평면에 원을 만듭니다.
plane: 중심 원에 사용된 평면의 루트
radius: 반지름
Returns: 평면 및 반지름으로 작성된 원
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
세 개의 입력 점을 통과하는 원을 만듭니다.
p1: 원의 첫 번째 점
p2: 원의 두 번째 점
p3: 원의 세 번째 점
circle