Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
입력 곡선의 매개변수 점에서 입력 곡선에 접하는 선을 만듭니다.
curve: 접선의 기준 곡선
parameter: 매개변수 값
Returns: 접선
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
시작점에서 시작하여 벡터 방향으로 지정된 길이만큼 연장되는 직선을 만듭니다.
startPoint: 선 시작점
direction: 방향 벡터
length: 선의 길이
Returns: 시작 방향 및 길이에서의 선
linebyvector,lines