Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
나선을 만듭니다. 나선은 항상 제공된 축 주위를 시계 방향으로 회전합니다. 축 방향을 따라 표시되는 경우 뷰어는 점이 매개변수가 증가하는 방향으로 곡선을 따라 이동함에 따라 축 주위를 시계 방향으로 회전하는 점을 보게 됩니다. 피치는 한 번 회전할 때마다 나선이 축 방향으로 이동하는 거리입니다. 피치는 양수 또는 음수입니다.
axisPoint: 축 점
axisDirection: 축 방향 벡터
startPoint: 나선 시작점
pitch: 축 방향으로 360도당 나선의 거리
angleTurns: 회전 수(도)
Returns: 축으로 작성된 나선
helix,screw,corkscrew,thread