Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
연결된 곡선을 그룹화하여 하나 이상의 polycurve를 만듭니다. 1e-6과 1e-3 단위 사이의 기본 결합 공차를 선택하십시오.
curves: 하나 이상의 PolyCurves를 만들기 위해 함께 그룹화할 곡선
joinTolerance: 결합할 곡선 간에 허용되는 간격 크기를 결정하는 공차

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
해당 평면에서 polycurve를 모깎기합니다.
radius: 모깎기 반지름
rightSide: PolyCurve의 시작에 대해 상대적으로 오른쪽 측면에서 모깎기를 하려면 True, 왼쪽에서 모깎기를 하려면 false
Returns: 모깎기한 Polycurve
round,smooth,radius