Repository: HNANmal/mQ
Catalog: DynamoCoreRuntime_2.13.1.3887/libg_locale/*/LC_MESSAGES/libg.po
Languages: de_de, ja_jp

source: Failed to initialize a T-Spline Pipe.
de_de: Initialisieren einer T-Spline-Pipe fehlgeschlagen.
ja_jp: T スプライン パイプの初期化に失敗しました。

source: Failed to build a T-Spline Pipe.
de_de: Erstellen einer T-Spline-Pipe fehlgeschlagen.
ja_jp: T スプライン パイプの構築に失敗しました。

source: Radius spans should be greater or equal to 3
de_de: Radiusfelder müssen größer als oder gleich 3 sein
ja_jp: 半径スパンの数は 3 以上である必要があります

source: Either radial or axial symmetry is allowed, but not both
de_de: Radiale oder axiale Symmetrie ist zulässig, nicht jedoch beide
ja_jp: 放射対称と軸対称のいずれかを指定できますが、両方を指定することはできません

source: Radius spans should be greater than or equal to 4 when X or Y symmetry is selected
de_de: Radiusfelder müssen größer als oder gleich 4 sein, wenn x- oder y-Symmetrie ausgewählt ist
ja_jp: X 対称または Y 対称を選択した場合、半径スパンの数は 4 以上である必要があります

source: Radius spans should be multiple of 4 when X and Y symmetry is selected
de_de: Radiusfelder müssen ein Vielfaches von 4 sein, wenn x- und y-Symmetrie ausgewählt ist
ja_jp: X 対称と Y 対称を選択した場合、半径スパンの数は 4 の倍数である必要があります

source: Faces per span must be greater than or equal to 1 when radial symmetry is selected
de_de: Flächen pro Feld müssen größer als oder gleich 1 sein, wenn radiale Symmetrie ausgewählt ist
ja_jp: 放射対称を選択した場合、スパンごとの面の数は 1 以上である必要があります

source: T-Spline revolving curve failed
de_de: T-Spline-Rotationskurve fehlgeschlagen
ja_jp: T スプラインの回転曲線が失敗しました

source: Faces valence must be greater than 0.
de_de: Wertigkeit der Flächen muss größer als 0 sein.
ja_jp: 面の価数は 0 より大きい値である必要があります。

source: Snapping tolerance must be greater than 0.
de_de: Fangtoleranz muss größer als 0 sein.
ja_jp: スナップの許容値は 0 より大きい値である必要があります。

source: Failed to construct a TSpline surface from the given lines
de_de: Konstruieren einer T-Spline-Oberfläche aus gegebenen Linien fehlgeschlagen
ja_jp: 指定した線分からの T スプライン サーフェスの作成に失敗しました

source: Edge can't be creased:
de_de: Kante kann nicht geknickt werden:
ja_jp: エッジに折り目を付けることができません:

source: Edge can't be uncreased:
de_de: Knicken der Kante kann nicht aufgehoben werden:
ja_jp: エッジの折り目を解除できません:

source: Vertex can't be creased:
de_de: Scheitelpunkt kann nicht geknickt werden:
ja_jp: 頂点に折り目を付けることができません:

source: Vertex can't be uncreased:
de_de: Scheitelpunkt-Knick kann nicht aufgehoben werden:
ja_jp: 頂点の折り目を解除できません:

source: Crease unsuccessful
de_de: Knicken fehlgeschlagen
ja_jp: 折り目処理に失敗しました

source: Weld unsuccessfull
de_de: Verschweißen fehlgeschlagen
ja_jp: 連結処理に失敗しました

source: Unweld unsuccessfull
de_de: Schweißung aufheben fehlgeschlagen
ja_jp: 連結の解除に失敗しました

source: Failed to thicken TSpline surface
de_de: Fehler beim Verdicken von TSpline-Oberfläche
ja_jp: T スプライン サーフェスを厚くすることに失敗しました

source: The given edges are empty
de_de: Die angegebenen Kanten sind leer
ja_jp: 指定したエッジは空です

source: Failed to initialize the match
de_de: Abgleich konnte nicht initialisiert werden
ja_jp: 一致の初期化に失敗しました

source: Failed to get the aligned edges
de_de: Fehler beim Abrufen der ausgerichteten Kanten
ja_jp: 位置合わせされたエッジの取得に失敗しました

source: Failed to convert ASM curves to T-Spline NURBS curve interfaces
de_de: Fehler beim Konvertieren von ASM-Kurven in T-Spline-NURBS-Kurvenschnittstellen
ja_jp: ASM 曲線の T スプライン NURBS 曲線インタフェースへの変換に失敗しました

source: Failed to construct poly-curve interfaces from the T-Spline NURBS curve interfaces
de_de: Fehler beim Erstellen von Polykurvenschnittstellen aus T-Spline-NURBS-Kurvenschnittstellen
ja_jp: T スプライン NURBS 曲線インタフェースからのポリカーブ インタフェースの作成に失敗しました

source: Failed to set a propagation width
de_de: Ausbreitungsbreite konnte nicht festgelegt werden
ja_jp: 伝播の幅を設定できませんでした

source: Unknown contituity
de_de: Unbekannte Kontinuität
ja_jp: 不明な連続性

source: Failed to add a constraint for the match
de_de: Fehler beim Hinzufügen einer Abhängigkeit für den Abgleich
ja_jp: 一致のための拘束の追加に失敗しました

source: Failed to scale the derivatives for continuity for the given constraint
de_de: Fehler beim Skalieren der Ableitungen für Kontinuität der gegebenen Abhängigkeit
ja_jp: 指定した拘束の連続性に対する導関数のスケールに失敗しました

source: Failed to flip the constraint orientation
de_de: Fehler beim Umkehren der Abhängigkeitsausrichtung
ja_jp: 拘束方向の反転に失敗しました

source: Failed to perform the match
de_de: Fehler beim Durchführen des Abgleichs
ja_jp: 一致の実行に失敗しました

source: T-Spline Surface requires spans to be greater or equal to 1
de_de: Felder für T-Spline-Oberfläche müssen größer als oder gleich 1 sein
ja_jp: T スプライン サーフェスでは、スパンの数が 1 以上である必要があります

source: Failed to extrude TSpline edges
de_de: TSpline-Kanten konnten nicht extrudiert werden
ja_jp: T スプライン エッジの押し出しに失敗しました

source: Failed to extrude TSpline faces
de_de: TSpline-Oberflächen konnten nicht extrudiert werden
ja_jp: T スプライン面の押し出しに失敗しました

source: Subdivision failed.
de_de: Unterteilung fehlgeschlagen.
ja_jp: 再分割に失敗しました。

source: Unable to build body from T-Spline
de_de: Körper kann nicht aus T-Spline erstellt werden
ja_jp: T スプラインからボディを作成できません

source: Ouptut t-spline is invalid.
de_de: Ausgegebener T-Spline ist ungültig.
ja_jp: 出力 T スプラインは無効です。

source: Point list should contain 4 points.
de_de: Punktliste muss 4 Punkte enthalten.
ja_jp: 点リストには 4 つの点が含まれている必要があります。

source: Failed to build Sphere by four points.
de_de: Kugel durch vier Punkte konnte nicht erstellt werden.
ja_jp: 4 つの点を使用して球体を作成することができませんでした。

source: Point list should contain more than 3 points.
de_de: Punktliste muss mehr als 3 Punkte enthalten.
ja_jp: 点リストには 4 つ以上の点が含まれている必要があります。

source: Failed to fit T-Spline Sphere.
de_de: T-Spline-Kugel konnte nicht eingepasst werden.
ja_jp: T スプラインの球体の適合に失敗しました。

source: Each span should be greater than or equal to 1
de_de: Jedes Feld muss größer als oder gleich 1 sein
ja_jp: 各スパンの数は 1 以上である必要があります

source: Each span should be less than or equal to 256
de_de: Jedes Feld muss kleiner als oder gleich 256 sein
ja_jp: 各スパンの数は 256 以下である必要があります

source: X spans should be greater than or equal to 2 if X axis symmetry is selected
de_de: X-Felder müssen größer als oder gleich 2 sein, wenn x-Achsensymmetrie ausgewählt ist
ja_jp: X 軸対称を選択した場合、X スパンの数は 2 以上である必要があります

source: Y spans should be greater than or equal to 2 if Y axis symmetry is selected
de_de: Y-Felder müssen größer als oder gleich 2 sein, wenn y-Achsensymmetrie ausgewählt ist
ja_jp: Y 軸対称を選択した場合、Y スパンの数は 2 以上である必要があります

source: Plane has invalid normal
de_de: Fläche hat ungültige Normale
ja_jp: 面に無効な法線が含まれています

source: X or Y coordinates of corners are coincedent
de_de: X- und Y-Koordinaten der Ecken fallen zusammen
ja_jp: コーナーの X 座標 または Y 座標が重複しています

source: T-Spline Surface Plane creation failed
de_de: Ebene für T-Spline-Oberfläche konnte nicht erstellt werden
ja_jp: T スプライン サーフェスの平面の作成に失敗しました

source: Radius should be greater than or equal to 1e-3
de_de: Radius muss größer als oder gleich 1e-3 sein
ja_jp: 半径は 1e-3 以上でなければなりません

source: Radius should be less than or equal to 1e8
de_de: Radius muss kleiner als oder gleich 1e8 sein
ja_jp: 半径は 1e8 以下でなければなりません

source: Height should be greater than or equal to 1e-3
de_de: Höhe muss größer als oder gleich 1e-3 sein
ja_jp: 高さは 1e-3 以上でなければなりません

source: Height should be less than or equal to 1e8
de_de: Höhe muss kleiner oder gleich 1e8 sein
ja_jp: 高さは 1e8 以下でなければなりません

source: Height spans should be greater or equal to 1
de_de: Höhenfelder müssen größer als oder gleich 1 sein
ja_jp: 高さスパンの数は 1 以上である必要があります

source: Coordinate system has zero axis
de_de: Koordinatensystem hat Nullachse
ja_jp: 座標系にゼロ軸があります

source: Height spans should be greater than or equal to 2 when Z symmetry is selected
de_de: Höhenfelder müssen größer als oder gleich 2 sein, wenn z-Symmetrie ausgewählt ist
ja_jp: Z 対称を選択した場合、高さスパンの数は 2 以上である必要があります

source: Radius spans should be less than or equal to 256 when radial symmetry is not selected
de_de: Radiusfelder müssen kleiner als oder gleich 256 sein, wenn radiale Symmetrie nicht ausgewählt ist
ja_jp: 放射対称を選択しない場合、半径スパンの数は 256 以下である必要があります

source: Height spans should be less than or equal to 256 when radial symmetry is not selected
de_de: Höhenfelder müssen kleiner als oder gleich 256 sein, wenn radiale Symmetrie nicht ausgewählt ist
ja_jp: 放射対称を選択しない場合、高さスパンの数は 256 以下である必要があります

source: Radius spans should be less than or equal to 64 when radial symmetry is selected
de_de: Radiusfelder müssen kleiner als oder gleich 64 sein, wenn radiale Symmetrie ausgewählt ist
ja_jp: 放射対称を選択した場合、半径スパンの数は 64 以下である必要があります

source: Height spans should be less than or equal to 64 when radial symmetry is selected
de_de: Höhenfelder müssen kleiner als oder gleich 64 sein, wenn radiale Symmetrie ausgewählt ist
ja_jp: 放射対称を選択した場合、高さスパンの数は 64 以下である必要があります

source: Faces per span must be less than or equal to 16 when radial symmetry is selected
de_de: Flächen pro Feld müssen kleiner als oder gleich 16 sein, wenn radiale Symmetrie ausgewählt ist
ja_jp: 放射対称を選択した場合、スパンごとの面の数は 16 以下である必要があります

source: T-Spline Surface Cylinder creation failed
de_de: Zylindrische T-Spline-Oberfläche konnte nicht erstellt werden
ja_jp: T スプライン サーフェスの円柱の作成に失敗しました

source: Both radii cannot be zero
de_de: Beide Radien dürfen nicht Null sein
ja_jp: 両方の半径をゼロにすることはできません

source: Failed to create cone
de_de: Kegel konnte nicht erstellt werden
ja_jp: 円錐を作成できませんでした

source: Height spans should be greater or equal to 2
de_de: Höhenfelder müssen größer als oder gleich 2 sein
ja_jp: 高さスパンの数は 2 以上である必要があります

source: T-Spline Surface Sphere creation failed
de_de: Kugelförmige T-Spline-Oberfläche konnte nicht erstellt werden
ja_jp: T スプライン サーフェスの球体の作成に失敗しました

source: Inner radius should be greater than or equal to 1e-3
de_de: Innenradius muss größer als oder gleich 1e-3 sein
ja_jp: 内径は 1e-3 以上でなければなりません

source: Inner radius should be less than or equal to 1e8
de_de: Innenradius muss kleiner als oder gleich 1e8 sein
ja_jp: 内径は 1e8 以下でなければなりません

source: Outer radius should be greater than or equal to 1e-3
de_de: Außenradius muss größer als oder gleich 1e-3 sein
ja_jp: 外径は 1e-3 以上でなければなりません

source: Outer radius should be less than or equal to 1e8
de_de: Außenradius muss kleiner als oder gleich 1e8 sein
ja_jp: 外径は 1e8 以下でなければなりません

source: Inner and outer radius spans should be greater or equal to 3
de_de: Die inneren und äußeren Radiusfelder müssen größer als oder gleich 3 sein
ja_jp: 内径スパンと外径スパンの数は 3 以上である必要があります

source: Inner and outer radius spans should be greater or equal to 4 if any axial symmetry is selected
de_de: Die inneren und äußeren Radiusfelder müssen größer als oder gleich 4 sein, wenn eine axiale Symmetrie ausgewählt ist
ja_jp: 軸対称を選択した場合、内径スパンと外径スパンの数は 4 以上である必要があります

source: Outer radius spans should be multiple of 4 when X and Y symmetry is selected
de_de: Äußere Radiusfelder müssen ein Vielfaches von 4 sein, wenn x- und y-Symmetrie ausgewählt ist
ja_jp: X および Y 対称を選択した場合、外側の半径スパンの数は 4 の倍数である必要があります

source: Inner radius spans should be less than or equal to 256 when radial symmetry is not selected
de_de: Innenradiusfelder müssen kleiner als oder gleich 256 sein, wenn radiale Symmetrie nicht ausgewählt ist
ja_jp: 放射対称を選択しない場合、内径スパンの数は 256 以下である必要があります

source: Outer radius spans should be less than or equal to 256 when radial symmetry is not selected
de_de: Außenradiusfelder müssen kleiner als oder gleich 256 sein, wenn radiale Symmetrie nicht ausgewählt ist
ja_jp: 放射対称を選択しない場合、外径スパンの数は 256 以下である必要があります

source: Inner radius spans should be less than or equal to 64 when radial symmetry is selected
de_de: Innenradiusfelder müssen kleiner als oder gleich 64 sein, wenn radiale Symmetrie ausgewählt ist
ja_jp: 放射対称を選択した場合、内径スパンの数は 64 以下である必要があります

source: Outer radius spans should be less than or equal to 64 when radial symmetry is selected
de_de: Außenradiusfelder müssen kleiner als oder gleich 64 sein, wenn radiale Symmetrie ausgewählt ist
ja_jp: 放射対称を選択した場合、外径スパンの数は 64 以下である必要があります

source: T-Spline Surface Torus creation failed
de_de: Torische T-Spline-Oberfläche konnte nicht erstellt werden
ja_jp: T スプライン サーフェスのトーラスの作成に失敗しました

source: Each span should be less than or equal to 128
de_de: Jedes Feld muss kleiner als oder gleich 128 sein
ja_jp: 各スパンの数は 128 以下である必要があります

source: Zero dimensions are not allowed
de_de: Nullmaße sind nicht zulässig
ja_jp: 寸法をゼロにすることはできません

source: T-Spline Surface Box creation failed
de_de: Quaderförmige T-Spline-Oberfläche konnte nicht erstellt werden.
ja_jp: T スプライン サーフェスのボックスの作成に失敗しました

source: Spans should be less than or equal to 32
de_de: Felder müssen kleiner als oder gleich 32 sein
ja_jp: スパンの数は 32 以下である必要があります

source: T-Spline Surface Quadball creation failed
de_de: Quadball-T-Spline-Oberfläche konnte nicht erstellt werden.
ja_jp: T スプライン サーフェスのクワッドボールの作成に失敗しました

source: Cannot construct FACE from surface
de_de: FACE kann nicht aus Oberfläche erstellt werden
ja_jp: サーフェスから面を作成できません

source: Cannot get bounding box from FACE
de_de: Begrenzungsrahmen von FACE kann nicht abgerufen werden
ja_jp: 面から境界ボックスを取得できません

source: The input surface must have finite parameter ranges
de_de: Für die eingegebene Oberfläche sind finite Parameterbereiche erforderlich
ja_jp: 入力サーフェスのパラメータ範囲には制限があります

source: Impossible to refit given surface
de_de: Angegebene Oberfläche kann nicht erneut angepasst werden
ja_jp: 指定されたサーフェスを再フィットできません

source: Knots is not match control vertices
de_de: Knoten stimmt nicht mit Steuerscheitelpunkten überein
ja_jp: ノットが制御点と一致していません

source: Failed to create ASM B-Spline curve
de_de: Fehler beim Erstellen von ASM-B-Spline-Kurve
ja_jp: ASM B スプライン曲線の作成に失敗しました

source: Failed to convert Nurbs curve
de_de: Fehler beim Konvertieren einer NURBS-Kurve
ja_jp: NURBS 曲線の変換に失敗しました

source: Failed to convert Nurbs surface
de_de: Fehler beim Konvertieren einer NURBS-Oberfläche
ja_jp: NURBS サーフェスの変換に失敗しました

source: Unable to set T-Spline for conversion
de_de: T-Spline für Konvertierung kann nicht eingestellt werden
ja_jp: T スプラインを変換用に設定できません

source: Impossible to get face from surface
de_de: Fläche kann nicht aus Oberfläche abgerufen werden
ja_jp: サーフェスから面を取得できません

source: Impossible to get edges from face
de_de: Kanten können nicht aus Fläche abgerufen werden
ja_jp: 面からエッジを取得できません

source: Impossible to get curve from edge
de_de: Kurve kann nicht aus Kante abgerufen werden
ja_jp: エッジから曲線を取得できません

source: Cast Coedge is not a TSplineCoedge
de_de: Gemeinsame Kante für Umwandlung ist keine TSplineCoedge
ja_jp: 投影された共有エッジが T スプライン共有エッジではありません

source: Cast Edge is not a TSplineEdge
de_de: Kante für Umwandlung ist keine TSplineEdge
ja_jp: 投影されたエッジが T スプライン エッジではありません

source: Cast object is not a TSplineEdge
de_de: Objekt für Umwandlung ist keine TSplineEdge
ja_jp: 投影されたオブジェクトが T スプライン エッジではありません

source: Edge has invalid parent
de_de: Kante hat ungültiges übergeordnetes Element
ja_jp: エッジに無効な親が含まれています

source: Edge index is invalid
de_de: Kantenindex ist ungültig
ja_jp: エッジのインデックスが無効です

source: Cast Face is not a TSplineFace
de_de: Fläche für Umwandlung ist keine TSplineFace
ja_jp: 投影された面が T スプライン面ではありません

source: Cast object is not a TSplineFace
de_de: Objekt für Umwandlung ist keine TSplineFace
ja_jp: 投影されたオブジェクトが T スプライン面ではありません

source: Face has invalid parent
de_de: Fläche hat ungültiges übergeordnetes Element
ja_jp: 面に無効な親が含まれています

source: Could not get bezier patches from the given TSplineFace
de_de: Es konnten keine Bezier-Patches aus der gegebenen TSplineFace abgerufen werden
ja_jp: 指定した T スプライン面からベジェ パッチを取得できませんでした

source: Surface creation error.
de_de: Fehler beim Erstellen von Oberfläche.
ja_jp: サーフェスの作成でエラーが発生しました。

source: Face index is invalid
de_de: Flächenindex ist ungültig
ja_jp: 面のインデックスが無効です

source: Cast Loop is not a TSplineLoop
de_de: Kontur für Umwandlung ist keine TSplineLoop
ja_jp: 投影されたループが T スプライン ループではありません

source: Cast object is not a TSplineTopology
de_de: Objekt für Umwandlung ist keine TSplineTopology
ja_jp: 投影されたオブジェクトが T スプライン トポロジではありません

source: Vertex with given index is not present on the t-spline
de_de: Scheitelpunkt mit angegebenem Index ist nicht auf T-Spline vorhanden
ja_jp: 指定されたインデックスを持つ頂点が T スプライン上に存在しません

source: Edge with given index is not present on the t-spline
de_de: Kante mit angegebenem Index ist nicht auf T-Spline vorhanden
ja_jp: 指定されたインデックスを持つエッジが T スプライン上に存在しません

source: Face with given index is not present on the t-spline
de_de: Fläche mit angegebenem Index ist nicht auf T-Spline vorhanden
ja_jp: 指定されたインデックスを持つ面が T スプライン上に存在しません

source: Invalid topology index
de_de: Ungültiger Topologieindex
ja_jp: トポロジ インデックスが無効です

source: Cast Vertex is not a TSplineVertex
de_de: Scheitelpunkt für Umwandlung ist kein TSplineVertex
ja_jp: 投影された頂点が T スプライン頂点ではありません

source: Cast object is not a TSplineVertex
de_de: Objekt für Umwandlung ist kein TSplineVertex
ja_jp: 投影されたオブジェクトが T スプライン頂点ではありません

source: Vertex has invalid parent
de_de: Scheitelpunkt hat ungültiges übergeordnetes Element
ja_jp: 頂点に無効な親が含まれています

source: Vertex index is invalid
de_de: Scheitelpunktindex ist ungültig
ja_jp: 頂点のインデックスが無効です

source: Unable to write entity list as sat
de_de: Objektliste konnte nicht als SAT geschrieben werden
ja_jp: エンティティ リストを SAT として書き込むことができません

source: Unable to open file
de_de: Datei kann nicht geöffnet werden
ja_jp: ファイルを開くことができません

source: Unable to restore entities
de_de: Objekte können nicht wiederhergestellt werden
ja_jp: 図形を復元できません

source: Failed to create geometry from solid def JSON
de_de: Erstellen von Geometrie aus einer Volumenkörperdef.-JSON fehlgeschlagen
ja_jp: Solid Def JSON 形式からジオメトリを作成できませんでした

source: Unable to get units
de_de: Einheiten können nicht abgerufen werden
ja_jp: 単位を取得できません

source: Unable to delete entity
de_de: Objekt kann nicht gelöscht werden
ja_jp: 図形を削除できません

source: Error in SMI_COPY.copy
de_de: Fehler in SMI_COPY.copy
ja_jp: SMI_COPY.copy にエラーがあります

source: Unable to get param range for FACE while faceting
de_de: Fehler beim Abrufen des Parameterbereichs für FACE beim Facettieren
ja_jp: ファセットの作成中に FACE のパラメータ範囲を取得できません

source: Could not get bounding box
de_de: Begrenzungsrahmen konnte nicht abgerufen werden
ja_jp: 境界ボックスを取得できませんでした

source: Too small to facet
de_de: Zu klein zum Facettieren
ja_jp: 小さすぎてファセットを作成できません

source: Could not set facet edge count
de_de: Anzahl der Facettenkanten konnte nicht festgelegt werden.
ja_jp: ファセットのエッジの数を設定できませんでした

source: Could not set facet tolerance
de_de: Facettentoleranz konnte nicht festgelegt werden
ja_jp: ファセットの許容値を設定できませんでした

source: Could not set max number of grid lines
de_de: Max. Anzahl Rasterlinien konnte nicht festgelegt werden.
ja_jp: 通芯の最大数を設定できませんでした

source: Could not compute facets
de_de: Facetten konnten nicht berechnet werden.
ja_jp: ファセットを計算できませんでした

source: Could not get face results
de_de: Ergebnisse für Fläche konnten nicht abgerufen werden
ja_jp: 面の結果を取得できませんでした
