Repository: HNANmal/mQ
Catalog: DynamoCoreRuntime_2.13.1.3887/libg_locale/*/LC_MESSAGES/libg.po
Languages: de_de, ja_jp

source: Surfaces could not be joined into a closed Solid!
de_de: Surfaces konnten nicht zu einem geschlossenen Solid verbunden werden.
ja_jp: 閉じたソリッドにサーフェスを結合できませんでした。

source: Surfaces could not be joined into a closed Solid, even with refinement!
de_de: Surfaces konnten auch mit Präzisierung nicht zu einem geschlossenen Solid verbunden werden.
ja_jp: 改善されたにもかかわらず、閉じたソリッドにサーフェスを結合できませんでした。

source: Profile Curve must be closed
de_de: Profilkurve muss geschlossen sein
ja_jp: プロファイル曲線を閉じる必要があります

source: Unable set up two rail sweep operation.
de_de: Sweep-Vorgang mit zwei Führungskurven kann nicht eingerichtet werden.
ja_jp: 2 つのレール スイープ操作を設定できません。

source: Cannot instruct ASM to make a Solid.
de_de: ASM kann nicht angewiesen werden, einen Solid zu erstellen.
ja_jp: ASM に ソリッドを作成するよう指示できません。

source: Cannot set linear map for two-rail sweeping.
de_de: Lineare Zuordnung für Sweep mit zwei Führungskurven kann nicht festgelegt werden.
ja_jp: 2 つのレールのスイープには線形マップを設定できません。

source: Unable to sweep profile Curve.
de_de: Sweep für Profil-Curve nicht möglich
ja_jp: プロファイル曲線をスイープできません。

source: Cannot union an empty list of Solids
de_de: Vereinigen einer leeren Liste von Volumenkörpern nicht möglich
ja_jp: ソリッドの空のリストを結合できません

source: Cannot create Solid, Curves are not closed
de_de: Solid kann nicht erstellt werden, Curves sind nicht geschlossen.
ja_jp: ソリッドを作成できません。曲線が閉じていません

source: Cast object is not a Sphere
de_de: Objekt für Umwandlung ist keine Sphere
ja_jp: 投影オブジェクトは球ではありません

source: Sphere::by_four_points needs 4 points.
de_de: Sphere::by_four_points benötigt 4 Punkte.
ja_jp: Sphere::by_four_points には 4 つの点が必要です。

source: Failed to make Sphere by four points.
de_de: Fehler beim Erstellen der Sphere durch vier Punkte
ja_jp: 4 つの点で球を作成できませんでした。

source: Sphere::by_four_points needs more than 4 points.
de_de: Sphere::by_four_points benötigt mehr als 4 Punkte.
ja_jp: Sphere::by_four_points には 5 つ以上の点が必要です。

source: Failed to fit Sphere.
de_de: Fehler beim Anpassen der Sphere
ja_jp: 球をフィットさせることができませんでした。

source: Unable to create sphere
de_de: Kugel kann nicht erstellt werden.
ja_jp: 球を作成できません

source: Unable to get the FACE's range in Surface constructor.
de_de: FACE-Bereich im Surface-Konstruktor kann nicht abgerufen werden.
ja_jp: サーフェス コンストラクタで面の範囲を取得できません。

source: Cast object is not a Surface
de_de: Objekt für Umwandlung ist keine Oberfläche
ja_jp: 投影オブジェクトはサーフェスではありません

source: Unable to patch a single, non-closed curve
de_de: Einzelne, nicht geschlossene Kurve kann nicht gefüllt werden
ja_jp: 閉じていない単一の曲線をパッチできません

source: Unable to patch curve
de_de: Kurve kann nicht gefüllt werden
ja_jp: 曲線をパッチできません

source: Error creating Surface: Points are coincident
de_de: Fehler beim Erstellen von Oberfläche: Punkte fallen zusammen
ja_jp: サーフェスの作成中にエラーが発生しました。点が重複しています

source: Error creating Surface perimeter Curves
de_de: Fehler beim Erstellen von Umfangskurven für Oberfläche
ja_jp: サーフェスのペリメータ曲線を作成する際にエラーが発生しました

source: Error using perimeter Curves to make Surface
de_de: Fehler beim Erstellen von Oberfläche aus Umfangskurven
ja_jp: ペリメータ曲線を使用してサーフェスを作成する際にエラーが発生しました

source: Unable to make wire from edges
de_de: Draht kann nicht aus Kanten erstellt werden
ja_jp: エッジから配線を作成できません

source: Unable to create polygon
de_de: Polygon kann nicht erstellt werden
ja_jp: ポリゴンを作成できません

source: Invalid face!
de_de: Ungültige Fläche
ja_jp: 面が無効です

source: trim_with_edge_loops requires all curves to touch surface
de_de: Für trim_with_edge_loops müssen alle Kurven die Oberfläche berühren
ja_jp: trim_with_edge_loops では、すべての曲線がサーフェスに接触している必要があります

source: Unable to add face!
de_de: Fläche kann nicht hinzugefügt werden.
ja_jp: 面を追加できません

source: Unable to set surface!
de_de: Oberfläche kann nicht festgelegt werden.
ja_jp: サーフェスを設定できません

source: Unable to add edge!
de_de: Kante kann nicht hinzugefügt werden.
ja_jp: エッジを追加できません

source: Unable to set curve!
de_de: Kurve kann nicht festgelegt werden.
ja_jp: 曲線を設定できません

source: Unable to add vertex!
de_de: Scheitelpunkt kann nicht hinzugefügt werden.
ja_jp: 頂点を追加できません

source: Unable to set vertex position!
de_de: Scheitelpunktposition kann nicht festgelegt werden.
ja_jp: 頂点の位置を設定できません

source: Unable to set edge vertices!
de_de: Scheitelpunkte für Kanten können nicht festgelegt werden.
ja_jp: エッジの頂点を設定できません

source: Unable to add loop!
de_de: Kontur kann nicht hinzugefügt werden.
ja_jp: ループを追加できません

source: Unable to set coedges of loop!
de_de: Gemeinsame Kanten der Kontur können nicht festgelegt werden.
ja_jp: ループの共有エッジを設定できません

source: Unable to set loop on face!
de_de: Kontur auf Fläche kann nicht festgelegt werden.
ja_jp: 面のループを設定できません

source: Unable to create entity!
de_de: Objekt kann nicht erstellt werden.
ja_jp: 図形を作成できません

source: Unable to trim surface as the input loop geometry could be illegal
de_de: Die Oberfläche kann nicht gestutzt werden, da die Geometrie der Eingabekontur unzulässig sein könnte
ja_jp: サーフェスをトリムできません。入力ループ ジオメトリが無効である可能性があります

source: Lofted Curve, but could not convert to double-sided
de_de: Erhebung für Kurve durchgeführt, Definieren als doppelseitig jedoch nicht möglich
ja_jp: 曲線がロフトされましたが、両面に変換できませんでした

source: Swept Curve, but could not convert to double sided
de_de: Sweep für Kurve erstellt, Definieren als doppelseitig jedoch nicht möglich
ja_jp: 曲線がスイープされましたが、両面に変換できませんでした

source: Unable to approximate surface
de_de: Näherung für Oberfläche nicht möglich
ja_jp: サーフェスを近似化できません

source: Unable to extrude non-planar face without vector
de_de: Nicht-planare Fläche kann nicht ohne Vektor extrudiert werden
ja_jp: ベクトルを使用せずに非平面状の面を押し出すことはできません

source: Unable to extrude surface
de_de: Oberfläche kann nicht extrudiert werden.
ja_jp: サーフェスを押し出すことができません

source: Unable to compute extrusion of surface
de_de: Extrusion der Oberfläche kann nicht verarbeitet werden
ja_jp: サーフェスの押し出しを計算できません

source: Unable to set BODY thicken data
de_de: Verdickungsdaten für BODY können nicht festgelegt werden
ja_jp: ボディの厚みデータを設定できません

source: Unable to set thicken operation to both sides
de_de: Verdickung konnte nicht als doppelseitig definiert werden
ja_jp: 両側で厚み操作を設定することはできません

source: Unable to compute thickened face
de_de: Verdickte Fläche kann nicht berechnet werden.
ja_jp: 厚みを付けた面を計算できません

source: Unable to set BODY offset data
de_de: Versatzdaten für BODY können nicht festgelegt werden
ja_jp: ボディのオフセット データを設定できません

source: Unable to set whether the result is attached or not
de_de: Es kann nicht festgelegt werden, ob das Ergebnis verbunden ist oder nicht.
ja_jp: 結果をアタッチするかどうかを設定することはできません

source: Could not offset surface
de_de: Oberfläche konnte nicht versetzt werden
ja_jp: サーフェスをオフセットできませんでした

source: Unable to evaluate normal of Surface.
de_de: Normale der Oberfläche kann nicht ausgewertet werden.
ja_jp: サーフェスの法線を評価できません。

source: Unable union two surfaces
de_de: Fehler beim Vereinigen von zwei Oberflächen
ja_jp: 2 つのサーフェスを結合できません

source: Cannot union an empty list of surfaces
de_de: Leere Oberflächenliste kann nicht vereinigt werden
ja_jp: サーフェスの空のリストを結合できません

source: Unable difference two surfaces
de_de: Fehler beim Unterscheiden von zwei Oberflächen
ja_jp: 2 つのサーフェスを区別できません

source: can not evaluate curvature
de_de: Krümmung kann nicht ausgewertet werden.
ja_jp: 曲率を評価できません

source: Unable to reverse the body
de_de: Fehler beim Umkehren des Körpers
ja_jp: ボディを反転できません

source: Cannot instruct ASM to make a Surface.
de_de: ASM kann nicht angewiesen werden, eine Oberfläche zu erstellen.
ja_jp: ASM に対してサーフェスの作成を指示することはできません。

source: The distance between base and the first pick point must be greater than 0.
de_de: Der Abstand zwischen dem Basispunkt und dem ersten Auswahlpunkt muss größer sein als 0.
ja_jp: 基準点と最初の選択点の間の距離は 0 より大きくする必要があります。

source: The distance between base and the second pick point must be greater than 0.
de_de: Der Abstand zwischen dem Basispunkt und dem zweiten Auswahlpunkt muss größer sein als 0.
ja_jp: 基準点と 2 番目の選択点の間の距離は 0 より大きくする必要があります。

source: The base point and first pick point must not be coincident!
de_de: Der Basispunkt und der erste Auswahlpunkt dürfen nicht zusammenfallen.
ja_jp: 基準点と最初の選択点を同じに設定することはできません!

source: The scale factor is 0! The base point and second pick point may be coincident!
de_de: Der Skalierfaktor ist 0. Der Basispunkt und der zweite Auswahlpunkt fallen möglicherweise zusammen.
ja_jp: スケール係数が 0 です! 基準点と 2 番目の選択点が同じになっていると考えられます!

source: Cast object is not a Vector
de_de: Objekt für Umwandlung ist kein Vector
ja_jp: 投影オブジェクトはベクトルではありません

source: attempt to set length of zero length vector
de_de: Versuch, die Länge eines Vektors mit Länge Null festzulegen
ja_jp: 長さがゼロのベクトルの長さを設定しようとしています

source: Can't get curve from coedge
de_de: Kurve kann nicht aus der gemeinsamen Kante abgeleitet werden
ja_jp: 共有エッジから曲線を取得できません

source: The CoEdge belongs to a degenerate Edge.
de_de: Gemeinsame Kante gehört zu einer ungültigen Kante.
ja_jp: 共有エッジは縮退したエッジに属しています。

source: Error getting coedges of the edge!
de_de: Fehler beim Abrufen der gemeinsamen Kanten der Kante.
ja_jp: エッジの共有エッジを取得する際にエラーが発生しました

source: doesn't support curve geometry query operation on its Edge!
de_de: unterstützt keine Abfrage von Kurvengeometrie an der Kante.
ja_jp: のエッジでは、曲線ジオメトリのクエリー操作はサポートされていません

source: Error copying an edge!
de_de: Fehler beim Kopieren einer Kante
ja_jp: エッジのコピー中にエラーが発生しました!

source: Error creating a wire from edges!
de_de: Fehler beim Erstellen von Draht aus Kanten
ja_jp: エッジから配線を作成する際にエラーが発生しました

source: Unable to transform EDGE
de_de: EDGE kann nicht transformiert werden
ja_jp: EDGE を変換できません

source: Could not test EDGE equality
de_de: EDGE-Gleichheit konnte nicht getestet werden
ja_jp: EDGE の均等性をテストできませんでした

source: Error getting face vertices!
de_de: Fehler beim Abrufen der Flächenscheitelpunkte.
ja_jp: 面の頂点を取得する際にエラーが発生しました

source: Error getting face edges!
de_de: Fehler beim Abrufen der Flächenkanten
ja_jp: 面のエッジを取得する際にエラーが発生しました

source: Error getting face loops!
de_de: Fehler beim Abrufen der Flächenkonturen.
ja_jp: 面のループを取得する際にエラーが発生しました

source: Error getting loop coedges!
de_de: Fehler beim Abrufen gemeinsamen Kanten der Kontur.
ja_jp: ループの共有エッジを取得する際にエラーが発生しました

source: Failed to define loop direction
de_de: Fehler beim Definieren der Schleifenrichtung
ja_jp: ループの方向の定義に失敗しました

source: doesn't support Vertex query operation!
de_de: bietet keine Unterstützung für Vertex-Abfrageoperation.
ja_jp: では、頂点のクエリー操作はサポートされていません

source: doesn't support Edge query operation!
de_de: bietet keine Unterstützung für Edge-Abfrageoperation.
ja_jp: では、エッジのクエリー操作はサポートされていません

source: doesn't support Face query operation!
de_de: bietet keine Unterstützung für Face-Abfrageoperation.
ja_jp: では、面のクエリー操作はサポートされていません

source: Error getting adjacent edges of a vertex!
de_de: Fehler beim Abrufen der angrenzenden Kanten eines Scheitelpunkts.
ja_jp: 頂点の隣接エッジを取得する際にエラーが発生しました

source: Error getting adjacent faces of a vertex!
de_de: Fehler beim Abrufen der angrenzenden Flächen eines Scheitelpunkts.
ja_jp: 頂点の隣接面を取得する際にエラーが発生しました

source: doesn't support point geometry query operation on its Vertex!
de_de: unterstützt keine Abfrage von Punktgeometrie am Scheitelpunkt.
ja_jp: の頂点では、点ジオメトリのクエリー操作はサポートされていません

source: Could not get vertex point
de_de: Scheitelpunkt konnte nicht abgerufen werden.
ja_jp: 頂点を取得できませんでした

source: Num symmetric faces must be greater than zero.
de_de: Anzahl der symmetrischen Flächen muss größer als Null sein.
ja_jp: 数値対称面の数はゼロより大きくする必要があります。

source: Number of symmetric segments must be greater than or equal to 2
de_de: Anzahl der symmetrischen Segmente muss größer als oder gleich 2 sein
ja_jp: 対称セグメントの数は 2 以上である必要があります

source: Reflection has null parent
de_de: Übergeordnetes Objekt für Reflexion ist Null
ja_jp: 反射に NULL の親が含まれています

source: Reflection has invalid index
de_de: Reflexion hat ungültigen Index
ja_jp: 反射に無効なインデックスが含まれています

source: Reflection has invalid plane
de_de: Reflexion hat ungültige Ebene
ja_jp: 反射に無効な面が含まれています

source: Reflection has unimplemented symmetry type
de_de: Symmetrietyp der Reflexion ist nicht implementiert
ja_jp: 反射に、実装されていない対称タイプが含まれています

source: The provided topology inputs should create equal count of contiguous groups
de_de: Die bereitgestellten Topologieeingaben sollten gleich viele zusammenhängende Gruppen erstellen
ja_jp: 指定したトポロジ入力では、同じ数の隣接グループが作成されます

source: Span counts list should have the same length as input contiguous group count, 1 for replication or be empty. Detected contiguous group count:
de_de: Die Liste mit der Anzahl der Felder muss ebenso viele Einträge wie die Liste der eingegebenen zusammenhängenden Gruppen oder 1 für die Replikation umfassen oder leer sein. Erkannte Anzahl zusammenhängender Gruppen:
ja_jp: スパン数のリストは、入力隣接グループ数と同じ長さである必要があります(複製の場合は 1、それ以外の場合は空)。次の隣接グループ数が検出されました:

source: Rotation counts list should have the same length as input contiguous group count, 1 for replication or be empty. Detected contiguous group count:
de_de: Die Liste mit der Anzahl der Drehungen muss ebenso viele Einträge wie die Liste der zusammenhängenden Gruppen oder 1 für die Replikation umfassen oder leer sein. Erkannte Anzahl zusammenhängender Gruppen:
ja_jp: 回転数のリストは、入力隣接グループ数と同じ長さである必要があります(複製の場合は 1、それ以外の場合は空)。次の隣接グループ数が検出されました:

source: Follow curves list should have the same length as inputcontiguous group count, 1 for replication or be empty. Detected contiguous group count:
de_de: Die Liste mit den Kurven zum Folgen muss ebenso viele Einträge wie die Liste der eingegebenen zusammenhängenden Gruppen oder 1 für die Replikation umfassen oder leer sein. Erkannte Anzahl zusammenhängender Gruppen:
ja_jp: フォロー曲線のリストは、入力隣接グループ数と同じ長さである必要があります(複製の場合は 1、それ以外の場合は空)。次の隣接グループ数が検出されました:

source: Align vertices list should have the same length as input contiguous group count or be empty. Detected contiguous group count:
de_de: Die Liste mit den Ausrichtungsscheitelpunkten muss ebenso lang sein wie die Liste der eingegebenen zusammenhängenden Gruppen oder leer sein. Erkannte Anzahl zusammenhängender Gruppen:
ja_jp: 位置合わせ頂点のリストは、入力隣接グループ数と同じ長さ、または空である必要があります。次の隣接グループ数が検出されました:

source: Flip alignment flags list should have the same length as input contiguous group count, 1 for replication or be empty. Detected contiguous group count:
de_de: Die Liste mit den Flags für die Umkehrungsausrichtung muss ebenso viele Einträge wie die Liste der eingegebenen zusammenhängenden Gruppen oder 1 für die Replikation umfassen oder leer sein. Erkannte Anzahl zusammenhängender Gruppen:
ja_jp: 位置合わせ反転フラグのリストは、入力隣接グループ数と同じ長さである必要があります(複製の場合は 1、それ以外の場合は空)。次の隣接グループ数が検出されました:

source: Failed to combine two T-Spline surfaces during bridge operation
de_de: Fehler beim Kombinieren von zwei T-Spline-Oberflächen bei Brückenoperation
ja_jp: ブリッジの操作中に、2 つの T スプライン サーフェスを結合できませんでした

source: The given inputs are invalid - make sure the first group belongs to the input surface and the second group belongs to either the same surface or another surface
de_de: Die angegebenen Eingaben sind ungültig. Stellen Sie sicher, dass die erste Gruppe zur Eingabeoberfläche und die zweite Gruppe entweder zur gleichen oder zu einer anderen Oberfläche gehört.
ja_jp: 指定された入力が無効です: 1 番目のグループが入力されたサーフェスに属し、2 番目のグループが同じサーフェスまたは別のサーフェスに属していることを確認してください

source: Segments count should be greater than or equal to 1
de_de: Anzahl der Segmente muss größer als oder gleich 1 sein
ja_jp: セグメントの数は 1 以上である必要があります

source: Segments count should be greater than rotations count
de_de: Anzahl der Segmente muss größer sein als Anzahl der Drehungen
ja_jp: セグメントの数は回転の数よりも大きくする必要があります

source: Wrong first orient vertex
de_de: Erste Scheitelpunktausrichtung falsch
ja_jp: 最初の頂点の方向が正しくありません

source: Wrong second orient vertex
de_de: Zweite Scheitelpunktausrichtung falsch
ja_jp: 2 番目の頂点の方向が正しくありません

source: Bridge cannot be built
de_de: Brücke kann nicht erstellt werden
ja_jp: ブリッジを作成できません

source: Cast object is not a TSplineSurface
de_de: Objekt für Umwandlung ist keine TSplineSurface
ja_jp: 投影オブジェクトは T スプライン サーフェスではありません

source: Spans should be greater than or equal to 1
de_de: Felder müssen größer als oder gleich 1 sein
ja_jp: スパンの数は 1 以上である必要があります

source: Error loading T-Spline surface from the given file path.
de_de: Fehler beim Laden der T-Spline-Oberfläche aus dem angegebenen Dateipfad.
ja_jp: 指定したファイル パスから T スプライン サーフェスをロードする際にエラーが発生しました。

source: Unable to open the given T-Spline Scene file.
de_de: Angegebene T-Spline-Szenendatei kann nicht geöffnet werden.
ja_jp: 指定した T スプライン シーン ファイルを開くことができません。

source: Unable to load T-Spline surfaces.
de_de: T-Spline-Oberflächen können nicht geladen werden.
ja_jp: T スプライン サーフェスをロードできません。

source: Error saving TSM
de_de: Fehler beim Speichern von TSM
ja_jp: TSM を保存する際にエラーが発生しました

source: Error saving TSS
de_de: Fehler beim Speichern von TSS
ja_jp: TSS を保存する際にエラーが発生しました

source: Error saving a T-Spline surface to a string
de_de: Fehler beim Speichern einer T-Spline-Oberfläche als Zeichenfolge
ja_jp: T スプライン サーフェスを文字列に保存する際にエラーが発生しました

source: Error loading T-Spline surface from the given string.
de_de: Fehler beim Laden einer T-Spline-Oberfläche aus der angegebenen Zeichenfolge.
ja_jp: 指定した文字列から T スプライン サーフェスをロードする際にエラーが発生しました。

source: This T-Spline is not BRep convertible
de_de: Dieser T-Spline ist nicht BRep-konvertierbar
ja_jp: この T スプラインを BRep に変換することはできません

source: Unable to convert to BRep
de_de: Fehler beim Umwandeln in BRep
ja_jp: BRep に変換できません

source: Minimum segments count must be greater or equal to 0.
de_de: Mindestwert für Segmente muss größer als oder gleich 0 sein.
ja_jp: セグメントの最小数は 0 以上である必要があります。

source: The mesh is empty
de_de: Netz ist leer
ja_jp: メッシュが空になっています

source: Groups sizes don't match.
de_de: Größe der Gruppen stimmt nicht überein.
ja_jp: グループのサイズが一致していません。

source: T-Spline Surface is not extractable and can not be displayed in smooth mode
de_de: T-Spline-Oberfläche kann nicht extrahiert und im glatten Modus angezeigt werden
ja_jp: T スプライン サーフェスを抽出できないため、スムーズ モードで表示できません

source: T-Spline Surface requires segments count to be greater or equal to 1
de_de: Anzahl der Segmente für die T-Spline-Oberfläche muss größer als oder gleich 1 sein
ja_jp: T スプライン サーフェスでは、セグメントの数が 1 以上である必要があります

source: Failed to bevel edges
de_de: Fehler beim Abschrägen von Kanten
ja_jp: エッジのベベル処理に失敗しました

source: Failed to slide edges
de_de: Fehler beim Verschieben von Kanten
ja_jp: エッジのスライドに失敗しました

source: The provided edges should create equal count of groups
de_de: Aus den angegebenen Kanten müssen gleich viele Gruppen erstellt werden
ja_jp: 指定したエッジでは、同じ数のグループが作成されます

source: Failed to merge edges.
de_de: Kanten konnten nicht zusammengeführt werden.
ja_jp: エッジのマージに失敗しました。

source: The input groups cannot be empty
de_de: Die eingegebenen Gruppen dürfen nicht leer sein
ja_jp: 入力グループを空にすることはできません

source: Only border edges are permitted
de_de: Nur Randkanten sind zulässig
ja_jp: 境界エッジのみ許可されています

source: Failed fill hole with given inputs
de_de: Loch konnte nicht mit den gegebenen Eingaben gefüllt werden
ja_jp: 指定された入力を使用して穴を埋めることに失敗しました

source: T-Spline doesn't have symmetry
de_de: T-Spline verfügt über keine Symmetrie
ja_jp: T スプラインに対称が含まれていません

source: Impossible to add symmetry to the t-spline
de_de: T-Spline kann nicht mit Symmetrie versehen werden
ja_jp: T スプラインに対称を追加できません

source: Unable to find closest point to given geometries
de_de: Der nächstgelegene Punkt für die gegebenen Geometrien wurde nicht gefunden
ja_jp: 指定されたジオメトリに最も近い点を検出できません

source: Flatten failed. At least 4 vertices is required
de_de: Abflachen fehlgeschlagen, mindestens vier Scheitelpunkte erforderlich
ja_jp: 平坦化に失敗しました。頂点は 4 つ以上必要です

source: Flatten failed. At least 3 vertices is required
de_de: Abflachen fehlgeschlagen, mindestens drei Scheitelpunkte erforderlich
ja_jp: 平坦化に失敗しました。頂点は 3 つ以上必要です

source: Faces with given indices are absent in the surface
de_de: Die Flächen mit den angegebenen Indizes sind in der Oberfläche nicht vorhanden
ja_jp: 指定されたインデックスを持つ面がサーフェス上に存在しません

source: Flipping normals failed.
de_de: Normalen umkehren fehlgeschlagen.
ja_jp: 法線の反転に失敗しました。

source: Making uniform failed.
de_de: Gleichmäßig machen fehlgeschlagen.
ja_jp: 均一の作成に失敗しました。

source: Knots technically match, but it's probably just roundoff from a seashell
de_de: Knoten stimmen technisch überein, es handelt sich jedoch wahrscheinlich nur um die Rundung einer Seashell
ja_jp: ノットは技術的な要件は満たしていますが、シーシェルから丸められているだけの可能性があります

source: Seashell isoparm pattern exists, standardization is impossible
de_de: Seashell-Isoparm-Muster vorhanden, Standardisierung nicht möglich
ja_jp: シーシェルのアイソパラム パターンが存在しているため、標準化できません

source: The t-spline is not manifold
de_de: T-Spline ist nicht mannigfaltig
ja_jp: T スプラインが多様体ではありません

source: The matching knots guarantee is not met
de_de: Garantie für übereinstimmende Knoten ist nicht erfüllt
ja_jp: 一致するノットの保証要件が満たされていません

source: The t-spline contains degenerate faces/zero-length edges
de_de: T-Spline enthält ungültige Flächen/Kanten mit Nulllänge
ja_jp: T スプラインに、縮退面または長さがゼロのエッジが含まれています

source: The t-spline contains valence-2 star points
de_de: T-Spline enthält Sternpunkte mit Wertigkeit 2
ja_jp: T スプラインに価数 2 のスター ポイントが含まれています

source: Failed to standardize the t-spline
de_de: Standardisieren des T-Splines fehlgeschlagen
ja_jp: T スプラインの標準化に失敗しました

source: nu and nv should be non-negative
de_de: NU und NV dürfen nicht negativ sein
ja_jp: nu と nv に負の値を設定することはできません

source: Spans parameters shoud be greater or equal to 0
de_de: Felderparameter müssen größer als oder gleich 0 sein
ja_jp: スパン パラメータの数は 0 以上である必要があります

source: One of front or back spans number shoud be greater than 0
de_de: Anzahl der Felder entweder vorn oder hinten muss größer als 0 sein
ja_jp: 前面スパンまたは背面スパンのいずれかの数が 0 より大きな値になっている必要があります

source: Curve extrusion failed
de_de: Kurvenextrusion fehlgeschlagen
ja_jp: 曲線の押し出しに失敗しました

source: Failed to sweep curve into TSpline surface
de_de: Fehler beim Sweeping der Kurve in TSpline-Oberfläche
ja_jp: T スプライン サーフェス内への曲線のスイープに失敗しました

source: The given surface vector is empty
de_de: Der angegebene Oberflächenvektor ist leer
ja_jp: 指定したサーフェスのベクトルは空です

source: Failed to combine T-spline surfaces
de_de: T-Spline-Flächen kombinieren fehlgeschlagen
ja_jp: T スプライン サーフェスを結合できませんでした

source: The size of the segment counts must be 0, 1, or the curve count
de_de: Der Wert für die Segmentanzahl muss 0, 1 oder gleich der Kurvenanzahl sein
ja_jp: セグメント数のサイズは、0、1、または曲線数である必要があります

source: The size of the rotations at the start of the curves must be either 1 or the curve count
de_de: Der Wert für die Drehungen am Kurvenbeginn muss entweder 1 oder gleich der Kurvenanzahl sein
ja_jp: 曲線の始端における回転のサイズは 1 または曲線数である必要があります

source: The size of the rotations at the end of the curves must be either 1 or the curve count
de_de: Der Wert für die Drehungen am Kurvenende muss entweder 1 oder gleich der Kurvenanzahl sein
ja_jp: 曲線の終端における回転のサイズは 1 または曲線数である必要があります

source: The size of the radii at the start of the curves must be either 1 or the curve count
de_de: Der Wert für die Radien am Kurvenbeginn muss entweder 1 oder gleich der Kurvenanzahl sein
ja_jp: 曲線の始端における半径のサイズは 1 または曲線数である必要があります

source: The size of the radii at the end of the curves must be either 1 or the curve count
de_de: Der Wert für die Radien am Kurvenende muss entweder 1 oder gleich der Kurvenanzahl sein
ja_jp: 曲線の終端における半径のサイズは 1 または曲線数である必要があります

source: The size of the positions at the start of the curves must be either 1 or the curve count
de_de: Der Wert für die Positionen am Kurvenbeginn muss entweder 1 oder gleich der Kurvenanzahl sein
ja_jp: 曲線の始端における位置のサイズは 1 または曲線数である必要があります

source: The size of the positions at the end of the curves must be either 1 or the curve count
de_de: Der Wert für die Positionen am Kurvenende muss entweder 1 oder gleich der Kurvenanzahl sein
ja_jp: 曲線の終端における位置のサイズは 1 または曲線数である必要があります
