Repository: HNANmal/mQ
Catalog: DynamoCoreRuntime_2.13.1.3887/libg_locale/*/LC_MESSAGES/libg.po
Languages: de_de, ja_jp

source: Unable to get WIREs while decomposing BODY
de_de: Fehler beim Abrufen der WIREs beim Zerlegen von BODY
ja_jp: BODY の分解中は WIRE を取得できません

source: Error getting coedges
de_de: Fehler beim Abrufen der gemeinsamen Kanten
ja_jp: 共有エッジを取得する際にエラーが発生しました

source: Could not separate BODYs before decomposition
de_de: BODYs konnten vor Zerlegung nicht getrennt werden
ja_jp: 分解前にボディを分割できませんでした

source: Could not get EDGEs from BODY when extracting Curves
de_de: Fehler beim Abrufen der EDGEs aus BODY beim Extrahieren der Curves
ja_jp: 曲線を抽出する際に、ボディからエッジを取得できませんでした

source: Could not get COEDGEs from BODY when extracting Curves
de_de: Fehler beim Abrufen der COEDGEs aus BODY beim Extrahieren der Curves
ja_jp: 曲線を抽出する際に、ボディから共有エッジを取得できませんでした

source: Could not get EDGEs from FACE when extracting Curves
de_de: Fehler beim Abrufen der EDGEs aus FACE beim Extrahieren der Curves
ja_jp: 曲線を抽出する際に、面からエッジを取得できませんでした

source: Unable to create Curve from COEDGE when extracting Curves
de_de: Erstellen von Curve aus COEDGE beim Extrahieren von Curves nicht möglich
ja_jp: 曲線の抽出中は、共有エッジから曲線を作成することはできません

source: Error getting length of the edge
de_de: Fehler beim Abrufen der Länge der Kante
ja_jp: エッジの長さの取得中にエラーが発生しました

source: Unable to get start Point of zero length EDGE
de_de: Fehler beim Abrufen von Start-Point von EDGE mit Länge Null
ja_jp: 長さゼロの EDGE の開始 Point を取得できません

source: Unable to get area
de_de: Fläche kann nicht abgerufen werden
ja_jp: 面積を取得できません

source: Could not compare Geometry
de_de: Geometry konnte nicht verglichen werden
ja_jp: Geometry を比較できませんでした

source: Unable to get FACE from BODY: no faces in BODY
de_de: Abrufen von FACE aus BODY nicht möglich: keine Flächen in BODY
ja_jp: BODY から FACE を取得できません。BODY に面がありません

source: Unable to make sheet double sided
de_de: Plan kann nicht als doppelseitig definiert werden.
ja_jp: シートを両面にすることができません

source: Unable to create brep around face
de_de: BREP um Fläche kann nicht erstellt werden.
ja_jp: 面の周囲に brep を作成できません

source: Unable to create BRep BODY from FACEs
de_de: BRep-BODY kann nicht aus FACEs erstellt werden
ja_jp: 面から BRep ボディを作成できません

source: Unable make FACEs BODY double sided.
de_de: FACEs BODY kann nicht als doppelseitig definiert werden.
ja_jp: FACE の BODY を両面にすることができません。

source: Unable to create non regular subtraction boolean
de_de: Boolescher Wert für nicht reguläre Subtraktion kann nicht erstellt werden.
ja_jp: 標準以外の差ブール演算を作成できません

source: Unable to approximate body
de_de: Näherung für Körper nicht möglich
ja_jp: 近似したボディを作成することができません

source: Unable to compute equality between bodies
de_de: Gleichheit zwischen Körpern kann nicht berechnet werden.
ja_jp: ボディ間の均等性を計算できません

source: Unable to extract a bounding box from ASM ENTITY
de_de: Begrenzungsrahmen kann nicht aus ASM ENTITY extrahiert werden.
ja_jp: ASM ENTITY から境界ボックスを抽出できません

source: Unable to create planar face of BoundingBox
de_de: Planare Fläche von BoundingBox kann nicht erstellt werden.
ja_jp: BoundingBox の平面を作成できません

source: Unable to compute closest approach on BoundingBox face
de_de: Nächste Annäherung an Fläche von BoundingBox kann nicht berechnet werden.
ja_jp: BoundingBox 面に最も近いアプローチを計算できません

source: Cast object is not a helix
de_de: Objekt für Umwandlung ist keine Helix
ja_jp: 投影オブジェクトはらせんではありません

source: Cannot make helix
de_de: Schraubenform kann nicht erstellt werden.
ja_jp: らせんを作成できません

source: Cast object is not a Line
de_de: Objekt für Umwandlung ist keine Line
ja_jp: 投影オブジェクトは線分ではありません

source: Unable to create Line. Points are likely coincident
de_de: Linie kann nicht erstellt werden. Punkte fallen wahrscheinlich zusammen.
ja_jp: 線分を作成できません。端点が一致していると考えられます

source: Best fit line needs 2 points or more!
de_de: Für Ausgleichseinrechnungslinie werden mindestens zwei Punkte benötigt.
ja_jp: 最適な線分には 2 つ以上の点が必要です!

source: Cast object is not a Plane
de_de: Objekt für Umwandlung ist keine Plane
ja_jp: 投影オブジェクトは平面ではありません

source: Could not create Plane! one or more of the desired axes of this plane have zero length!
de_de: Plane konnte nicht erstellt werden. Eine oder mehrere der gewünschten Achsen dieser Ebene haben die Länge Null.
ja_jp: 平面を作成できませんでした。この平面では、1 つまたは複数の必要な軸の長さがゼロになっています

source: Could not create Plane! The desired axes of this plane are parallel!
de_de: Plane konnte nicht erstellt werden. Die gewünschten Achsen dieser Ebene sind parallel.
ja_jp: 平面を作成できませんでした。この平面では、必要な軸が平行になっています

source: Intersecting two infinite geometries such as Planes is an invalid operation!
de_de: Eine Schnittoperation zweier unbegrenzter Geometrien wie z. B. Ebenen ist eine ungültige Operation!
ja_jp: 2 つの無限ジオメトリ(平面など)は交差できません

source: Unable to split Plane
de_de: Plane kann nicht geteilt werden.
ja_jp: 平面を分割できません

source: SetAttributes not implemented for Plane.
de_de: SetAttributes für Plane nicht implementiert.
ja_jp: 平面に SetAttribute が実装されていません。

source: Unable to trim Plane
de_de: Plane kann nicht gestutzt werden.
ja_jp: 平面をトリムできません

source: Best fit plane needs 3 or more points.
de_de: Für die Ausgleichseinrechnungsebene werden mindestens drei Punkte benötigt.
ja_jp: 最適フィット平面には 3 つ以上の点が必要です。

source: Cast object is not a Point
de_de: Objekt für Umwandlung ist kein Point
ja_jp: 投影オブジェクトは点ではありません

source: Unable to set vertex position
de_de: Scheitelpunktposition kann nicht festgelegt werden.
ja_jp: 頂点の位置を設定できません

source: Unable to post process VERTEX ENTITY
de_de: Nachbearbeitung für VERTEX ENTITY nicht möglich
ja_jp: VERTEX ENTITY をポスト処理できません

source: Unable to set VERTEX position
de_de: VERTEX-Position kann nicht festgelegt werden.
ja_jp: 頂点の位置を設定できません

source: Unable to create brep around Point
de_de: Brep um Punkt kann nicht erstellt werden.
ja_jp: 点の周囲に brep を作成できません

source: Unable to get extremum point
de_de: Fehler beim Abrufen des Extrempunkts
ja_jp: 極値点を取得できません

source: Cast object is not a PolyCurve
de_de: Objekt für Umwandlung ist keine PolyCurve
ja_jp: 投影オブジェクトはポリカーブではありません

source: Cannot create a PolyCurve without any Points.
de_de: PolyCurve kann nicht ohne Points erstellt werden.
ja_jp: 点を指定せずにポリカーブを作成することはできません。

source: Cannot make a PolyCurve from an empty list
de_de: PolyCurve kann nicht aus einer leeren Liste erstellt werden.
ja_jp: 空のリストからポリカーブを作成することはできません

source: Unable to compute edge from curve
de_de: Kante kann nicht aus curve berechnet werden.
ja_jp: 曲線からエッジを計算できません

source: PolyCurves may be branching
de_de: PolyCurves sind möglicherweise verzweigt.
ja_jp: ポリカーブが分岐している可能性があります

source: Get EDGEs operation failed when creating PolyCurve
de_de: Abrufen von EDGEs beim Erstellen von PolyCurve fehlgeschlagen
ja_jp: ポリカーブの作成時に、エッジの取得操作が失敗しました

source: Failed to find start Edge
de_de: Fehler beim Suchen der Anfangs-Edge
ja_jp: 開始エッジが見つかりませんでした

source: Could not get wires out of WIRE SMI
de_de: Drähte konnten nicht aus WIRE SMI abgerufen werden.
ja_jp: ワイヤ SMI からワイヤを取得できませんでした

source: Curve join did not produce any wires in PolyCurve. A PolyCurve needs to have exactly one wire.
de_de: Die Kurvenverbindung hat keine Drähte in PolyCurve erzeugt. Eine PolyCurve muss genau einen Draht haben.
ja_jp: 曲線の結合でポリカーブにワイヤが生成されませんでした。1 つのポリカーブに対して 1 つのワイヤが必要です。

source: Curve join produced more than one wire in PolyCurve. A PolyCurve needs to have exactly one wire.
de_de: Die Kurvenverbindung hat mehr als einen Draht in PolyCurve erzeugt. Eine PolyCurve muss genau einen Draht haben.
ja_jp: 曲線の結合でポリカーブに複数のワイヤが生成されました。1 つのポリカーブに対して 1 つのワイヤが必要です。

source: The second curve was a PolyCurve and its sub-curves could not be extracted
de_de: Die zweite Kurve ist eine PolyCurve, und ihre Teilkurven konnten nicht extrahiert werden.
ja_jp: 2 番目の曲線がポリカーブであり、そのサブ曲線を抽出できませんでした

source: Invalid Curve index
de_de: Ungültiger Index für Curve
ja_jp: 曲線のインデックスが無効です

source: Could not find sub Curve in parameter range
de_de: sub Curve wurde im Parameterbereich nicht gefunden.
ja_jp: パラメータ範囲にサブ曲線が見つかりませんでした

source: Could not find parameter at distance
de_de: parameter at distance nicht gefunden
ja_jp: 指定された距離でパラメータを取得できませんでした

source: Could not find parameter at Point
de_de: parameter at Point nicht gefunden
ja_jp: 点の位置でパラメータを見つけることができませんでした

source: Parameter at chord length Not Implemented
de_de: Parameter für Sehnenlänge nicht implementiert
ja_jp: 弦の長さのパラメータが実装されていません

source: Param Trim Segments Not Implemented
de_de: Param Segmente stutzen nicht implementiert
ja_jp: Param Trim Segments が実装されていません

source: Param Trim Interior Not Implemented
de_de: Param Innen stutzen nicht implementiert
ja_jp: Param Trim Interior が実装されていません

source: Param Trim Start Not Implemented
de_de: Param Anfang stutzen nicht implementiert
ja_jp: Param Trim Start が実装されていません

source: Param Trim End Not Implemented
de_de: Param Ende stutzen nicht implementiert
ja_jp: Param Trim End が実装されていません

source: Parm Trim Not Implemented
de_de: Param Stutzen nicht implementiert
ja_jp: Parm Trim が実装されていません

source: unable to convert PolyCurve to NURBS curve.
de_de: PolyCurve kann nicht in NURBS-Kurve konvertiert werden.
ja_jp: ポリカーブを NURBS 曲線に変換できません。

source: Get Length Not Implemented
de_de: Abrufen von Länge nicht implementiert
ja_jp: Get Length が実装されていません

source: Could not make edge from curve
de_de: Kante konnte nicht aus Kurve erstellt werden.
ja_jp: 曲線からエッジを作成できませんでした

source: Could not determine is polycurve is planar
de_de: Es konnte nicht bestimmt werden, ob die polycurve planar ist.
ja_jp: ポリカーブが平面状であるかどうかを判断できませんでした

source: Could not make EDGE from Curve
de_de: EDGE konnte nicht aus Curve erstellt werden.
ja_jp: 曲線から EDGE を作成できませんでした

source: Could not determine if PolyCurve is planar
de_de: Es konnte nicht bestimmt werden, ob PolyCurve planar ist.
ja_jp: PolyCurve が平面であるかどうかを判断できませんでした

source: Request for Plane of non-planar PolyCurve
de_de: Anforderung für Plane von nicht planarer PolyCurve
ja_jp: 非平面 PolyCurve の Plane の要求

source: Can not close polycurve.
de_de: polycurve kann nicht geschlossen werden.
ja_jp: polycurve を閉じることができません。

source: Can not determine plane of polycurve extension.
de_de: Ebene der Verlängerung der polycurve kann nicht ermittelt werden.
ja_jp: polycurve の延長の平面を決定できません。

source: Could not add length of a full circle or more.
de_de: Länge eines vollständigen Kreises oder mehr konnte nicht hinzugefügt werden.
ja_jp: 完全な円の長さなどを追加できませんでした。

source: Different sign of radii values.
de_de: Unterschiedliche Vorzeichen für Radiuswerte
ja_jp: 半径の値の異なる記号。

source: Could not sweep PolyCurve
de_de: Sweep für PolyCurve nicht möglich
ja_jp: ポリカーブをスイープできませんでした

source: Unable to set edge to consume
de_de: Zu verarbeitende Kante kann nicht festgelegt werden.
ja_jp: 使用するエッジを設定できません

source: Could not make patch surfaces
de_de: Füllflächen konnten nicht erstellt werden.
ja_jp: パッチ サーフェスを作成できませんでした

source: Could not patch PolyCurve
de_de: PolyCurve konnte nicht gefüllt werden.
ja_jp: ポリカーブをパッチできませんでした

source: Could not offset polycurve.
de_de: Polycurve konnte nicht versetzt werden.
ja_jp: ポリカーブをオフセットできませんでした。

source: Could not fillet polycurve.
de_de: Polycurve konnte nicht abgerundet werden.
ja_jp: ポリカーブをフィレットできませんでした。

source: Could not fillet polycurve.
de_de: Polycurve konnte nicht abgerundet werden.
ja_jp: ポリカーブをフィレットできませんでした。

source: Unable divide polycurve equally by length
de_de: Polycurve kann nicht gleichmäßig nach Länge geteilt werden.
ja_jp: polycurve を均等な長さに分割できません

source: input segment length must be greater or equal to zero
de_de: Länge des eingegebenen Segments muss größer oder gleich Null sein
ja_jp: 入力セグメントの長さはゼロ以上でなければなりません

source: Unable divide polycurve equally by distance
de_de: Polycurve kann nicht gleichmäßig nach Abstand geteilt werden.
ja_jp: polycurve を均等な距離に分割できません

source: Unable to divide polycurve equally by distance
de_de: Polycurve kann nicht gleichmäßig nach Abstand geteilt werden.
ja_jp: polycurve を均等な距離に分割できません

source: Unable divide polycurve by length
de_de: Polycurve kann nicht nach Länge geteilt werden.
ja_jp: polycurve を長さで分割できません

source: Cast object is not a Polygon
de_de: Objekt für Umwandlung ist kein Polygon
ja_jp: 投影オブジェクトは Polygon ではありません

source: You must supply more than 2 points to create a polygon
de_de: Sie müssen mehr als 2 Punkte angeben, um ein Polygon zu erstellen.
ja_jp: ポリゴンを作成するには 3 つ以上の点を指定する必要があります

source: There were not enough edges to form a polygon! Some of the vertices may be coincident.
de_de: Es sind nicht genügend Kanten vorhanden, um ein Polygon zu bilden. Einige der Scheitelpunkte fallen möglicherweise zusammen.
ja_jp: ポリゴンを形成するためのエッジが足りません! 一部の頂点が一致していると考えられます。

source: Could not text containment for non-planar polygon
de_de: Textbehälter für nicht planares Polygon konnte nicht erstellt werden.
ja_jp: 非平面ポリゴンの範囲に文字を設定できませんでした

source: Could not text containment for self-intersecting polygon
de_de: Textbehälter für sich selbst schneidendes Polygon konnte nicht erstellt werden.
ja_jp: 自己交差するポリゴンの範囲に文字を設定できませんでした

source: Regular polygon should have 3 or more sides
de_de: Regelmäßiges Polygon muss mindestens 3 Seiten aufweisen
ja_jp: 通常のポリゴンには 3 つ以上の辺が必要です

source: Cast object is not a PolyMesh
de_de: Objekt für Umwandlung ist kein PolyMesh
ja_jp: 投影オブジェクトは PolyMesh ではありません

source: One or more IndexGroups supplied contained an out of bounds vertex index! All IndexGroup indices are zero-based and must be less than the number of vertices supplied.
de_de: Eine oder mehrere der angegebenen IndexGroups enthielt(en) einen Scheitelpunktindex außerhalb des zulässigen Bereichs. Alle IndexGroup-Indizes sind nullbasiert und müssen kleiner sein als die angegebene Scheitelpunktanzahl.
ja_jp: 指定した 1 つまたは複数の IndexGroup には範囲外の頂点インデックスが含まれていました! すべての IndexGroup インデックスをゼロから開始し、指定した頂点の数よりも少なくする必要があります。

source: Cast object is not a PolySurface
de_de: Objekt für Umwandlung ist keine PolySurface
ja_jp: 投影オブジェクトはポリサーフェスではありません

source: The input is not valid
de_de: Die Eingabe ist nicht gültig
ja_jp: 入力が無効です

source: Could not extract FACEs from PolySurface BODY
de_de: Konnte keine FACEs aus BODY von PolySurface extrahieren.
ja_jp: ポリサーフェスから面を抽出できませんでした

source: Error creating PolySurface, BODY has no FACEs
de_de: Fehler beim Erstellen von PolySurface: BODY enthält keine FACEs.
ja_jp: ポリサーフェスの作成中にエラーが発生しました。ボディに面がありません

source: Nonmanifold boundary contains non-EDGEs
de_de: Die nicht-mannigfaltige Begrenzung enthält Nicht-EDGEs.
ja_jp: 非多様体境界にエッジではないものが含まれています

source: Cannot convert base body to double sided
de_de: Basiskörper kann nicht in doppelseitigen Körper konvertiert werden.
ja_jp: 基本ボディを両面に変換できません

source: Cannot convert tool body to double sided
de_de: Werkzeugkörper kann nicht in doppelseitigen Körper konvertiert werden.
ja_jp: ツール ボディを両面に変換できません

source: Unable to stitch Surfaces into a single PolySurface.
de_de: Surfaces können nicht zu einer einzelnen PolySurface zusammengefügt werden.
ja_jp: 単一のポリサーフェスに複数のサーフェスをステッチできません。

source: Not Implemented
de_de: Nicht implementiert
ja_jp: 実装されていません

source: Could not extract EDGEs from PolySurface BODY
de_de: Aus PolySurface-BODY konnten keine EDGEs extrahiert werden.
ja_jp: ポリサーフェス ボデイからエッジを抽出できませんでした

source: Unable to set PolySurface Edges to fillet
de_de: PolySurface Edges für Abrundung können nicht festgelegt werden.
ja_jp: フィレットするポリサーフェス エッジを設定できません

source: Unable to compute fillet
de_de: Abrundung kann nicht berechnet werden.
ja_jp: フィレットを計算できません

source: Unable to set PolySurface Edges to chamfer
de_de: PolySurface Edges für Fase können nicht festgelegt werden.
ja_jp: 面取りするポリサーフェス エッジを設定できません

source: Could not determine parameter of non-manifold Surface
de_de: Parameter für nicht mannigfaltige Oberfläche konnte nicht bestimmt werden.
ja_jp: 非多様体サーフェスのパラメータを決定できませんでした

source: Could not make combined polysurface.
de_de: Kombinierte polySurface konnte nicht erstellt werden.
ja_jp: 結合されたポリサーフェスを作成できませんでした。

source: Could not combine Surfaces
de_de: Surfaces konnten nicht kombiniert werden.
ja_jp: サーフェスを結合できませんでした

source: Error getting faces!
de_de: Fehler beim Abrufen der Flächen
ja_jp: 面の取得中にエラーが発生しました!

source: Error getting edges!
de_de: Fehler beim Abrufen der Kanten
ja_jp: エッジの取得中にエラーが発生しました!

source: Non-uniform transformations on PolySurface is not supported at the moment
de_de: Ungleichmäßige Transformationen für PolySurface werden derzeit nicht unterstützt.
ja_jp: 現在、ポリサーフェスの不均等変換はサポートされていません

source: Unable to loft!
de_de: Keine Erhebung möglich
ja_jp: ロフトできません!

source: Unable to loft to make polysurface!
de_de: Erhebung zum Erstellen von Polysurface nicht möglich
ja_jp: ポリサーフェスをロフトできません!

source: Unable to set sweep profile and path to make Polysurface
de_de: Sweep-Profil und -Pfad zum Erstellen von Polysurface können nicht festgelegt werden.
ja_jp: ポリサーフェスを作成するためのスイープ プロファイルとパスを設定できません

source: Unable to set the result to be not solid to make Polysurface
de_de: Kann Ergebnis nicht als Nicht-Volumenkörper festlegen, um Polysurface zu erstellen.
ja_jp: ポリサーフェスを作成するためには、結果をソリッド以外に設定できません

source: Unable to compute surface sweep on rail to make Polysurface
de_de: Oberflächen-Sweep entlang Führungskurve für Erstellung von Polysurface kann nicht erstellt werden.
ja_jp: ポリサーフェスを作成するためのレール上のサーフェス スイープを計算できません

source: Unable to attach cellular analyzer to Polysurface
de_de: Zellenanalysefunktion kann nicht an Polysurface angehängt werden.
ja_jp: ポリサーフェスにセルラー アナライザをアタッチできません

source: Unable to extract solids from Polysurface
de_de: Volumenkörper können nicht aus Polysurface extrahiert werden.
ja_jp: ポリサーフェスからソリッドを抽出できません

source: Could not project_point on polysurface.
de_de: project_point auf Polysurface nicht möglich.
ja_jp: ポリサーフェスに点を投影できませんでした。

source: Cannot create a PolySurface from an empty list
de_de: Erstellen von PolySurface aus einer leeren Liste nicht möglich
ja_jp: 空のリストからポリサーフェスを作成することはできません

source: Could not make patched polysurface.
de_de: Ausgefüllte Polysurface konnte nicht erstellt werden.
ja_jp: パッチが適用されたポリサーフェスを作成できませんでした。

source: Unable to get edges from polysurface
de_de: Kanten können nicht aus Polysurface abgerufen werden.
ja_jp: ポリサーフェスからエッジを取得できません

source: Input Points don't form a valid Rectangle
de_de: Die eingegebenen Punkte bilden kein gültiges Rectangle.
ja_jp: 入力点が有効な長方形を形成していません

source: Casted object is not a Rectangle
de_de: Umgewandeltes Objekt ist kein Rectangle
ja_jp: 投影されたオブジェクトは Rectangle ではありません

source: Rectangle needs 3 or 4 corner points
de_de: Rechteck benötigt 3 oder 4 Eckpunkte
ja_jp: 長方形 には 3 つまたは 4 つのコーナー点が必要です

source: Cast object is not a Solid
de_de: Objekt für Umwandlung ist kein Solid
ja_jp: 投影オブジェクトはソリッドではありません

source: Cannot facet Solid: it is a wire body
de_de: Solid kann nicht facettiert werden: Er ist ein Drahtkörper.
ja_jp: ソリッドをファセットできません。これはワイヤ ボディです

source: Unable to get volume
de_de: volume kann nicht abgerufen werden.
ja_jp: 体積を取得できません

source: Unable union two Solids
de_de: Zwei Solids können nicht vereinigt werden.
ja_jp: 2 つのソリッドを結合できません

source: Cannot union an empty list
de_de: Vereinigen einer leeren Liste nicht möglich.
ja_jp: 空のリストを結合できません

source: Unable to difference two Solids
de_de: Fehler beim Unterscheiden zweier Solids
ja_jp: 2 つのソリッドを区別できません

source: The resulting solid is either a zero-volume solid or is invalid.
de_de: Der resultierende Volumenkörper ist entweder ein Null-Volumen-Volumenkörper oder ungültig.
ja_jp: 結果として得られるソリッドは、容積がゼロまたは無効です。

source: Cannot difference an empty list
de_de: Leere Liste kann nicht unterschieden werden
ja_jp: 空のリストを区別できません

source: Unable intersect two Solids
de_de: Zwei Volumenkörper können nicht geschnitten werden
ja_jp: 2 つのソリッドを交差できません

source: Unable to set sections for loft!
de_de: Schnitte für Erhebung können nicht festgelegt werden.
ja_jp: ロフトの断面を設定できません

source: Unable to set standard boundary condition at first loft section!
de_de: Vorgabe-Begrenzungsbedingung an erstem Erhebungsschnitt kann nicht festgelegt werden.
ja_jp: ロフトの最初の断面で標準の境界条件を設定できません

source: Unable to set standard boundary condition at last loft section!
de_de: Vorgabe-Begrenzungsbedingung an letztem Erhebungsschnitt kann nicht festgelegt werden.
ja_jp: ロフトの最後の断面で標準の境界条件を設定できません

source: Unable to set the sections or the centerline!
de_de: Festlegen der Schnitte oder der Achse nicht möglich
ja_jp: 断面または中心線を設定できません!

source: Unable to sweep open polycurve: should be closed.
de_de: Sweep für offene polycurve nicht möglich: Muss geschlossen sein.
ja_jp: 開いたポリカーブをスイープすることができません。閉じる必要があります。

source: Unable to sweep non-planar polycurve: should be planar.
de_de: Sweep für nicht planare polycurve nicht möglich: Muss planar sein.
ja_jp: 平面ではないポリカーブをスイープすることができません。平面である必要があります。

source: Unable to set the profile and the path for sweep!
de_de: Profil und Pfad für Sweep können nicht festgelegt werden.
ja_jp: スイープのプロファイルとパスを設定できません!

source: Unable to set the result to be solid or not for sweep!
de_de: Das Ergebnis kann nicht als Volumenkörper oder Nicht-Volumenkörper zur Verwendung beim Sweep festgelegt werden.
ja_jp: スイープの結果をソリッドまたはソリッド以外に設定できません!

source: Unable to set the miter type for sweep!
de_de: Gehrungstyp für Sweep kann nicht festgelegt werden.
ja_jp: スイープのマイター タイプを設定できません!

source: Unable to set whether to retain mergeable edges for sweep!
de_de: Es kann nicht festgelegt werden, ob zusammenführbare Kanten für das Sweep erhalten bleiben sollen.
ja_jp: スイープのマージ可能なエッジを保持するかどうかを設定できません!

source: Unable to set the draft angle for sweep!
de_de: Verjüngungswinkel für Sweep kann nicht festgelegt werden.
ja_jp: スイープの勾配角度を設定できません!

source: Unable to set the gap type for sweep!
de_de: Lückentyp für Sweep kann nicht festgelegt werden.
ja_jp: スイープのギャップ タイプを設定できません!

source: Unable to make solid by sweep
de_de: Erstellen von Volumenkörper durch Sweep nicht möglich
ja_jp: スイープでソリッドを作成できません

source: Empty solid returned by sweep
de_de: Beim Sweeping wurde ein leerer Volumenkörper zurückgegeben.
ja_jp: スイープによって返される空のソリッド

source: Unable to set the profile and the path!
de_de: Profil und Pfad können nicht festgelegt werden.
ja_jp: プロファイルとパスを設定できません!

source: Unable to set miter type!
de_de: Gehrungstyp kann nicht festgelegt werden.
ja_jp: マイター タイプを設定できません

source: Unable to set whether to retain mergeable edges!
de_de: Es kann nicht festgelegt werden, ob zusammenführbare Kanten erhalten bleiben sollen.
ja_jp: マージ可能なエッジを保持するかどうかを設定できません!

source: Unable to set the draft angle!
de_de: Verjüngungswinkel kann nicht festgelegt werden.
ja_jp: 勾配角度を設定できません!

source: Unable to set the gap type!
de_de: Lückentyp kann nicht festgelegt werden.
ja_jp: ギャップ タイプを設定できません!

source: The profile Curve must be planar to perform sweep
de_de: Die Profil-Curve muss planar sein, damit das Sweep möglich ist.
ja_jp: スイープを実行するには、プロファイル曲線が平面状になっている必要があります

source: Unable to update solid by sweep
de_de: Volumenkörper kann nicht mit Sweep aktualisiert werden.
ja_jp: スイープでソリッドを更新できません

source: Thicknesses must be positive
de_de: Werte für Dicke müssen positiv sein
ja_jp: 入力セグメントの長さは 0 より大きくする必要があります

source: Could not set shelling body
de_de: Hüllkörper konnte nicht festgelegt werden.
ja_jp: シェル ボディを設定できませんでした

source: Unable to set the external thickness
de_de: Äußere Dicke kann nicht festgelegt werden.
ja_jp: 外側の厚さを設定できません

source: Unable to set the internal thickness
de_de: Innere Dicke kann nicht festgelegt werden.
ja_jp: 内部の厚さを設定できません

source: Unable to compute shell
de_de: Hülle kann nicht berechnet werden
ja_jp: シェルを計算できません

source: Unable to set Solid Edges to fillet
de_de: Abzurundende Solid Edges können nicht festgelegt werden.
ja_jp: フィレットするソリッド エッジを設定できません

source: Unable to set Solid edges to chamfer
de_de: Zu fasende Solid Edges können nicht festgelegt werden
ja_jp: 面取りするソリッド エッジを設定できません

source: Unable to compute chamfer
de_de: Fase kann nicht berechnet werden.
ja_jp: 面取りを計算できません

source: ByJoinedSurfaces requires at least one Surface
de_de: Für ByJoinedSurfaces ist mindestens eine Oberfläche erforderlich.
ja_jp: ByJoinedSurfaces には少なくとも 1 つのサーフェスが必要です
