Repository: HNANmal/mQ
Catalog: DynamoCoreRuntime_2.13.1.3887/libg_locale/*/LC_MESSAGES/libg.po
Languages: de_de, ja_jp

source: Unable to copy the ENTITY
de_de: Fehler beim Kopieren von ENTITY
ja_jp: 図形をコピーできません

source: cast: object is not of the specified type
de_de: Umwandlung: Objekt entspricht nicht dem angegebenen Typ
ja_jp: 投影: オブジェクトが指定したタイプではありません

source: Unable to multiply Matrix by Vector
de_de: Matrix kann nicht mit Vektor multipliziert werden
ja_jp: マトリックスにベクトルを乗算することはできません

source: Can not get the default history stream!
de_de: Vorgegebener Protokoll-Datenstrom kann nicht abgerufen werden
ja_jp: 既定の履歴ストリームを取得できません

source: Can not get the history stream of an entity!
de_de: Datenstrom eines Objekts kann nicht abgerufen werden
ja_jp: 図形の履歴ストリームを取得できません

source: Unable to add faces to body builder
de_de: Fehler beim Hinzufügen von Flächen im Körper-Builder
ja_jp: ボディ ビルダに面を追加できません

source: Unable to make face body double sided
de_de: Körper für Fläche konnte nicht als doppelseitig definiert werden.
ja_jp: 面ボディを両面にすることができません

source: Unable to make body
de_de: Körper kann nicht erstellt werden.
ja_jp: ボディを作成できません

source: Unable to create planar body
de_de: Planarer Körper kann nicht erstellt werden.
ja_jp: 平面ボディを作成できません

source: Error projecting wire on body
de_de: Fehler beim Projizieren von Draht auf Körper
ja_jp: ボディに対して配線を投影する際にエラーが発生しました

source: Error sweep intersecting wire with body
de_de: Fehler beim Sweeping eines den Körper schneidenden Drahts
ja_jp: 配線とボディを交差するスイープでエラーが発生しました

source: Error projecting Point onto Surface!
de_de: Fehler beim Projizieren des Punkts auf die Oberfläche!
ja_jp: 点をサーフェスに投影する際にエラーが発生しました

source: Error ray testing with body
de_de: Fehler bei Strahltest für Körper
ja_jp: ボディの光線テストでエラーが発生しました

source: Error setting contact is collision
de_de: Fehler beim Einstellen von Kontakt als Kollision
ja_jp: 接点を衝突として設定する際にエラーが発生しました

source: Error computing collisions
de_de: Fehler beim Berechnen der Kollisionen
ja_jp: 衝突の計算中にエラーが発生しました

source: Could not create planar face
de_de: Planare Fläche konnte nicht erstellt werden.
ja_jp: 平面を作成できませんでした

source: Unable to determine if object is non manifold
de_de: Es kann nicht ermittelt werden, ob das Objekt nicht-mannigfaltig ist.
ja_jp: オブジェクトが非多様体かどうかを判断できません

source: Unable to create brep from lump
de_de: Brep aus Lump kann nicht erstellt werden
ja_jp: ソリッドから brep を作成できません

source: Unable to copy the face!
de_de: Fläche kann nicht kopiert werden
ja_jp: 面をコピーできません

source: Error getting the transformation of the face!
de_de: Fehler beim Abrufen der Transformation der Fläche
ja_jp: 面の変換を取得する際にエラーが発生しました

source: Error applying transformation to the copied face!
de_de: Fehler beim Anwenden der Transformation auf die kopierte Fläche
ja_jp: コピーされた面に変換を適用する際にエラーが発生しました

source: Unable to copy the edge!
de_de: Kante kann nicht kopiert werden
ja_jp: エッジをコピーできません

source: Error getting the transformation of the edge!
de_de: Fehler beim Abrufen der Transformation der Kante
ja_jp: エッジの変換を取得する際にエラーが発生しました

source: Error applying transformation to the copied edge!
de_de: Fehler beim Anwenden der Transformation auf die kopierte Kante
ja_jp: コピーされたエッジに変換を適用する際にエラーが発生しました

source: Could not remove attribute from ENTITY
de_de: Attribut konnte nicht aus ENTITY entfernt werden
ja_jp: 図形から属性を削除できませんでした

source: Error adding a named attribute!
de_de: Fehler beim Hinzufügen eines benannten Attributs
ja_jp: 指定された属性を追加する際にエラーが発生しました

source: Error finding attributes for a given name!
de_de: Fehler beim Suchen der Attribute für einen bestimmten Namen
ja_jp: 指定された名前の属性を検索する際にエラーが発生しました

source: Error getting the value of the attribute!
de_de: Fehler beim Abrufen des Werts für das Attribut
ja_jp: 属性値を取得する際にエラーが発生しました

source: Error finding attributes from BODY.
de_de: Fehler beim Suchen von Attributen in BODY.
ja_jp: ボディから属性を検索する際にエラーが発生しました。

source: Error getting the name of the attribute!
de_de: Fehler beim Abrufen des Attributnamens.
ja_jp: 属性の名前を取得する際にエラーが発生しました

source: The number of attributes is not one!
de_de: Die Anzahl der Attribute ist nicht eins
ja_jp: 属性の数が 1 つではありません

source: Error setting the value of the attribute!
de_de: Fehler beim Festlegen des Werts für das Attribut
ja_jp: 属性値の設定中にエラーが発生しました

source: Error setting color attributes!
de_de: Fehler beim Festlegen der Farbattribute
ja_jp: 色の属性を設定する際にエラーが発生しました

source: Failed to approximate curve
de_de: Fehler in der Näherung der Kurve
ja_jp: 曲線の近似化に失敗しました

source: Casted object is not an Arc
de_de: Umgewandeltes Objekt ist kein Arc
ja_jp: 投影されたオブジェクトは Arc ではありません

source: Error creating an arc!
de_de: Fehler beim Erstellen eines Bogens
ja_jp: 円弧の作成中にエラーが発生しました

source: Error creating an arc! Start angle cannot be the same as end angle
de_de: Fehler beim Erstellen von Bogen Start- und Endwinkel dürfen nicht identisch sein
ja_jp: 円弧の作成中にエラーが発生しました 開始角度と終了角度を同じにすることはできません

source: Error creating an arc! Sweep angle must be non-zero
de_de: Fehler beim Erstellen des Bogens. Sweep-Winkel muss ungleich Null sein
ja_jp: 円弧を作成する際にエラーが発生しました スイープ角度をゼロにすることはできません

source: Cannot create an Arc with the given input points.
de_de: Mit den angegebenen Eingabepunkten kann kein Bogen erstellt werden.
ja_jp: 指定された入力点では円弧を作成できません。

source: Cannot create an Arc with a null input object.
de_de: Bogen kann nicht mit Null-Eingabeobjekt erstellt werden.
ja_jp: 入力オブジェクトが NULL の円弧を作成できません。

source: Unable to extend curve equally. Curves differ by:
de_de: Curve konnte nicht auf gleiche Weise verlängert werden. Die Curves unterscheiden sich um:
ja_jp: 曲線を均等に延長できません。曲線の長さの差:

source: Arc by fillet: ends of curves on equal distance, could not orient arc. Please trim curves to determine orientation based on closest ends
de_de: Arc by fillet: Enden der Kurven im gleichen Abstand. Der Bogen kann nicht ausgerichtet werden. Stutzen Sie die Kurven, damit die Ausrichtung anhand der nächstgelegenen Enden ermittelt werden kann.
ja_jp: Arc by fillet: 曲線の終端が同じ距離にあるため、円弧の向きを設定できませんでした。直近の終端に基づいて方向を設定するには、curves をトリムしてください

source: Arc by fillet failed
de_de: Fehler bei Arc by fillet
ja_jp: Arc by fillet が失敗しました

source: Arc by fillet could not be computed
de_de: Bogen nach Abrundung konnte nicht berechnet werden.
ja_jp: Arc by fillet を計算できませんでした

source: Arc by by_fillet_tangent_to_curve failed
de_de: Arc by by_fillet_tangent_to_curve fehlgeschlagen
ja_jp: Arc by by_fillet_tangent_to_curve が失敗しました

source: could not solve for arc
de_de: Auflösung nicht möglich für Bogen
ja_jp: 円弧を求めることができませんでした

source: Arc by by_best_fit needs 3 or more points
de_de: Für Arc by by_best_fit sind mindestens 3 Punkte erforderlich.
ja_jp: Arc by by_best_fit には 3 つ以上の点が必要です

source: Arc by by_best_fit could not determine plane for arc
de_de: Ebene für Bogen mit Arc by by_best_fit konnte nicht ermittelt werden.
ja_jp: Arc by by_best_fit では円弧の平面を決定できませんでした

source: tangent vectors should be coplanar relatie to points to make bi_arc
de_de: Zum Erstellen von bi_arc müssen Tangentenvektoren koplanar zu den Punkten liegen.
ja_jp: bi_arc を作成するには、接線ベクトルを点と同一平面にする必要があります

source: Cannot build bi arc for coincident lines
de_de: Bi-Arc für zusammenfallende Linien kann nicht erstellt werden.
ja_jp: 線分が一致する場合は、二重円弧を作成できません

source: Cannot build bi arc facing corner of tangent intersections
de_de: Bi-Arc mit Richtung auf Ecke von Tangentenschnittpunkten kann nicht erstellt werden.
ja_jp: 接線の交点の二重円弧が接するコーナーを作成できません

source: Error creating arc! End point lies in direction of Tangent vector
de_de: Fehler beim Erstellen des Bogens! Endpunkt liegt in Richtung des Tangentenvektors
ja_jp: 円弧の作成中にエラーが発生しました 終点が接線ベクトルの方向に指定されています

source: Unable to create a BoundingBox around the input Geometry
de_de: BoundingBox um die eingegebene Geometry kann nicht erstellt werden.
ja_jp: 入力されたジオメトリの周囲に BoundingBox を作成できません

source: Unable to create a BoundingBox around the input Geometries
de_de: BoundingBox um die eingegebenen Geometries kann nicht erstellt werden.
ja_jp: 入力されたジオメトリの周囲に BoundingBox を作成できません

source: Bounding box cannot be created because no geometries were provided
de_de: Begrenzungsrahmen kann nicht erstellt werden, da keine Geometrien angegeben wurden
ja_jp: ジオメトリが提供されなかったため、境界ボックスを作成できません

source: Unable to get the maximum x value.
de_de: Fehler beim Abrufen des maximalen X-Werts
ja_jp: X の最大値を取得できません。

source: Unable to get the minimum x value.
de_de: Fehler beim Abrufen des minimalen X-Werts
ja_jp: X の最小値を取得できません。

source: Unable to get the maximum y value.
de_de: Fehler beim Abrufen des maximalen Y-Werts
ja_jp: Y の最大値を取得できません。

source: Unable to get the minimum y value.
de_de: Fehler beim Abrufen des minimalen Y-Werts
ja_jp: Y の最小値を取得できません。

source: Unable to get the maximum z value.
de_de: Fehler beim Abrufen des maximalen Z-Werts
ja_jp: Z の最大値を取得できません。

source: Unable to get the minimum z value.
de_de: Fehler beim Abrufen des minimalen Z-Werts
ja_jp: Z の最小値を取得できません。

source: Casted object is not a BSplineCurve
de_de: Umgewandeltes Objekt ist keine BSplineCurve
ja_jp: 投影されたオブジェクトは B スプライン曲線ではありません

source: NurbsCurves require degree to be greater than 0
de_de: Der Grad von NurbsCurves muss größer als 0 sein
ja_jp: NURBS 曲線では次数を 0 より大きくする必要があります

source: NurbsCurves require at least 2 points for interpolation
de_de: Bei NurbsCurves sind mindestens 2 Punkte für die Interpolation erforderlich
ja_jp: NurbsCurve では、少なくとも 2 つの補間点が必要です

source: Unable to fit curve to points
de_de: Kurve kann nicht in an Punkte angepasst werden
ja_jp: 曲線を点にフィットできません

source: Unable to get curves from curve fit
de_de: Fehler beim Abrufen der Kurven aus der Kurvenanpassung
ja_jp: 曲線フィットから曲線を取得できません

source: Error creating a nurbs curve!
de_de: Fehler beim Erstellen einer Nurbs-Kurve.
ja_jp: NURBS 曲線を作成する際にエラーが発生しました

source: NurbsCurves must have at least one more control points than degree
de_de: Für NurbsCurves sind mindestens Grad + 1 Steuerpunkte erforderlich.
ja_jp: NurbsCurve には次数より少なくとも 1 つ多い制御点が必要です

source: Unable to create BSplineCurve from vertices
de_de: BSplineCurve kann nicht aus Scheitelpunkten erstellt werden
ja_jp: 頂点から BSplineCurve を作成できません

source: Unable to convert asm_curve to BSplineCurve
de_de: asm_curve kann nicht in BSplineCurve konvertiert werden
ja_jp: asm_curve を BsplineCurve に変換できません

source: Negative extension not supported
de_de: Negative Erweiterung wird nicht unterstützt.
ja_jp: 負の拡張はサポートされていません

source: Could not extend start of the nurbs curve
de_de: Anfang der Nurbs-Kurve konnte nicht verlängert werden
ja_jp: NURBS 曲線の始点を延長できませんでした

source: Casted object is not a BSplineSurface
de_de: Umgewandeltes Objekt ist keine BSplineSurface
ja_jp: 投影されたオブジェクトは BSplineSurface ではありません

source: Unable to get the FACE's range for NurbsSurface.
de_de: FACE-Bereich der NurbsSurface konnte nicht abgerufen werden.
ja_jp: NURBS サーフェスの面の範囲を取得できません。

source: Underlying Face of Nurbs Surface is null!
de_de: Zugrunde liegende Fläche der Nurbs-Oberfläche ist Null.
ja_jp: NURBS サーフェスの基礎となる面が NULL です

source: Unable to create surface from points
de_de: Erstellen von surface aus Punkten nicht möglich
ja_jp: 点から surface を作成できません

source: Unable to create surface from points and tangents
de_de: Erstellen von surface aus Punkten und Tangenten nicht möglich
ja_jp: 点と接線から surface を作成できません

source: NurbsSurfaces must have at least one more control points than degree
de_de: Für NurbsSurfaces sind mindestens Grad + 1 Steuerpunkte erforderlich.
ja_jp: NurbsSurface には次数より少なくとも 1 つ多い制御点が必要です

source: Unable to create NurbsCurve from control points.
de_de: Erstellen von NurbsCurve aus Steuerpunkten nicht möglich
ja_jp: 制御点から NurbsCurve を作成できません。

source: Unable to create face from spline
de_de: Erstellen von Fläche aus Spline nicht möglich
ja_jp: スプラインから面を作成できません

source: Casted object is not a Circle
de_de: Umgewandeltes Objekt ist kein Circle
ja_jp: 投影されたオブジェクトは円ではありません

source: Arc by by_best_fit could not best fit arc
de_de: Ausgleichseinrechnung für Arc by by_best_fit nicht möglich
ja_jp: Arc by by_best_fit では最適フィット円弧を作成できませんでした

source: Circle radius must be non-zero
de_de: Kreisradius muss ungleich Null sein
ja_jp: 円の半径をゼロにすることはできません

source: Error creating a circle!
de_de: Fehler beim Erstellen eines Kreises!
ja_jp: 円の作成中にエラーが発生しました

source: Circle normal must be non-zero
de_de: Kreisnormale muss ungleich Null sein
ja_jp: 円の法線の値をゼロにすることはできません

source: Circle major-axis must be non-zero
de_de: Kreishauptachse darf nicht null sein
ja_jp: 円の主軸の値をゼロにすることはできません

source: Casted object is not a Cone
de_de: Umgewandeltes Objekt ist kein Cone
ja_jp: 投影されたオブジェクトは円錐ではありません

source: Error getting edges
de_de: Fehler beim Abrufen von Kanten
ja_jp: エッジの取得中にエラーが発生しました

source: Error getting vertices
de_de: Fehler beim Abrufen der Scheitelpunkte
ja_jp: 頂点の取得中にエラーが発生しました

source: Unable to set attrubitues on Cone
de_de: Attribute für Cone können nicht festgelegt werden.
ja_jp: 円錐に属性を設定できません

source: Unable to create cone or cylinder
de_de: cone oder cylinder kann nicht erstellt werden.
ja_jp: 円錐または円柱を作成できません

source: Unable to transform the body!
de_de: Körper kann nicht transformiert werden.
ja_jp: ボディを変換できません!

source: Unable to find attributes after transformation
de_de: Attribute wurden nach der Transformation nicht gefunden.
ja_jp: 変換後に属性が見つかりません

source: Could not get point from vertex
de_de: Punkt konnte nicht aus Scheitelpunkt abgerufen werden.
ja_jp: 頂点から点を取得できませんでした

source: Cast object is not a CoordinateSystem
de_de: Objekt für Umwandlung ist kein CoordinateSystem
ja_jp: 投影オブジェクトは CoordinateSystem ではありません

source: Error creating coordinate system from raw data
de_de: Fehler beim Erstellen von Koordinatensystem aus Rohdaten
ja_jp: 未処理データから座標系を作成する際にエラーが発生しました

source: Cast object is not a Cuboid
de_de: Objekt für Umwandlung ist kein Cuboid
ja_jp: 投影オブジェクトは Cuboid ではありません

source: Error getting vertices!
de_de: Fehler beim Abrufen der Scheitelpunkte
ja_jp: 頂点の取得中にエラーが発生しました!

source: Could not construct Cuboid vertices
de_de: Scheitelpunkte für Cuboid konnten nicht erstellt werden.
ja_jp: 直方体の頂点を作成できませんでした

source: Unable to create block
de_de: Block kann nicht erstellt werden.
ja_jp: ブロックを作成できません

source: Could not get Cuboid vertices after transform
de_de: Scheitelpunkte für Cuboid konnten nach Transformation nicht abgerufen werden.
ja_jp: 変換後に直方体の頂点を取得できませんでした

source: Cast object is not a Curve
de_de: Objekt für Umwandlung ist keine Curve
ja_jp: 投影オブジェクトは曲線ではありません

source: Could not test curve equality
de_de: Kurvengleichheit konnte nicht getestet werden
ja_jp: 曲線の均等性をテストできませんでした

source: Unable to find point perpendicular to given point on curve
de_de: Punkt lotrecht zu angegebenem Punkt auf der Kurve kann nicht gefunden werden
ja_jp: 指定された曲線上の点と直交する点が見つかりません

source: Unable to compute tangent at curve
de_de: Tangente an curve kann nicht berechnet werden.
ja_jp: curve で接線を計算できません

source: Unable to compute Curve point at parameter
de_de: Kurvenpunkt an Parameter kann nicht berechnet werden
ja_jp: パラメータで曲線点を計算できません

source: Not implemented
de_de: Nicht implementiert
ja_jp: 実装されていません

source: Curve has infinite length
de_de: Kurve mit unbegrenzter Länge
ja_jp: 曲線で無限の長さが指定されています

source: Unable to query edges from curve
de_de: Kanten können nicht von der Kurve abgerufen werden
ja_jp: 曲線でエッジのクエリーを実行できません

source: Unable to make wire from edge body
de_de: Erstellen von Draht aus Kantenkörper nicht möglich
ja_jp: エッジのボディからワイヤを作成できません

source: Unable to create coedge array
de_de: coedge-Reihe kann nicht erstellt werden.
ja_jp: 共有エッジ配列を作成できません

source: Unable to determine if curve is planar
de_de: Es kann nicht ermittelt werden, ob die Kurve planar ist.
ja_jp: 曲線が平面であるかどうかを判断できません

source: Curve is not planar: cannot get Curve normal.
de_de: Kurve ist nicht planar: Kurvennormale kann nicht abgerufen werden.
ja_jp: 曲線が平面ではないため、曲線の法線を取得できません。

source: Could not approximate curve
de_de: Näherungswert für Kurve konnte nicht erstellt werden
ja_jp: 曲線を近似化できませんでした

source: Unable to set extrusion wire
de_de: Draht für Extrusion konnte nicht festgelegt werden.
ja_jp: 押し出しワイヤを設定できません

source: Unable to compute extrude curve
de_de: Extrusionskurve kann nicht berechnet werden
ja_jp: 押し出し曲線を計算できません

source: Unable to convert sheet to double sided
de_de: Plan kann nicht doppelseitig gemacht werden
ja_jp: シートを両面シートに変換できません

source: Cannot create a Solid from an open Curve
de_de: Aus einer offenen Curve kann kein Solid erstellt werden
ja_jp: 開いている曲線からソリッドを作成することはできません

source: Unable to set Curve and Vector for extrusion.
de_de: Curve und Vector für Extrusion können nicht festgelegt werden.
ja_jp: 曲線とベクトルを押し出し用に設定できません。

source: Unable to instruct ASM to extrude Curve as a Solid.
de_de: ASM kann nicht zum Extrudieren der Curve als Solid angewiesen werden.
ja_jp: ASM に対して、曲線をソリッドとして押し出すように指示することができません。

source: Unable to extrude curve.
de_de: Kurve kann nicht extrudiert werden.
ja_jp: 曲線を押し出すことができません。

source: Extrusion computed but cannot determine result type
de_de: Extrusion berechnet, aber Ergebnistyp kann nicht bestimmt werden
ja_jp: 押し出しが計算されましたが、結果のタイプを判断できません

source: Unable to set sweep profile and path
de_de: Sweep-Profil und -Pfad können nicht eingestellt werden
ja_jp: レール上のサーフェス スイープを計算できません

source: Unable to set the result to be solid or not!
de_de: Es kann nicht festgelegt werden, ob das Ergebnis ein Volumenkörper sein soll.
ja_jp: 結果をソリッドまたはソリッド以外に設定できません!

source: Unable to compute surface sweep on rail
de_de: Oberflächen-Sweep entlang Führungskurve kann nicht berechnet werden
ja_jp: 近似したサーフェスを作成することができません

source: Unable to revolve curve
de_de: Kurve kann nicht gedreht werden
ja_jp: 曲線を回転できません

source: Unable to set as solid or not
de_de: Kann nicht als Volumenkörper oder Nicht-Volumenkörper festgelegt werden.
ja_jp: ソリッドまたはソリッド以外に設定できません

source: Unable to set as double sided
de_de: Kann nicht als doppelseitig definiert werden
ja_jp: 両面として設定できません

source: Unable to retain mergeable edges
de_de: Zusammenführbare Kanten können nicht beibehalten werden
ja_jp: マージ可能なエッジを保持できません

source: Unable to compute revolve
de_de: Rotationskörper kann nicht berechnet werden
ja_jp: 回転を計算できません

source: Unable to convert Curve to NURBS curve.
de_de: Kurve kann nicht in NURBS-Kurve konvertiert werden.
ja_jp: 曲線を NURBS 曲線に変換できません。

source: Unable to offset curve
de_de: Kurve kann nicht versetzt werden.
ja_jp: 曲線をオフセットできません

source: Unable to get edge from wire
de_de: Fehler beim Abrufen der Kante aus dem Draht
ja_jp: 配線からエッジを取得できません

source: WireCurve does not support wires with more than one edge
de_de: WireCurve unterstützt keine Drähte mit mehr als einer Kante
ja_jp: WireCurve は、1 つ以上のエッジを含むワイヤをサポートしません

source: Unable to extract curve from edge
de_de: curve kann nicht aus curve extrahiert werden.
ja_jp: エッジから曲線を抽出できません

source: Curve geometry is degenerate or invalid
de_de: Kurvengeometrie ist ungültig oder unzulässig.
ja_jp: 曲線ジオメトリが縮退しているか無効です

source: Unable to blend between curves
de_de: Verschmelzung zwischen Kurven nicht möglich
ja_jp: 曲線間をブレンドできません

source: Unable to make parameter line on surface
de_de: Parameterlinie kann nicht auf Fläche erstellt werden
ja_jp: サーフェス上にパラメータ線分を作成できません

source: Unable to make geodesic curves with ASM 219
de_de: Erstellen geodätischer Kurven mit ASM 219 nicht ist nicht möglich.
ja_jp: ASM 219 を使用して測地曲線を作成できません

source: Unable to make iso curve on surface
de_de: Isokurve kann nicht auf Oberfläche erstellt werden
ja_jp: サーフェス上にアイソ曲線を作成できません

source: Unable to project curve on plane
de_de: Kurve kann nicht auf Ebene projiziert werden
ja_jp: 平面上に曲線を投影できません

source: Unable to compute Curve projection on Surface
de_de: Kurvenprojektion auf Oberfläche kann nicht berechnet werden
ja_jp: サーフェス上で曲線の投影を計算できません

source: Unable to pull Curve onto Surface
de_de: Kurve kann nicht auf Oberfläche gezogen werden
ja_jp: サーフェスに曲線をプルできません

source: Unable to make geodesic curves
de_de: Geodätische Kurven können nicht erstellt werden
ja_jp: 測地曲線を作成できません

source: Unable to approximate curve with arc and line segments
de_de: Näherung für Kurve aus Bogen- und Liniensegmenten kann nicht erstellt werden
ja_jp: 円弧セグメントと線分セグメントで曲線を近似化できません

source: Conversion to Arcs and Lines failed, some parts of Curve could not be converted
de_de: Konvertierung in Arcs und Lines fehlgeschlagen, einige Teile der Curve konnte nicht konvertiert werden
ja_jp: 円弧と線分への変換が失敗しました。曲線の一部を変換できませんでした

source: Curve must be divided into one or more parts
de_de: Kurve muss in einen oder mehrere Teile unterteilt werden
ja_jp: 曲線を 1 つまたは複数の部分に分割する必要があります

source: Unable to divide infinite curve equally by length
de_de: Unendliche Kurve kann nicht gleichmäßig durch Länge geteilt werden
ja_jp: 無限曲線を均等な長さに分割することはできません

source: Unable to divide curve equally by length
de_de: Kurve kann nicht gleichmäßig durch Länge geteilt werden
ja_jp: 曲線を均等な長さに分割できません

source: Input segment length must be greater than 0
de_de: Länge des Eingabesegments muss größer als 0 sein
ja_jp: 入力セグメントの長さは 0 より大きくする必要があります

source: Unable to divide infinite curve by length
de_de: Unendliche Kurve kann nicht durch Länge geteilt werden
ja_jp: 無限曲線を一定の長さで分割することはできません

source: Unable to divide infinite curve equally by distance
de_de: Unendliche Kurve kann nicht gleichmäßig durch Abstand geteilt werden
ja_jp: 無限曲線を均等な距離に分割することはできません

source: Unable to divide curve equally by distance
de_de: Kurve kann nicht gleichmäßig durch Abstand geteilt werden
ja_jp: 曲線を均等な距離に分割できません

source: could not solve for equal distances
de_de: Lösung nicht möglich für gleiche Abstände
ja_jp: 等距離を求めることができませんでした

source: could not solve for equal chord lengths
de_de: Lösung nicht möglich für gleiche Sehnenlängen
ja_jp: 等しい弦の長さを求めることができませんでした

source: Unable to divide curve by distance
de_de: Kurve kann nicht durch Abstand geteilt werden
ja_jp: 曲線を一定の距離で分割することはできません

source: Cannot simplify Curve
de_de: Kurve kann nicht vereinfacht werden
ja_jp: 曲線を単純化できません

source: Cannot simplify a curve below 1.0e-9 tolerance
de_de: Kurve kann nicht mit Toleranz unter 1.0e-9 Toleranz vereinfacht werden
ja_jp: 1.0e-9 未満の許容値で曲線を単純化することはできません

source: Unable to approximate simplified spline
de_de: Näherung für vereinfachten Spline nicht möglich
ja_jp: 簡略化されたスプラインを近似化できません

source: Unable to simplify spline
de_de: Spline kann nicht vereinfacht werden
ja_jp: スプラインを簡略化できません

source: Casted object is not a Cylinder
de_de: Umgewandeltes Objekt ist kein Cylinder
ja_jp: 投影されたオブジェクトは円柱ではありません

source: Cast object is not a Ellipse
de_de: Objekt für Umwandlung ist keine Ellipse
ja_jp: 投影オブジェクトは楕円ではありません

source: Error creating an ellipse! Ellipse radius must be non-zero
de_de: Fehler beim Erstellen einer Ellipse Radius der Ellipse muss ungleich Null sein
ja_jp: 楕円の作成中にエラーが発生しました 楕円の半径をゼロにすることはできません

source: Error creating an ellipse!
de_de: Fehler beim Erstellen einer Ellipse!
ja_jp: 楕円の作成中にエラーが発生しました

source: Casted object is not an EllipseArc
de_de: Umgewandeltes Objekt ist kein EllipseArc
ja_jp: 投影されたオブジェクトは EllipseArc ではありません

source: EllipseArc radius must be non-zero
de_de: Radius von EllipseArc muss ungleich Null sein
ja_jp: 楕円弧の半径をゼロにすることはできません

source: EllipseArc sweep angle must be non-zero
de_de: Sweep-Winkel von EllipseArc muss ungleich Null sein
ja_jp: 楕円弧のスイープ角度をゼロにすることはできません

source: Unexpected error creating the EllipseArc!
de_de: Unerwarteter Fehler beim Erstellen von EllipseArc!
ja_jp: EllipseArc の作成中に予期しないエラーが発生しました

source: Cast object is not Geometry
de_de: Objekt für Umwandlung ist keine Geometry
ja_jp: 投影オブジェクトは Geometry ではありません

source: Could not find distance.
de_de: Abstand wurde nicht gefunden.
ja_jp: 距離が見つかりませんでした。

source: Unable to create intersection boolean
de_de: Boolean für Schnittpunkt kann nicht erstellt werden.
ja_jp: 交点の boolean を作成できません

source: Unable to slice bodies
de_de: Körper können nicht segmentiert werden.
ja_jp: ボディをスライスできません

source: Unable to transform the entity!
de_de: Objekt kann nicht transformiert werden.
ja_jp: 図形を変換できません

source: Unable to get EDGEs while decomposing BODY
de_de: Fehler beim Abrufen der EDGEs beim Zerlegen von BODY
ja_jp: BODY の分解中は EDGE を取得できません
