Autodesk.DesignScript.Geometry.BoundingBox.ToString
Ruft eine Zeichenfolgendarstellung der BoundingBox ab

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Vergleich der zwei BoundingBoxes
other: Die andere BoundingBox
Returns: Gibt an, ob diese zwei Objekte gleich sind

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
Ruft einen Hashcode für diesen Typ ab
Returns: Ein eindeutiger Hashcode für dieses Objekt

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
Erstellt einen an der Achse ausgerichteten BoundingBox um die eingegebene Geometrie.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
Erstellt einen nicht an Achsen ausgerichteten BoundingBox um die eingegebene Geometrie, ausgerichtet an den X-, Y- und Z-Achsen des CoordinateSystem.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
Erstellt einen nicht an Achsen ausgerichteten BoundingBox um die eingegebenen Geometrien, ausgerichtet an den X-, Y- und Z-Achsen des CoordinateSystem.
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
Erstellt einen BoundingBox vom minimalen (linke untere hintere Ecke des Quaders) zum maximalen Koordinatenwert (obere rechte vordere Ecke des Quaders). Das CoordinateSystem ist die Transformation aus dem Koordinatenraum des Begrenzungsrahmens in den Modellraum. Diese Methode wurde in Übereinstimmung mit der API von Revit entwickelt und ermöglicht die Extraktion der Parameter aus einem BoundingBox von Revit ohne Konvertierungen.
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
Das CoordinateSystem, in dem dieser BoundingBox definiert ist

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Ruft den Schnittbereich zweier BoundingBoxes ab.
other: Anderer zu schneidender Begrenzungsrahmen
Returns: Begrenzungsrahmen, der aus dem Schnittpunkt der Begrenzungsrahmen ermittelt wurde

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Bestimmt, ob zwei BoundingBoxes einander schneiden.
other: Anderer Begrenzungsrahmen
Returns: Schnittpunkte der Begrenzungsrahmen ermitteln
get overlap