Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
Registrierungsmechanismus für Geometrietyp.
hostType: Typ der von IGeometryEntity abgeleiteten Schnittstellen.
contructor: Ein Delegat zum Konstruieren von Geometrie.

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
Verschiebt Geometrie um die Länge des Vektors in die angegebene Richtung.
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Verschiebt Geometrie beliebigen Typs um die angegebenen Entfernung in die angegebene
Richtung.
direction: Richtung der Verschiebung
distance: Strecke der Verschiebung in der angegebenen Richtung
Returns: Transformierte Geometrie.
move,along vector,distance

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transformiert Geometrie unter Verwendung der Transformation des angegebenen CoordinateSystem
Returns: Transformierte Geometrie

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Transformiert diese Geometrie aus dem Quell-CoordinateSystem in das
CoordinateSystem eines neuen Kontexts.
Returns: Transformierte Geometrie.
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Dreht ein Objekt um einen angegebenen Winkel in Grad um einen Ursprung und eine
Achse.
around,axis,degrees

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Dreht ein Objekt um einen angegebenen Winkel in Grad um den Ursprung und die Normale der
Ebene.
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
Skaliert ungleichmäßig vom Ursprung aus.
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Skaliert ungleichmäßig von der angegebenen Ebene aus.
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Skaliert unter Verwendung zweier Auswahlpunkte als Skalare gleichmäßig von einem bestimmten Punkt aus.
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Skaliert eindimensional anhand von Basis und 2 Auswahlpunkten. Die Skalierungsachse wird durch die Linie zwischen Basis und Punkt definiert.
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Skaliert zweidimensional anhand von Basis und 2 Auswahlpunkten. Die beiden Auswahlpunkte werden auf die Basisebene projiziert, um die 2D-Skalierungsfaktoren zu ermitteln.
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
Ruft den Abstand zwischen dieser und anderer Geometrie ab.
other: Die andere Geometrie
Returns: Der Abstand
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
Ermittelt den der anderen Geometrie am nächsten liegenden Punkt auf dieser Geometrie.
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
Ermittelt, ob ein anderes Geometrieobjekt das angegebene schneidet.
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
Ruft die Geometrie der Überschneidung dieses Objekts mit einem anderen ab.
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Ruft die Überschneidung der Geometrie dieses Objekts und einer Sammlung anderer Geometrien ab. Ermittelt die allen beteiligten Objekten gemeinsame Geometrie.
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
Teilt diese Geometrie mithilfe anderer Geometrie als "Schnittwerkzeug".
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
Überprüft, ob die beiden Objekte dieselbe Darstellungsgeometrie oder dieselben numerischen Werte aufweisen.
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
Ruft den BoundingBox mit dem angegebenen Geometrieelement ab.
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
Geometrie in Volumenkörperdef.-json konvertieren
Returns: Json-formatierte Zeichenfolge

Autodesk.DesignScript.Geometry.Geometry.FromSolidDef(System.String)
Importiert eine Json-Zeichenfolge und gibt ein Array aus importierten Geometrien aus
solidDefJson: Json­-Zeichenfolge mit Volumenkörperdef.-formatierter Geometrie
Returns: Liste der konvertierten Geometrien

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
Exportiert die angegebene Geometrie in den angegebenen Pfad für die SAT-Datei.
filePath: Der Name der Datei, in die die Geometrie exportiert werden soll.

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
Exportiert die angegebene Geometrie in den angegebenen Pfad für die SAT-Datei
filePath: Der Name der Datei, in die die Geometrie exportiert werden soll
unitsMM: Die zu verwendenden Einheiten

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
Serialisiert die angegebene Geometrie im Standard-ACIS-Binärformat (SAB-Datei), und gibt serialisierte Binär-Stream-Daten zurück.

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
Ruft das Kontext-/Referenzkoordinatensystem ab, das zur Erstellung dieser Geometrie verwendet wurde.