Autodesk.DesignScript.Geometry.Helix.ToString
Ruft eine Zeichenfolgendarstellung der Spirale ab

Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Erstellt eine Schraubenform. Die Schraube dreht sich immer im Uhrzeigersinn um die angegebene Achsenrichtung. Bei Betrachtung entlang der Achsenrichtung ist der Punkt zu sehen, der bei der Bewegung entlang der Kurve in Richtung zunehmender Parameterwerte die Achse im Uhrzeigersinn umkreist. Die Steigung ist die auf der Schraube zurückgelegte Entfernung in Achsenrichtung pro Umdrehung. Dieser Wert kann positiv oder negativ sein.
axisPoint: Achsenpunkt
axisDirection: Achsenrichtungsvektor
startPoint: Helix-Startpunkt
pitch: Abstand der Helix pro 360 Grad in Richtung der Achse
angleTurns: Anzahl der Umdrehungen in Grad
Returns: Durch Achse erstellte Helix
helix,screw,corkscrew,thread