Autodesk.DesignScript.Geometry.Surface.ToString
Ruft eine Zeichenfolgendarstellung der Oberfläche ab

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Vereinigt eine Sammlung von Flächen zu einer einzigen Fläche. Diese Methode kann eine PolySurface zurückgeben, wenn die Vereinigung mehrflächig oder nicht mannigfaltig ist.
surfaces: Eine Sammlung von Flächen.
Returns: Flächenvereinigung
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Erstellt eine Oberfläche durch Erhebung zwischen den eingegebenen Querschnittskurven.
crossSections: Für Erhebung zu verwendende Kurven
Returns: Durch die Erhebung erstellte Oberfläche
loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
Erstellt eine Oberfläche durch Erhebung zwischen den eingegebenen Querschnittslinien. Dieser Vorgang läuft etwas schneller ab und liefert ein weniger glattes Ergebnis als Surface.ByLoft.
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Erhebung einer Oberfläche durch die Querschnitte mithilfe einer angegebenen Führungskurve. Die Führungskurve muss alle Querschnittskurven schneiden.
loftbyrail

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Erhebung einer Oberfläche durch die Querschnitte mithilfe angegebener Führungskurven. Die Führungskurven müssen alle Querschnittskurven schneiden.
crossSections: Für Erhebung zu verwendende Kurven
guideCurves: Für die Führung der Erhebung zu verwendende Kurven
Returns: Durch die Erhebung erstellte Oberfläche
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Erstellt eine Oberfläche als Sweep einer Querschnittskurve an einem Pfad entlang.
profile: Zu sweepende Kurve
path: Verwendete Pfadkurve für Sweeping
Returns: Durch Sweeping-Profil entlang Pfad erstellte Oberfläche
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Erstellt eine Polygonoberfläche durch Verbinden der eingegebenen Punkte zu einem geschlossenen Polygon und Auffüllen des Polygons.
points: Liste der Umfangspunkte
Returns: Aus Umfangspunkten erstellte Oberfläche
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Erstellt eine Oberfläche als Sweep der Profilkurve um den vom Ursprungspunkt in Richtung des Achsenvektors ausgehenden Achsenstrahl vom start_angle in Grad bis zum sweep_angle in Grad.
profile: Zu rotierende Profilkurve
axisOrigin: Ursprung der rotierenden Achse
axisDirection: Richtung der rotierenden Achse
startAngle: Startwinkel in Grad
sweepAngle: Sweeping-Winkel in Grad
Returns: Durch Profildrehung erstellte Oberfläche
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Erstellt eine Oberfläche durch Ausfüllen des Bereichs innerhalb einer durch die eingegebenen Kurven definierten geschlossenen Begrenzung.
closedCurve: Als Oberflächenbegrenzung verwendete geschlossene Kurve
Returns: Durch Füllung erstellte Oberfläche
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Die boolesche Differenz zwischen dieser Fläche und der Vereinigung der eingegebenen Flächen. Diese Methode kann eine PolySurface zurückgeben, wenn der boolesche Ergebniswert mehrflächig oder nicht mannigfaltig ist.
others: Andere abzuziehende Flächen
Returns: Resultierende boolesche Oberfläche oder polySurface
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Stutzt die Fläche mit einer Sammlung von mindestens einer Kontur innerhalb der eingegebenen Fläche. Eine der Konturen muss die Begrenzungskontur der eingegebenen Fläche sein. Zusätzlich muss mindestens eine Kontur für Löcher hinzugefügt werden.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
Ruft eine Nurbs-Darstellung der Oberfläche ab. Mithilfe dieser Methode können in bestimmten Fällen Annäherungen an Oberflächen erstellt werden.

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Ruft eine Nurbs-Darstellung der Oberfläche innerhalb des angegebenen Toleranzbereichs ab. Mithilfe dieser Methode können in bestimmten Fällen Annäherungen an Oberflächen erstellt werden.
tolerance: Vorgegebene Toleranz
Returns: NURBS-Oberflächendarstellung der Oberfläche
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Wandelt eine Oberfläche durch Extrusion in Richtung ihrer Normalen auf beiden Seiten in einen Volumenkörper um.
thickness: Angegebene Verdickung
Returns: Verdickte Oberfläche als Volumenkörper
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Wandelt eine Oberfläche durch Extrusion in Richtung ihrer Normalen in einen Volumenkörper um. Wenn der Parameter both_sides den Wert true hat, wird die Oberfläche auf beiden Seiten verstärkt.
thickness: Angegebene Verdickung
both_sides: True für Verdickung auf beiden Seiten, False für Verdickung auf einer Seite
Returns: Verdickte Oberfläche als Volumenkörper
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
Im zurückgegebenen Koordinatensystem werden xAxis, yAxis und zAxis zur Darstellung von uDir, vDir und normal verwendet. Die Länge von xAxis, yAxis steht für die Krümmung.
u: U-Komponente des Parameters
v: V-Komponente des Parameters
Returns: Koordinatensystem, das auf der Normalen-, U- und V-Richtung an der UV-Position auf der Oberfläche basiert

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
Erstellt eine Parameterlinienkurve auf der gegebenen Oberfläche. Erstellt eine Kurve, die eine U- oder V-Parameterlinie auf der Oberfläche darstellt. Eine Parameterlinie verläuft in Richtung ansteigender Werte für den U- oder V-Parameter bei konstantem Wert des dazugehörigen U- bzw. V-Parameters. Die resultierende Kurve entspricht der Parametrisierung der Oberfläche, ihr Bereich ist durch den Bereich des Oberflächenparameters begrenzt. Der Typ der ausgegebenen Kurve ist vom Oberflächentyp abhängig.
isoDirection: Für Richtung == 0 wird eine U-Parameterlinie, für Richtung == 1 eine V-Parameterlinie erstellt.
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Gibt eine neue Oberfläche mit umgekehrter Normaler zurück. Diese Oberfläche bleibt unverändert.
Returns: Oberfläche, die der eingegebenen Oberfläche entspricht, jedoch über umgekehrte Normalen verfügt

Autodesk.DesignScript.Geometry.Surface.Join(Autodesk.DesignScript.Geometry.Surface)
Verbindet diese Oberfläche und die eingegebene Oberfläche zu einer PolySurface.
topolysurface

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Verbindet diese Oberfläche und die eingegebenen Oberflächen zu einer PolySurface.
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projiziert die eingegebene Geometrie in Richtung des Eingabevektors auf diese Oberfläche. Diese Projektionsmethode unterstützt derzeit nur Punkte oder Kurven!
projecttosurface,projectonto