Autodesk.DesignScript.Geometry.Cone.ToString
Ruft eine Zeichenfolgendarstellung des Kegels ab

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Erstellt einen Kegel mit dem angegebenen Basisradius um den Startpunkt und der Spitze am Endpunkt.
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Erstellt einen Kegel mit Achse zwischen Start- und Endpunkt mit den angegebenen Radien am Anfang und Ende. Dieses Objekt weist keine Spitze auf und kann als Kegelstumpf bezeichnet werden.
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Erstellt einen Kegel mit Basispunkt am Ursprung des CoordinateSystem. Der Kegel erstreckt sich über den angegebenen Längenwert in Z-Richtung des CoordinateSystem, die kreisförmige Basis liegt in der XY-Ebene des CoordinateSystem.

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Erstellt einen Kegel mit Basispunkt am Ursprung des CoordinateSystem. Der Kegel erstreckt sich über den angegebenen Längenwert in Z-Richtung des CoordinateSystem, die kreisförmige Basis liegt in der XY-Ebene des CoordinateSystem.
cone,cone by height,cones