Autodesk.DesignScript.Geometry.Polygon.ToString
Ruft eine Zeichenfolgendarstellung des Polygons ab

Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Prüft, ob der Punkt innerhalb eines planaren Polygons ohne Selbstüberschneidungen liegt.