Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
Sucht eine lokalisierte Zeichenfolge ähnlich wie Sie haben die zulässigen Modellgrenzen überschritten. Wählen Sie kleinere Werte.

Autodesk.DesignScript.Geometry.Properties.Resources.OutsideAllowableModelingRange
Sucht eine lokalisierte Zeichenfolge ähnlich wie 'Ihre Eingaben liegen außerhalb des zulässigen Modellbereichs. Wählen Sie die Einstellung {0} mit einem Modellbereich zwischen {1} und {2} im Dialogfeld Voreinstellungen => Allgemein => Geometrieskalierung'.