Autodesk.DesignScript.Geometry.PolySurface.ToString
Ruft eine Zeichenfolgendarstellung der PolySurface ab

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Erstellt Polysurface durch Sweep einer Kurve entlang einer Führungskurve.
rail: Führungskurve für Sweep
profile: Sweep-Profil
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Sucht Oberflächen nach Punkt. Übernimmt den ersten Schnittpunkt in Vorwärtsrichtung. Ergebnis: eine Oberfläche für gefundenen Punkt in Oberflächeninnenbereich, zwei für Punkt auf Oberflächenkante, viele für Scheitelpunkt.
surfacesatpoint,findsurfaces,extractsurfaces