Autodesk.DesignScript.Geometry.Ellipse.ToString
Ruft eine Zeichenfolgendarstellung der Ellipse ab

Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Erstellt eine am eingegebenen Punkt zentrierte und an der XY-Ebene des WKS ausgerichtete Ellipse mit den angegebenen Radien für die X- und Y-Achse.
origin: Ursprungspunkt der Ellipse
xAxisRadius: X-Achsenradius
yAxisRadius: Y-Achsenradius
Returns: Durch Ursprung und Radien erstellte Ellipse
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Erstellt eine am eingegebenen Punkt zentrierte Ellipse mit zwei angegebenen Achsen. Die Achsen müssen im Winkel von 90 Grad zueinander liegen.
origin: Ursprungspunkt der Ellipse
xAxisRadius: X-Achsenradius
yAxisRadius: Y-Achsenradius
Returns: Aus Ursprungsvektoren erstellte Ellipse
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Erstellt eine am eingegebenen CoordinateSystem zentrierte und ausgerichtete Ellipse mit Radius x_radius in X-Richtung des KS und Radius y_radius in Y-Richtung des KS.
origin: Ursprungskoordinatensystem der Ellipse
xAxisRadius: X-Achsenradius
yAxisRadius: Y-Achsenradius
Returns: Durch Koordinatensystem und Radien erstellte Ellipse
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Erstellt eine an der eingegebenen Ebene zentrierte und ausgerichtete Ellipse mit Radius x_radius in Richtung der X-Achse der Ebene und Radius y_radius in Richtung der Y-Achse der Ebene.
plane: Ebene, auf der der Ellipsenbogen gezeichnet wird
xAxisRadius: X-Achsenradius
yAxisRadius: Y-Achsenradius
Returns: Aus Ebene und Radien erstellte Ellipse
ellipse,aligned ellipse,ellipsebylengths