Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
Ruft eine Zeichenfolgendarstellung der TSplineTopology ab

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
Gibt den Scheitelpunkt am angegebenen Index zurück.
index: Index des abzurufenden Scheitelpunkts
Returns: T-Spline-Scheitelpunkt
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
Gibt die Kante am angegebenen Index zurück.
index: Index der abzurufenden Kante
Returns: T-Spline-Kante
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
Gibt die Fläche am angegebenen Index zurück.
index: Index der abzurufenden Fläche
Returns: T-Spline-Fläche
tspline,face,byindex