Autodesk.DesignScript.Geometry.Plane.ToString
Ruft eine Zeichenfolgendarstellung der Ebene ab

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Erstellt eine "ausgerichtete" Ebene, positioniert am Punktursprung mit der Vektornormalen, aber mit einer bestimmten X-Achsenausrichtung. Dies hat keine Auswirkungen auf Teilungen, Überschneidungen, Projektionen und andere Vorgänge, sondern gibt lediglich die Ausrichtung des Eingabekoordinatensystems an.
origin: Ursprungspunkt der Ebene
normal: Normalenrichtungsvektor
xAxis: X-Achsen-Richtungsvektor
Returns: Ebene durch Ursprungsnormale und X-Achse

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Erstellt eine Ebene, in der die eingegebene Linie und der externe Punkt liegen. Der Punkt kann nicht auf der Linie oder ihrer Achse liegen.
line: Linie zur Bestimmung der Ebene
point: Punkt zur Bestimmung der Ebene
Returns: Aus Linie und Punkt erstellte Ebene
lines
0.4

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
Erzeugt ein neues CoordinateSystem für diese Ebene. Es basiert auf dem Ursprung sowie der Basis der X- und Y-Achse.
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
Erstellt einen neuen Ebenenversatz von dieser Ebene in Richtung der Normalen mit der angegebenen Entfernung.
alongnormal,moveplane