Autodesk.DesignScript.Geometry.IndexGroup.ToString
Ruft eine Zeichenfolgendarstellung der IndexGroup ab

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
Vergleich der zwei IndexGroups
other: Die andere IndexGroup
Returns: Gibt an, ob diese zwei Objekte gleich sind

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
Ruft einen Hashcode für diesen Typ ab
Returns: Ein eindeutiger Hashcode für dieses Objekt

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Erstellt eine IndexGroup mit drei Indizes.
a: Index a
b: Index b
c: Index c
Returns: IndexGroup
tri,polygon,mesh,meshes