Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
Ruft eine Zeichenfolgendarstellung der TSplineSurface ab

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt eine gerichtete T-Spline-Ebene, positioniert am Ursprungspunkt mit Vektornormaler, aber mit einer bestimmten x-Achsen-Ausrichtung.
Dies hat keine Auswirkungen beim Teilen, Schneiden, Projizieren und anderen Vorgängen, sondern bestimmt lediglich die Ausrichtung des Eingabe-CoordinateSystem.
origin: Ursprungspunkt der Ebene
normal: Normale der Ebene
xAxis: X-Achse der Ebene
minCorner: 2D-Punkt in der Ecke mit Minimalwerten in den Koordinaten der Ebene
maxCorner: 2D-Punkt in der Ecke mit Maximalwerten in den Koordinaten der Ebene
xSpans: Anzahl der Felder für Breite
ySpans: Anzahl der Felder für Länge
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: T-Spline-Oberfläche der Ebene
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt eine Ebene über Ursprung und x- und y-Achse.
Die z-Achse ist das Kreuzprodukt der beiden Vektoren.
origin: Ursprungspunkt der Ebene
xAxis: X-Achse der Ebene
yAxis: Y-Achse der Ebene
minCorner: 2D-Punkt in der Ecke mit Minimalwerten in den Koordinaten der Ebene
maxCorner: 2D-Punkt in der Ecke mit Maximalwerten in den Koordinaten der Ebene
xSpans: Anzahl der Felder für Breite
ySpans: Anzahl der Felder für Länge
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: T-Spline-Oberfläche der Ebene
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt einen T-Spline-Kegel mit dem angegebenen Basisradius am Startpunkt
und der Spitze am Endpunkt.
startPoint: Startpunkt des Kegels
endPoint: Endpunkt des Kegels
radius: Radius der Basis des Kegels
radiusSpans: Anzahl der Felder im Umfang
heightSpans: Anzahl der Felder in der Höhe
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: Konische T-Spline-Oberfläche
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt einen T-Spline-Kegel mit der Achse zwischen Start- und Endpunkt und den angegebenen Radien am Anfang und Ende.
Dieses Objekt hat keine Spitze, d. h., bei dieser Form handelt es sich um einen Kegelstumpf.
startPoint: Startpunkt des Kegels
endPoint: Endpunkt des Kegels
startRadius: Startradius des Kegels
endRadius: Endradius des Kegels
radiusSpans: Anzahl der Felder im Umfang
heightSpans: Anzahl der Felder in der Höhe
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: Konische T-Spline-Oberfläche
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt einen T-Spline-Kegel mit Basispunkt am Ursprung des CoordinateSystem, der sich in Richtung der Z-Achse des CoordinateSystem erstreckt,
wobei seine kreisförmige Basis in der XY-Ebene des CoordinateSystem liegt.
cs: Der Mittelpunkt und die Basis des Kegels liegen in der XY-Ebene dieses Koordinatensystems.
height: Höhe des Kegels
radius: Radius des Kegels
radiusSpans: Anzahl der Felder im Umfang
heightSpans: Anzahl der Felder in der Höhe
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: Konische T-Spline-Oberfläche
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt einen T-Spline-Kegel mit Basispunkt am Ursprung des CoordinateSystem, der sich in Richtung der z-Achse des CoordinateSystem erstreckt,
wobei seine kreisförmige Basis in der xy-Ebene des CoordinateSystem liegt.
cs: Der Mittelpunkt und die Basis liegen in der XY-Ebene dieses Koordinatensystems
height: Höhe des Kegels
startRadius: Startradius des Kegels
endRadius: Endradius des Kegels
radiusSpans: Anzahl der Felder im Umfang
heightSpans: Anzahl der Felder in der Höhe
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: Konische T-Spline-Oberfläche
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt eine T-Spline-Kugel mit Mittelpunkt am eingegebenen Punkt und mit dem angegebenen Radius.
centerPoint: Mittelpunkt der Kugel
radius: Radius der Kugel
radiusSpans: Anzahl radialer Felder
heightSpans: Anzahl der Felder in der Höhe
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: Kugelförmige T-Spline-Oberfläche
tspline,sphere,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt eine T-Spline-Kugel durch vier eingegebene Punkten auf der Oberfläche.
points: Vier Punkte zum Erstellen einer Kugel in einer Liste. Die Punkte dürfen nicht koplanar sein.
radiusSpans: Anzahl radialer Felder
heightSpans: Anzahl der Felder in der Höhe
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: Kugelförmige T-Spline-Oberfläche
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt einen T-Spline-Torus mit dem angegebenen Mittelpunkt und den angegebenen Radien, ausgerichtet an der xy-Ebene des vorgegebenen Weltkoordinatensystems.
center: Mittelpunkt des Torus
innerRadius: Innerer Radius des Torus
outerRadius: Äußerer Radius des Torus
innerRadiusSpans: Anzahl der inneren radialen Felder.
outerRadiusSpans: Anzahl der äußeren radialen Felder.
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: Torische T-Spline-Oberfläche
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt einen T-Spline-Quader zentriert am eingegebenen Punkt mit der angegebenen Breite, Länge und Höhe.
origin: Mittelpunkt des Quaders
width: Breite des Quaders
length: Länge des Quaders
height: Höhe des Quaders
xSpans: Anzahl Felder in der Breite
ySpans: Anzahl Felder in der Länge
zSpans: Anzahl Felder in der Höhe
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: T-Spline-Quader
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt einen T-Spline-Quader zentriert und ausgerichtet am eingegebenen CoordinateSystem mit der angegebenen Breite, Länge und Höhe.
cs: Die XY-Ebene des Quaders wird am entsprechenden X ausgerichtet
width: Breite des Quaders
length: Länge des Quaders
height: Höhe des Quaders
xSpans: Anzahl Felder in der Breite
ySpans: Anzahl Felder in der Länge
zSpans: Anzahl Felder in der Höhe
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: T-Spline-Quader
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt einen T-Spline-Quader vom tiefsten zum höchsten Punkt.
lowPoint: Erster Eckpunkt
highPoint: Zweiter Eckpunkt
xSpans: Anzahl Felder in der Breite
ySpans: Anzahl Felder in der Länge
zSpans: Anzahl Felder in der Höhe
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: T-Spline-Quader
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt einen T-Spline-Quadball mit Mittelpunkt am Ursprung des CoordinateSystem und dem angegebenen Radius.
cs: Lokales Koordinatensystem
radius: Radius des Quadball
spans: Anzahl Felder in zwei Dimensionen der Seiten des Quadball
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: T-Spline-Quadball
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt einen T-Spline-Quadball mit dem angegebenen Mittelpunkt und Radius, ausgerichtet an der xy-Ebene des vorgegebenen WKS.
center: Mittelpunkt des Quadball
radius: Radius des Quadball
spans: Anzahl Felder in zwei Dimensionen der Seiten des Quadball
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: T-Spline-Quadball
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Konstruiert eine T-Spline-Oberfläche aus einer NURBS-Oberfläche mit gleichmäßigem Verfahren.
Die eingegebene NURBS-Oberfläche wird mit gleichmäßigen Knoten in gleichen parametrischen oder
Bogenlängenintervallen (je nach dem entsprechenden useArcLen-Flag) neu erstellt und durch
eine NURBS-Oberfläche dritten Grades angenähert. Der ausgegebene T-Spline wird durch die angegebene Feldanzahl in
U- und V-Richtung geteilt.
nurbsSurface: Eingegebene NURBS-Oberfläche
uSpans: Erforderliche Anzahl Felder in U-Richtung
vSpans: Erforderliche Anzahl Felder in V-Richtung
uUseArcLen: Verwendung von Bogenlängen- oder parametrischer Unterteilung in Richtung des U-Parameters
vUseArcLen: Verwendung von Bogenlängen- oder parametrischer Unterteilung in Richtung des V-Parameters
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
Konstruiert eine T-Spline-Oberfläche aus einer NURBS-Oberfläche mit dem Krümmungsunterteilungsverfahren.
Die eingegebene NURBS-Oberfläche wird mit Grad 3 neu erstellt. Die Anzahl und Position der Felder des ausgegebenen T-Spline
in jeder Richtung werden automatisch abhängig von der Krümmung erkannt.
nurbsSurface: Eingegebene NURBS-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByExtrude(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Erstellt einen T-Spline durch Extrudieren einer Kurve entlang dem angegebenen Vektor.
curve: Profilkurve
direction: Extrusionsvektor
frontDistance: Extrusionsabstand in Vektorrichtung
backDistance: Extrusionsabstand entgegen Vektorrichtung
frontSpans: Anzahl Felder in Vektorrichtung. Wenn 0 übergeben wird, erfolgt keine Extrusion in Vektorrichtung.
backSpans: Anzahl Felder entgegen Vektorrichtung. Wenn 0 übergeben wird, erfolgt keine Extrusion entgegen der Vektorrichtung.
profileSpans: Anzahl Felder in Profilrichtung. Automatisch definiert, wenn 0 oder weniger
uniform: Wahl des Verfahrens für die Verteilung der Felder in Profilrichtung: gleichmäßig oder anhand der Krümmung
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
tspline,extrude,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Erstellt einen T-Spline durch Sweepen einer Querschnittskurve entlang eines Pfads.
profile: Profilkurve
path: Pfadkurve
parallel: Die Felder müssen parallel zur Pfadrichtung liegen.
pathSpans: Anzahl Felder im Pfad
profileSpans: Anzahl der Felder im Profil. Wird für Werte kleiner oder gleich 0 automatisch definiert.
pathUniform: Wahl des Verfahrens für die Verteilung der Felder auf dem Pfad: gleichmäßig oder anhand der Krümmung
profileUniform: Wahl des Verfahrens für die Verteilung der Felder auf dem Profil: gleichmäßig oder anhand der Krümmung
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Erstellt eine T-Spline-Oberfläche als Sweep der Profilkurve um die durch
den Ursprung und die Richtung definierte Achse, beginnend mit dem Startwinkel in Grad
durch Sweeping um den Sweep-Winkel in Grad.
profile: Profilkurve
axisOrigin: Drehmittelpunkt
axisDirection: Drehachse
startAngle: Startwinkel für Drehung
sweepAngle: Endwinkel für Drehung
radialSpans: Anzahl Felder in Radius
axialSpans: Anzahl Felder in der Höhe. Wird für Werte kleiner oder gleich 0 automatisch definiert.
uniform: Wahl des Verfahrens für die Verteilung der Felder: gleichmäßig oder anhand der Krümmung
symmetry: Symmetrieoptionen einer T-Spline-Oberfläche
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Erstellt durch Piping eine Oberfläche aus einem Netz von Kurven oder Linien.
An jedem Kurvenschnittpunkt wird eine glatte Verbindung erstellt.
Für manche Parameter können einzelne Werte oder Listen mit zwei Werten pro Kurve angegeben werden.
curves: Liste mit Kurven, aus denen Pipes erstellt werden sollen
defaultRadius: Vorgaberadius für die erstellten Pipes
snappingTolerance: Toleranz für die Erkennung von Kurvenschnittpunkten
segmentsCount: Anzahl der Segmente in jeder Pipe. Zulässig sind ein einzelner Wert oder eine Liste mit doppelt so vielen Einträgen, wie Kurven vorhanden sind.
endRotations: Werte für Enddrehungen der Pipes (in Grad). Zulässig sind ein einzelner Wert oder eine Liste mit doppelt so vielen Einträgen, wie Kurven vorhanden sind.
endRadii: Werte der Endradien der einzelnen Pipes. Zulässig sind ein einzelner Wert oder eine Liste mit doppelt so vielen Einträgen, wie Kurven vorhanden sind.
endPercentage: Werte (0 bis 1) vom Ende der einzelnen eingegebenen Kurven zum Start des Pipe-Netzes. Zulässig sind ein einzelner Wert oder eine Liste mit doppelt so vielen Einträgen, wie Kurven vorhanden sind.
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Erstellt durch Piping eine Oberfläche aus einem Netz von Kurven oder Linien.
An jedem Kurvenschnittpunkt wird eine glatte Verbindung erstellt.
Für manche Parameter können einzelne Werte oder Listen mit einem Wert pro Kurve angegeben werden.
curves: Liste mit Kurven, aus denen Pipes erstellt werden sollen
defaultRadius: Vorgaberadius für die erstellten Pipes
snappingTolerance: Toleranz für die Erkennung von Kurvenschnittpunkten
segmentsCount: Anzahl der Segmente für jede Kurve. Die Größe der Liste kann der Kurvenanzahl entsprechen oder 1 für die Replikation bzw. 0 für die automatische Bestimmung sein.
autoHandleStart: Wenn True, werden die Parameter des Halters am Anfang jeder Kurve automatisch generiert, und die benutzerdefinierten Parameter von rotationsAtStart, radiiAtStart und positionsAtStart werden ignoriert.
autoHandleEnd: Wenn True, werden die Parameter des Halters am Ende jeder Kurve automatisch generiert, und die benutzerdefinierten Parameter von rotationsAtEnd, radiiAtEnd und positionsAtEnd werden ignoriert.
startRotations: Benutzerdefinierter Drehwinkel in Grad jedes Pipe-Halters am Anfang jeder Kurve. Dieser Parameter wird ignoriert, wenn für autoHandleEnd true festgelegt ist. Die Größe der Liste kann der Kurvenanzahl entsprechen oder 1 für die Replikation sein.
endRotations: Benutzerdefinierter Drehwinkel in Grad jedes Pipe-Halters am Ende jeder Kurve. Dieser Parameter wird ignoriert, wenn für autoHandleEnd true festgelegt ist. Die Größe der Liste kann der Kurvenanzahl entsprechen oder 1 für die Replikation sein.
startRadii: Benutzerdefinierter Radius jedes Pipe-Halters am Anfang jeder Kurve. Dieser Parameter wird ignoriert, wenn für autoHandleEnd true festgelegt ist. Die Größe der Liste kann der Kurvenanzahl entsprechen oder 1 für die Replikation sein.
endRadii: Benutzerdefinierter Radius jedes Pipe-Halters am Ende jeder Kurve. Dieser Parameter wird ignoriert, wenn für autoHandleEnd true festgelegt ist. Die Größe der Liste kann der Kurvenanzahl entsprechen oder 1 für die Replikation sein.
startPositions: Benutzerdefinierte Position jedes Pipe-Halters am Anfang jeder Kurve in Prozent zwischen 0 und 1 entlang der Bogenlänge der Kurve. Dieser Parameter wird ignoriert, wenn für autoHandleStart true festgelegt ist. Die Größe der Liste kann der Kurvenanzahl entsprechen oder 1 für die Replikation sein. Die Start- und Endpositionen sollten sich auf den Kurven nicht überlappen. Idealerweise sollten die Startposition nahe bei 0 und die Endposition nahe bei 1 liegen.
endPositions: Benutzerdefinierte Position jedes Pipe-Halters am Ende jeder Kurve in Prozent zwischen 0 und 1 entlang der Bogenlänge der Kurve. Dieser Parameter wird ignoriert, wenn für autoHandleEnd true festgelegt ist. Die Größe der Liste kann der Kurvenanzahl entsprechen oder 1 für die Replikation sein. Die Start- und Endpositionen sollten sich auf den Kurven nicht überlappen. Idealerweise sollten die Startposition nahe bei 0 und die Endposition nahe bei 1 liegen.
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
Angabe von Quader- oder glattem Modus für den T-Spline
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
Ob der T-Spline offen ist.
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Konvertiert die T-Spline-Oberfläche gemäß ihrer Form in einen Volumenkörper oder eine Oberfläche.
Anmerkung: Es können kleine unerwartete Änderungen in der resultierenden BRep auftreten, wenn die Eingabeoberfläche in einer höheren T-Spline-Version erstellt wird als die Version, die in Dynamo geladen ist. In diesem Fall wird für eine Kopie der Oberfläche ein Downgrade auf die Dynamo-Version erstellt und in der Konvertierung verwendet.
matchTopology: Legt fest, ob der resultierende Körper dieselbe Topologie wie die Eingabe-T-Spline-Oberfläche aufweisen soll.
Returns: Topologieobjekt (Volumenkörper oder Oberfläche)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
Konvertiert eine T-Spline-Oberfläche in ein Netz. Das Netz kann sowohl Drei- als auch Vierecke enthalten.
minSegments: Mindestanzahl von Segmenten in jeder Richtung. Es wird immer mindestens ein Segment erstellt.
tolerance: Maximal zulässiger Abstand zwischen Netz und Oberfläche. Wird Null oder ein negativer Wert festgelegt, wird dies deaktiviert.
Returns: Netzobjekt
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
Verschweißt eine angegebene Liste von Scheitelpunkten zu einem einzigen Scheitelpunkt.
vertices: Zu verschweißende Scheitelpunkte
newPosition: Position des Scheitelpunktgriffs für das Ergebnis. Falls Null übergeben wird, wird die Mittelposition der Griffe verwendet.
keepSubdCreases: Unterteilungsknicke der eingegebenen Topologie beibehalten
Returns: TSpline-Oberfläche mit verschweißten Scheitelpunkten
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Hebt die Verschweißung aller gegebenen Kanten auf. Dabei wird die Verschweißung aller Scheitelpunkte auf allen Kanten aufgehoben.
edges: Gruppe von Kanten, deren Verschweißung aufgehoben werden soll
Returns: TSpline-Oberfläche mit unverschweißten Kanten
tspline,unweld,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Hebt die Verschweißung aller angegebenen Scheitelpunkte auf. Dabei wird die Verschweißung aller Kanten an allen Scheitelpunkten aufgehoben.
vertices: Gruppe von Scheitelpunkten, deren Verschweißung aufgehoben werden soll
Returns: TSpline-Oberfläche mit unverschweißten Scheitelpunkten
tspline,unweld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Erstellt Abgleich für T-Spline und geschlossene Kurvenkontur.
tsEdges: Geschlossene T-Spline-Kantenkontur für Abgleich
curves: Geschlossene Kurvenkontur für Abgleich
continuity: Anzustrebende Stetigkeit der Geometrie beim Verbinden: G0, G1, G2
useArclength: Angabe, ob die arcLength-Ausrichtung beim Verbinden verwendet werden soll
useRefinement: Wenn True, werden dem T-Spline zusätzliche Steuerpunkte hinzugefügt, um die Oberflächen innerhalb der gegebenen Toleranz abzugleichen.
numRefinementSteps: Maximale Anzahl von Verfeinerungsschritten. Wird ignoriert, wenn useRefinement auf False festgelegt ist
refinementTolerance: Einzuhaltende Toleranz. Wird ignoriert, wenn useRefinement auf False festgelegt ist
usePropagation: Angabe, ob Daten bei der Erstellung des Abgleichs übernommen werden sollen
widthOfPropagation: Gibt den Teil der Oberfläche an, der von dem Abgleich betroffen sein soll. Wird ignoriert, wenn für usePropagation False gewählt wurde.
tangentScale: Tangentenmaßstab. Wird ignoriert, wenn eine andere Stetigkeit als G1 festgelegt wurde.
curvParamWeight: Gewichtung des Krümmungsparameters. Wird ignoriert, wenn eine andere Stetigkeit als G2 festgelegt wurde.
flipSourceTargetAlignment: Gibt an, ob die Ausrichtung umgekehrt werden soll.
Returns: T-Spline-Oberfläche zwischen den gegebenen T-Spline-Grenzkanten und der Kurvenkontur
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Erstellt Abgleich für T-Spline und geschlossene Kurvenkontur.
tsEdges: Geschlossene T-Spline-Kantenkontur für Abgleich
curves: Geschlossene Kurvenkontur für Abgleich
continuity: Anzustrebende Stetigkeit der Geometrie beim Verbinden: G0, G1, G2
useArclength: Angabe, ob die arcLength-Ausrichtung beim Verbinden verwendet werden soll
useRefinement: Wenn True, werden dem T-Spline zusätzliche Steuerpunkte hinzugefügt, um die Oberflächen innerhalb der gegebenen Toleranz abzugleichen.
numRefinementSteps: Maximale Anzahl von Verfeinerungsschritten. Wird ignoriert, wenn useRefinement auf False festgelegt ist
refinementTolerance: Einzuhaltende Toleranz. Wird ignoriert, wenn useRefinement auf False festgelegt ist
usePropagation: Angabe, ob Daten bei der Erstellung des Abgleichs übernommen werden sollen
widthOfPropagation: Gibt den Teil der Oberfläche an, der von dem Abgleich betroffen sein soll. Wird ignoriert, wenn für usePropagation False gewählt wurde.
scale: Tangentenmaßstab für G1 oder Krümmungsmaßstab für G2. Wird ignoriert, wenn für die Kontinuität G0 festgelegt ist.
flipSourceTargetAlignment: Gibt an, ob die Ausrichtung umgekehrt werden soll.
Returns: T-Spline-Oberfläche zwischen den gegebenen T-Spline-Grenzkanten und der Kurvenkontur
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Erstellt Abgleich mit T-Spline und geschlossener Kontur aus BRep-Kanten. Die Kantenkontur
wird zuerst in eine Kurvenkontur konvertiert, anschließend wird der Abgleich durchgeführt.
tsEdges: Geschlossene T-Spline-Kantenkontur für Abgleich
brepEdges: Geschlossene BRep-Kantenkontur für die Verbindung
continuity: Anzustrebende Stetigkeit der Geometrie beim Verbinden: G0, G1, G2
useArclength: Angabe, ob die arcLength-Ausrichtung beim Verbinden verwendet werden soll
useRefinement: Wenn True, werden dem T-Spline zusätzliche Steuerpunkte hinzugefügt, um die Oberflächen innerhalb der gegebenen Toleranz abzugleichen.
numRefinementSteps: Maximale Anzahl von Verfeinerungsschritten. Wird ignoriert, wenn useRefinement auf False festgelegt ist
refinementTolerance: Einzuhaltende Toleranz. Wird ignoriert, wenn useRefinement auf False festgelegt ist
usePropagation: Angabe, ob Daten bei der Erstellung des Abgleichs übernommen werden sollen
widthOfPropagation: Gibt den Teil der Oberfläche an, der von dem Abgleich betroffen sein soll. Wird ignoriert, wenn für usePropagation False gewählt wurde
tangentScale: Tangentenmaßstab. Wird ignoriert, wenn eine andere Stetigkeit als G1 festgelegt wurde
curvParamWeight: Gewichtung des Krümmungsparameters. Wird ignoriert, wenn eine andere Stetigkeit als G2 festgelegt wurde
flipSourceTargetAlignment: Gibt an, ob die Ausrichtung umgekehrt werden soll
Returns: T-Spline-Oberfläche zwischen den angegebenen T-Spline-Randkanten und der BRep-Kantenkontur
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
Ändert den Visualisierungsstil des T-Spline.
Glatte Visualisierung, wenn True übergeben wird, andernfalls Quader.
enable: Glatte Visualisierung aktivieren oder deaktivieren
Returns: T-Spline mit ausgewähltem Visualisierungsstil
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Erstellt eine Brücke zwischen zwei Gruppen von Flächen. Elemente der ersten Gruppe
gelten als untergeordnete Elemente dieser Oberfläche. Elemente der zweiten
Gruppe können untergeordnete Elemente dieser oder einer anderen
Oberfläche sein. Die Topologie in jeder Gruppe muss nicht unbedingt benachbart sein,
muss jedoch dieselbe Anzahl separater Konturen erstellen.
firstGroup: Erste Gruppe durch die Brücke zu verbindender Flächen
secondGroup: Zweite Gruppe durch die Brücke zu verbindender Flächen
followCurves: Brückenkurven für die einzelnen Konturen der
Topologie. (Wenn eine leere Liste übergeben wird, werden gerade Linien verwendet. Wird genau eine
Kurve übergeben, wird diese repliziert, falls mehrere Eingabekonturen erkannt werden.)
frameRotations: Anzahl der vollständigen Drehungen um
die Normale der Frames auf der Brückenkurve für jede separate Kontur der Topologie. (Wenn eine leere Liste übergeben wird, wird 0 verwendet. Wird genau ein
Wert übergeben, wird dieser repliziert, falls mehrere Eingabekonturen erkannt werden.)
spansCounts: Anzahl der Segmente entlang der Brücke für
jede separate Kontur der Topologie. Die Anzahl der Felder für jede Gruppe muss
größer als die entsprechende Anzahl der Drehungen sein. (Wenn eine leere Liste übergeben wird, wird 1 verwendet. Wird genau ein
Wert übergeben, wird dieser repliziert, falls mehrere Eingabekonturen erkannt werden.)
cleanBorderBridges: Löscht Brücken zwischen Randkanten.
keepSubdCreases: Unterteilungsknicke der eingegebenen
Topologie beibehalten
firstAlignVertices: Liste der Ausrichtungs-Scheitelpunkte für
die einzelnen Topologiekonturen aus der ersten Gruppe. (Die Anzahl der Scheitelpunkte
muss mit der Anzahl der erkannten Eingabekonturen übereinstimmen. Die Liste kann auch leer sein.)
secondAlignVertices: Liste der Ausrichtungs-Scheitelpunkte für
die einzelnen Topologiekonturen aus der zweiten Gruppe. (Die Anzahl der Scheitelpunkte
muss mit der Anzahl der erkannten Eingabekonturen übereinstimmen. Die Liste kann auch leer sein.)
flipAlignmentFlags: Liste der Flags, die angeben, ob
die Ausrichtung der Brücke für die entsprechende Topologiekontur umgekehrt werden soll.
(Wenn eine leere Liste übergeben wird, wird False festgelegt. Wird genau ein
Wert übergeben, wird dieser für jede erkannte Eingabekontur repliziert.)
Returns: TSpline-Oberfläche mit Topologie, verbunden durch Brücke
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Erstellt eine Brücke zwischen einer Gruppe von Flächen und einer Gruppe von Kanten. Elemente der ersten Gruppe
gelten als untergeordnete Elemente dieser Oberfläche. Elemente der zweiten
Gruppe können untergeordnete Elemente dieser oder einer anderen
Oberfläche sein. Die Topologie in jeder Gruppe muss nicht unbedingt benachbart sein,
muss jedoch dieselbe Anzahl einzelner Konturen erstellen.
firstGroup: Erste Gruppe durch die Brücke zu verbindender Flächen
secondGroup: Zweite Gruppe durch die Brücke zu verbindender Kanten
followCurves: Brückenkurven für die einzelnen Konturen der
Topologie. (Wenn eine leere Liste übergeben wird, werden gerade Linien verwendet. Wird genau eine
Kurve übergeben, wird diese repliziert, falls mehrere Eingabekonturen erkannt werden.)
frameRotations: Anzahl der vollständigen Drehungen um
die Normale der Frames auf der Brückenkurve für jede separate Kontur der Topologie. (Wenn eine leere Liste übergeben wird, wird 0 verwendet. Wird genau ein
Wert übergeben, wird dieser repliziert, falls mehrere Eingabekonturen erkannt werden.)
spansCounts: Anzahl der Segmente entlang der Brücke für
jede separate Kontur der Topologie. Die Anzahl der Felder für jede Gruppe muss
größer als die entsprechende Anzahl der Drehungen sein. (Wenn eine leere Liste übergeben wird, wird 1 verwendet. Wird genau ein
Wert übergeben, wird dieser repliziert, falls mehrere Eingabekonturen erkannt werden.)
cleanBorderBridges: Löscht Brücken zwischen Randkanten.
keepSubdCreases: Unterteilungsknicke der eingegebenen
Topologie beibehalten
firstAlignVertices: Liste der Ausrichtungs-Scheitelpunkte für
die einzelnen Topologiekonturen aus der ersten Gruppe. (Die Anzahl der Scheitelpunkte
muss mit der Anzahl der erkannten Eingabekonturen übereinstimmen. Die Liste kann auch leer sein.)
secondAlignVertices: Liste der Ausrichtungs-Scheitelpunkte für
die einzelnen Topologiekonturen aus der zweiten Gruppe. (Die Anzahl der Scheitelpunkte
muss mit der Anzahl der erkannten Eingabekonturen übereinstimmen. Die Liste kann auch leer sein.)
flipAlignmentFlags: Liste der Flags, die angeben, ob
die Ausrichtung der Brücke für die entsprechende Topologiekontur umgekehrt werden soll.
(Wenn eine leere Liste übergeben wird, wird False festgelegt. Wird genau ein
Wert übergeben, wird dieser für jede erkannte Eingabekontur repliziert.)
Returns: TSpline-Oberfläche mit Topologie, verbunden durch Brücke
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Erstellt eine Brücke zwischen einer Gruppen von Kanten und einer Gruppe von Flächen. Elemente der ersten Gruppe
gelten als untergeordnete Elemente dieser Oberfläche. Elemente der zweiten
Gruppe können untergeordnete Elemente dieser oder einer anderen
Oberfläche sein. Die Topologie in jeder Gruppe muss nicht unbedingt benachbart sein,
muss jedoch dieselbe Anzahl einzelner Konturen erstellen.
firstGroup: Erste Gruppe durch die Brücke zu verbindender Kanten
secondGroup: Zweite Gruppe durch die Brücke zu verbindender Flächen
followCurves: Brückenkurven für die einzelnen Konturen der
Topologie. (Wenn eine leere Liste übergeben wird, werden gerade Linien verwendet. Wird genau eine
Kurve übergeben, wird diese repliziert, falls mehrere Eingabekonturen erkannt werden.)
frameRotations: Anzahl der vollständigen Drehungen um
die Normale der Frames auf der Brückenkurve für jede separate Kontur der Topologie. (Wenn eine leere Liste übergeben wird, wird 0 verwendet. Wird genau ein
Wert übergeben, wird dieser repliziert, falls mehrere Eingabekonturen erkannt werden.)
spansCounts: Anzahl der Segmente entlang der Brücke für
jede separate Kontur der Topologie. Die Anzahl der Felder für jede Gruppe muss
größer als die entsprechende Anzahl der Drehungen sein. (Wenn eine leere Liste übergeben wird, wird 1 verwendet. Wird genau ein
Wert übergeben, wird dieser repliziert, falls mehrere Eingabekonturen erkannt werden.)
cleanBorderBridges: Löscht Brücken zwischen Randkanten.
keepSubdCreases: Unterteilungsknicke der eingegebenen
Topologie beibehalten
firstAlignVertices: Liste der Ausrichtungs-Scheitelpunkte für
die einzelnen Topologiekonturen aus der ersten Gruppe. (Die Anzahl der Scheitelpunkte
muss mit der Anzahl der erkannten Eingabekonturen übereinstimmen. Die Liste kann auch leer sein.)
secondAlignVertices: Liste der Ausrichtungs-Scheitelpunkte für
die einzelnen Topologiekonturen aus der zweiten Gruppe. (Die Anzahl der Scheitelpunkte
muss mit der Anzahl der erkannten Eingabekonturen übereinstimmen. Die Liste kann auch leer sein.)
flipAlignmentFlags: Liste der Flags, die angeben, ob
die Ausrichtung der Brücke für die entsprechende Topologiekontur umgekehrt werden soll.
(Wenn eine leere Liste übergeben wird, wird False festgelegt. Wird genau ein
Wert übergeben, wird dieser für jede erkannte Eingabekontur repliziert.)
Returns: TSpline-Oberfläche mit Topologie, verbunden durch Brücke
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Erstellt eine Brücke zwischen zwei Gruppen von Kanten. Elemente der ersten Gruppe
gelten als untergeordnete Elemente dieser Oberfläche. Elemente der zweiten
Gruppe können untergeordnete Elemente dieser oder einer anderen
Oberfläche sein. Die Topologie in jeder Gruppe muss nicht unbedingt benachbart sein,
muss jedoch dieselbe Anzahl einzelner Konturen erstellen.
firstGroup: Erste Gruppe durch die Brücke zu verbindender Kanten
secondGroup: Zweite Gruppe durch die Brücke zu verbindender Kanten
followCurves: Brückenkurven für die einzelnen Konturen der
Topologie. (Wenn eine leere Liste übergeben wird, werden gerade Linien verwendet. Wird genau eine
Kurve übergeben, wird diese repliziert, falls mehrere Eingabekonturen erkannt werden.)
frameRotations: Anzahl der vollständigen Drehungen um
die Normale der Frames auf der Brückenkurve für jede separate Kontur der Topologie. (Wenn eine leere Liste übergeben wird, wird 0 verwendet. Wird genau ein
Wert übergeben, wird dieser repliziert, falls mehrere Eingabekonturen erkannt werden.)
spansCounts: Anzahl der Segmente entlang der Brücke für
jede separate Kontur der Topologie. Die Anzahl der Felder für jede Gruppe muss
größer als die entsprechende Anzahl der Drehungen sein. (Wenn eine leere Liste übergeben wird, wird 1 verwendet. Wird genau ein
Wert übergeben, wird dieser repliziert, falls mehrere Eingabekonturen erkannt werden.)
cleanBorderBridges: Löscht Brücken zwischen Randkanten.
keepSubdCreases: Unterteilungsknicke der eingegebenen
Topologie beibehalten
firstAlignVertices: Liste der Ausrichtungs-Scheitelpunkte für
die einzelnen Topologiekonturen aus der ersten Gruppe. (Die Anzahl der Scheitelpunkte
muss mit der Anzahl der erkannten Eingabekonturen übereinstimmen. Die Liste kann auch leer sein.)
secondAlignVertices: Liste der Ausrichtungs-Scheitelpunkte für
die einzelnen Topologiekonturen aus der zweiten Gruppe. (Die Anzahl der Scheitelpunkte
muss mit der Anzahl der erkannten Eingabekonturen übereinstimmen. Die Liste kann auch leer sein.)
flipAlignmentFlags: Liste der Flags, die angeben, ob
die Ausrichtung der Brücke für die entsprechende Topologiekontur umgekehrt werden soll.
(Wenn eine leere Liste übergeben wird, wird False festgelegt. Wird genau ein
Wert übergeben, wird dieser für jede erkannte Eingabekontur repliziert.)
Returns: TSpline-Oberfläche mit Topologie, verbunden durch Brücke
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
Füllt Löcher in einem T-Spline aus
edges: Gruppe von Kanten mit Loch. Die Kanten müssen sich am Rand befinden.
fillMethod: Methode zum Ausfüllen des Lochs: 0 - Tessellation, 1 - Vielecke, 2 - Zusammenziehen, 3 - Zusammenziehen und verschweißen
keepSubdCreases: Unterteilungsknicke der eingegebenen Topologie beibehalten
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
Komprimiert die gesamte Topologie auf der Oberfläche mit aufeinander folgenden Indizes. Die relative Reihenfolge der Indizes bleibt bei dieser Funktion erhalten.
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
Bei der Vorwärts-Interpolation werden Steuerpunkte an ihre parametrischen Positionen auf der Oberfläche verschoben. Bei der Rückwärts-Interpolation wird für jeden ursprünglichen Steuerpunkt ein Punkt auf der Oberfläche erstellt und der Steuerpunkt wird an den dazugehörigen Oberflächenpunkt verschoben.
reverse: Interpolationsrichtung: Vorwärts für False, andernfalls Rückwärts
Returns: Interpolierter T-Spline in der angegebenen Richtung
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Kopiert ausgewählte Flächen in die neue Oberfläche. Die neue Oberfläche weist keine Symmetrie auf.
faces: Zu duplizierende Flächen
Returns: T-Spline-Oberfläche mit ausschließlich den gewählten Flächen
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Verschiebt die angegebenen Scheitelpunkte entlang des angegebenen Vektors.
vertices: Liste der zu verschiebenden Scheitelpunkte
vector: Richtung für die Verschiebung
onSurface: Flag, das angibt, ob Oberflächen- oder Steuerpunkte der Scheitelpunkte verwendet werden sollen

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSS(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface},System.String)
Exportiert eine angegebene Gruppe von T-Spline-Oberflächen in eine T-Spline-Szenen-Datei.
tSplineSurfaces: Zu exportierende Gruppe von T-Spline-Oberflächen
filePath: Pfad zum Speichern der Datei
Returns: Dateipfad, unter dem die T-Spline-Gruppe gespeichert wird
tspline,export,save,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface,System.String)
Exportiert eine angegebene T-Spline-Oberfläche in eine T-Spline-Netz-Datei.
tSplineSurface: Zu exportierender T-Spline
filePath: Pfad zum Speichern der Datei
Returns: Dateipfad, unter dem die T-Spline-Oberfläche gespeichert wird
tspline,export,save,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
Schreibt eine T-Spline-Oberfläche im T-Spline-Netzformat in eine Zeichenfolge.
tSplineSurface: Zu serialisierende  T-Spline-Oberfläche
Returns: Zeichenfolge, in der die T-Spline-Oberfläche serialisiert wird
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
Erstellt eine T-Spline-Fläche im T-Spline-Netzformat aus der Zeichenfolge.
content: Zeichenfolgendarstellung der T-Spline-Netzdatei
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: Neu geladene T-Spline-Oberfläche in der Liste
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
Lädt eine T-Spline-Oberfläche aus der angegebenen T-Spline-Netz-Datei.
filePath: Pfad der zu ladenden Datei
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: Neu geladene T-Spline-Oberfläche in der Liste
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.IO.FileInfo,System.Boolean)
Lädt eine T-Spline-Oberfläche aus der angegebenen T-Spline-Netz-Datei
file: Datei, aus der geladen werden soll
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: Neu geladene T-Spline-Oberfläche in der Liste
tspline,import,load,tsm,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
Lädt eine Gruppe von T-Spline-Oberflächen aus der angegebenen T-Spline-Szenen-Datei.
filePath: Pfad der zu ladenden Datei
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: Gruppe neu geladener T-Spline-Oberflächen
tspline,import,load,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.IO.FileInfo,System.Boolean)
Lädt eine Gruppe von T-Spline-Oberflächen aus der angegebenen T-Spline-Szenen-Datei
file: Datei, aus der geladen werden soll
inSmoothMode: T-Spline-Oberfläche als Quader oder in geglätteter Darstellung anzeigen
Returns: Gruppe neu geladener T-Spline-Oberflächen
tspline,import,load,tss,file