Autodesk.DesignScript.Geometry.Circle.ToString
Ruft eine Zeichenfolgendarstellung des Kreises ab

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Erstellt einen Kreis durch Eingabe von Mittelpunkt und Radius in der XY-Ebene des Weltkoordinatensystems mit Welt-Z als Normaler.
centerPoint: Mittelpunkt des Kreises
radius: Radius
Returns: Mit Mittelpunkt und Radius erstellter Kreis
circle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
Erstellt einen Kreis zentriert am Ursprung der Eingabeebene, innerhalb der Eingabeebene und mit dem angegebenen Radius.
plane: Ursprung der Ebene, die zum Zentrieren des Kreises verwendet wird
radius: Radius
Returns: Mit Ebene und Radius erstellter Kreis
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Erstellt einen Kreis, der durch drei eingegebene Punkte verläuft.
p1: Erster Punkt des Kreises
p2: Zweiter Punkt des Kreises
p3: Dritter Punkt des Kreises
circle