Autodesk.DesignScript.Geometry.Cuboid.ToString
Ruft eine Zeichenfolgendarstellung des Quaders ab

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Erstellt einen Quader mit Mittelpunkt am Eingabepunkt und Angaben für Breite, Länge und Höhe.
origin: Ursprungspunkt
width: Breite des Quaders
length: Länge des Quaders
height: Quaderhöhe
Returns: Durch Längen erstellter Quader
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.Length
Gibt die Entfernung für die Länge aus.                         Anmerkung: Dies gibt die eingegebenen Maße des Quaders aus, nicht die Maße in der realen Welt. Das bedeutet: Wenn Sie z. B. für die Breite des Quaders                   (X-Achse) den Längenwert 10 festlegen und dann eine Transformation in ein CoordinateSystem mit                   2-facher Skalierung in X-Richtung durchführen, beträgt die Breite nach wie vor 10. Da in ASM die Scheitelpunkte eines                  Körpers nicht in vorhersehbarer Reihenfolge extrahiert werden können,                    ist es nicht möglich, die Maße nach der Transformation zu ermitteln.

Autodesk.DesignScript.Geometry.Cuboid.Width
Gibt die Entfernung für die Breite aus.                         Anmerkung: Dies gibt die eingegebenen Maße des Quaders aus, nicht die Maße in der realen Welt. Das bedeutet: Wenn Sie z. B. für die Breite des Quaders                   (X-Achse) den Längenwert 10 festlegen und dann eine Transformation in ein CoordinateSystem mit                   2-facher Skalierung in X-Richtung durchführen, beträgt die Breite nach wie vor 10. Da in ASM die Scheitelpunkte eines                  Körpers nicht in vorhersehbarer Reihenfolge extrahiert werden können,                    ist es nicht möglich, die Maße nach der Transformation zu ermitteln.

Autodesk.DesignScript.Geometry.Cuboid.Height
Gibt die Entfernung für die Höhe aus.                         Anmerkung: Dies gibt die eingegebenen Maße des Quaders aus, nicht die Maße in der realen Welt. Das bedeutet: Wenn Sie z. B. für die Breite des Quaders                   (X-Achse) den Längenwert 10 festlegen und dann eine Transformation in ein CoordinateSystem mit                   2-facher Skalierung in X-Richtung durchführen, beträgt die Breite nach wie vor 10. Da in ASM die Scheitelpunkte eines                  Körpers nicht in vorhersehbarer Reihenfolge extrahiert werden können,                    ist es nicht möglich, die Maße nach der Transformation zu ermitteln.