Autodesk.DesignScript.Geometry.Solid.ToString
Ruft eine Zeichenfolgendarstellung des Volumenkörpers ab

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Erstellt einen Volumenkörper durch Erhebung zwischen den eingegebenen geschlossenen Querschnittskurven entlang einer Führungskurve. Die Führungskurve muss alle Querschnittskurven schneiden.
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Erstellt einen Volumenkörper durch Erhebung zwischen den eingegebenen geschlossenen Querschnittskurven entlang von Führungskurven. Die Führungskurven müssen alle Querschnittskurven schneiden.
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
Erstellt einen Volumenkörper durch Erhebung zwischen den eingegebenen Querschnitten bestehend aus geschlossenen PolyCurves. Dieser Vorgang ist für Schnitte, die ausschließlich aus Liniensegmenten bestehen, mit Scheitelpunkten in derselben Reihenfolge optimiert. Die Option zum Prüfen und Reparieren stellt die Gültigkeit des erstellten Volumenkörpers sicher, wenn sie aktiviert ist. Durch Deaktivieren der Option kann die Leistung verbessert werden.
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Erstellt einen Rotationsvolumenkörper als Sweep der Profilkurve um den durch den Ursprung und den Achsenvektor gebildeten Achsenstrahl vom Startwinkel in Grad bis zum Sweep-Winkel in Grad.
profile: Zu rotierende Profilkurve
axisOrigin: Ursprung der rotierenden Achse
axisDirection: Richtung der rotierenden Achse
startAngle: Startwinkel in Grad
sweepAngle: Sweeping-Winkel in Grad
Returns: Durch Rotation erstellter Volumenkörper
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
Vereinigt eine Liste von Volumenkörpern mit diesem Volumenkörper.
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
Die boolesche Differenz zwischen diesem Volumenkörper und einem anderen.

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
Ruft die Hülle eines Volumenkörpers aus dessen Flächen ab.
internalFaceThickness: Entfernung zum Verlängern der Hülle nach innen
externalFaceThickness: Entfernung zum Verlängern der Hülle nach außen
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projiziert die eingegebene Geometrie in Richtung des eingegebenen Vektors auf diesen Volumenkörper. Diese Projektionsmethode unterstützt derzeit nur Punkte oder Kurven!
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
Trennt einen Volumenkörper in einzelne Volumenkörper, wenn er mehr als ein unverbundenes Stück enthält. Gibt den gleichen Volumenkörper zurück, wenn es sich um ein einzelnes zusammenhängendes Stück handelt.
Returns: unverbundene Volumenkörper trennen
split,disjoint