Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
Ruft eine Zeichenfolgendarstellung der TSplineReflection ab

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
Erstellt eine radiale Reflexion für die T-Spline-Symmetrie an der gegebenen Ebene mit der gegebenen Segmentanzahl und dem gegebenen Winkel (in Grad) zwischen je zwei Segmenten.
plane: Die Ebene, deren Normale als Achse für die radiale Reflexion des T-Spline verwendet werden soll, in Weltkoordinaten.
segmentsCount: Anzahl der Segmente in der radialen Reflexion
segmentAngle: Winkel zwischen jeweils zwei Segmenten in der radialen Symmetrie (in Grad). Die Angabe 0 wird als (360/segmentsCount) definiert.
Returns: Radiale Reflexion des T-Spline
tspline,symmetry,reflection,radial