Autodesk.DesignScript.Geometry.NurbsSurface.ToString
Ruft eine Zeichenfolgendarstellung der NurbsSurface ab

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Erstellt eine NurbsSurface mit angegebenen interpolierten Punkten und U- und V-Graden. Die resultierende Oberfläche verläuft durch alle Punkte.
points: Raster mit Punkten für NURBS-Oberfläche
uDegree: Grad in U-Richtung
vDegree: Grad in V-Richtung
Returns: Durch Punkte erstellte NURBS-Oberfläche
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Erstellt eine NurbsSurface mit angegebenen interpolierten Punkten und U- und V-Graden.  Die resultierende Oberfläche verläuft durch alle Punkte. Die Anzahl der Tangenten muss der Anzahl der Punkte in der jeweiligen Richtung entsprechen. Das Ergebnis ist eine Oberfläche dritten Grades sowohl in U- als auch in V-Richtung.
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Erstellt eine NurbsSurface, die einer Gruppe unterschiedlicher Oberflächenmerkmale entspricht. Dies ist das am höchsten entwickelte Verfahren zur Anpassung von Oberflächen. Die resultierende Oberfläche verläuft durch alle Punkte. Die Anzahl der Tangenten muss der Anzahl der Punkte in der jeweiligen Richtung entsprechen. Das Ergebnis ist eine Oberfläche dritten Grades sowohl in U- als auch in V-Richtung. Die Ableitungen an den Ecken müssen Ableitungen zweiter Ordnung sein (dP/dUdV) und in der Reihenfolge [lowU, lowV], [highU, lowV],  [lowU, highV], [highU, highV] angegeben werden.
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
Erstellt eine NurbsSurface mit den angegebenen Kontrollscheitelpunkten, Knoten, Gewichtungen sowie U- und V-Grad. Für die Daten gelten einige Einschränkungen; werden diese nicht eingehalten, schlägt die Funktion fehl, und ein Ausnahmefehler wird ausgegeben. Grad: Sowohl U als auch V müssen höheren Grades als 1 (stückweise linearer Spline) und niedrigeren Grades als 26 (maximal von ASM unterstützter Grad der B-Spline-Basis) sein. Gewichtungen: Alle Gewichtungswerte (falls angegeben) müssen streng positiv sein. Gewichtungen kleiner als 1e-11 werden nicht akzeptiert, und die Funktion schlägt fehl. Knoten: Beide Knotenvektoren müssen nicht-absteigende Folgen sein. Die Einflussverstärkung der inneren Knoten darf nicht größer sein als Grad+1 am Anfangs- und Endknoten und Grad an den inneren Knoten (dies ermöglicht die Darstellung von Oberflächen mit G1-Diskontinuität). Beachten Sie, dass ungeklammerte Knotenvektoren unterstützt werden, sie werden jedoch in geklammerte konvertiert, und die entsprechenden Änderungen werden auf die Kontrollpunkt-/Gewichtungsdaten angewendet.
lines
0.4