Autodesk.DesignScript.Geometry.NurbsCurve.ToString
Ruft eine Zeichenfolgendarstellung der NurbsCurve ab

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Erstellt ein BSplineCurve über explizite Steuerpunkte. Anmerkung 1: BSplineCurves mit Grad=1 weisen G1-Diskontinuitäten auf, die Probleme bei Extrusionen, Sweeps und anderen Vorgängen verursachen. Sie sollten daher vermieden werden. Verwenden Sie stattdessen eine PolyCurve. Anmerkung 2: Bei periodischen (geschlossenen) Kurven muss der letzte Punkt unbedingt mit dem ersten zusammenfallen.
points: Punkte für NURBS-Kurve
Returns: Aus Punkten erstellte NURBS-Kurve
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Erstellt ein BSplineCurve über explizite Steuerpunkte. Anmerkung 1: BSplineCurves mit Grad=1 weisen G1-Diskontinuitäten auf, die Probleme bei Extrusionen, Sweeps und anderen Vorgängen verursachen. Sie sollten daher vermieden werden. Verwenden Sie stattdessen eine PolyCurve. Anmerkung 2: Bei periodischen (geschlossenen) Kurven muss der letzte Punkt unbedingt mit dem ersten zusammenfallen.
points: Punkte für NURBS-Kurve
degree: Gradwert der Kurve
Returns: Aus Punkten erstellte NURBS-Kurve
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Erstellt ein BSplineCurve über explizite Steuerpunkte. Anmerkung 1: BSplineCurves mit Grad=1 weisen G1-Diskontinuitäten auf, die Probleme bei Extrusionen, Sweeps und anderen Vorgängen verursachen. Sie sollten daher vermieden werden. Verwenden Sie stattdessen eine PolyCurve. Anmerkung 2: Bei periodischen (geschlossenen) Kurven muss der letzte Punkt unbedingt mit dem ersten zusammenfallen.
points: Punkte für NURBS-Kurve
degree: Gradwert der Kurve
closeCurve: Zum Schließen der Kurve umschalten
Returns: Aus Punkten erstellte NURBS-Kurve
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
Erstellt eine BSplineCurve aus Kontrollscheitelpunkten, Gewichtungen und Knoten. Aus den ASM-Dokumenten: Grad: Muss größer als 1 (stückweise linearer Spline) und kleiner als 26 (maximal von ASM unterstützter Grad für B-Spline-Basis) sein. Gewichtungen: Alle Gewichtungswerte (falls angegeben) müssen streng positiv sein. Gewichtungen kleiner als 1e-11 werden nicht akzeptiert, und die Funktion schlägt fehl. Knoten: Der Knotenvektor muss eine nicht-absteigende Folge sein. Die Einflussverstärkung der inneren Knoten darf nicht größer sein als Grad+1 am Anfangs- und Endknoten und Grad an den inneren Knoten (dies ermöglicht die Darstellung von Kurven mit G1-Diskontinuität). Beachten Sie, dass ungeklammerte Knotenvektoren unterstützt werden, sie werden jedoch in geklammerte konvertiert, und die entsprechenden Änderungen werden auf die Kontrollpunkt-/Gewichtungsdaten angewendet. Knoten-Array: Die Größe des Arrays muss num_control_points + Grad + 1 betragen.
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Erstellt eine BSplineCurve durch Interpolation zwischen Punkten. Anmerkung 2: Bei periodischen (geschlossenen) Kurven muss der letzte Punkt unbedingt mit dem ersten zusammenfallen.
points: Punkte für NURBS-Kurve
closeCurve: Zum Schließen der Kurve umschalten
Returns: Aus Punkten erstellte NURBS-Kurve
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
Ruft die Steuerpunkte der NurbsCurve ab. Dies sind die für die Interpolation der Kurve genutzten Punkte.
Returns: Array von Punkten