Autodesk.DesignScript.Geometry.Vector.ToString
Ruft eine Zeichenfolgendarstellung des Vektors ab

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Vergleich der zwei Vektoren
other: Der andere Vektor
Returns: Gibt an, ob diese zwei Objekte gleich sind

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
Ruft einen Hashcode für diesen Typ ab
Returns: Ein eindeutiger Hashcode für dieses Objekt

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Bildet einen Vektor durch 3 euklidische Koordinaten.
x: X-Koordinate
y: Y-Koordinate
z: Z-Koordinate
Returns: Durch Koordinaten erstellter Vektor
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Bildet einen Vektor durch 3 euklidische Koordinaten, und normalisiert ihn.
x: X-Koordinate
y: Y-Koordinate
z: Z-Koordinate
normalized: True für normalisierten Vektor, false für nicht normalisierten Vektor
Returns: Durch Koordinaten erstellter Vektor
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Bildet einen Vektor durch zwei Endpunkte. Das Ergebnis ist ein Vektor vom Startpunkt zum Endpunkt.
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
Ruft den kanonischen Vektor der X-Achse ab (1,0,0)
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
Ruft den kanonischen Vektor der Y-Achse ab (0,1,0)
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
Ruft den kanonischen Vektor der Z-Achse ab (0,0,1)
z,basis,up

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Bildet das Punktprodukt aus zwei Vektoren.
vec: zweiter Vektor
Returns: Resultierendes Punktprodukt
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Bestimmt, ob zwei Vektoren parallel sind.
otherVector: Anderer Vektor
Returns: Gibt True zurück, wenn die Vektoren parallel sind, andernfalls False.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Bestimmt, ob zwei Vektoren beinahe gleich sind. Ein Toleranzwert von 1e-5 wird für die Handhabung von Genauigkeitsproblemen verwendet.
otherVector: Anderer Vektor
Returns: Gibt True zurück, wenn die Vektoren fast gleich sind, andernfalls False.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transformiert diesen Vektor mithilfe der eingegebenen CoordinateSystem-Matrix.
coordinateSystem: Koordinatensystem für die Vektortransformation
Returns: Transformierter Vektor

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Dreht einen Vektor um den angegebenen Winkel in Grad um eine Achse.
axis: Rotationsachsenvektor
degrees: Anzahl der zu drehenden Grade
Returns: Gedrehter Vektor
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Dreht einen Vektor um den angegebenen Winkel in Grad um den Ursprungspunkt und die Normale der Ebene.
plane: Drehungsebene
degrees: Anzahl der zu drehenden Grade
Returns: Gedrehter Vektor
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Skaliert einen Vektor gleichmäßig vom Ursprung aus.
scale_factor: Skalierungsfaktor
Returns: Skalierter Vektor
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
Gibt den Winkel zwischen den beiden Vektoren im Bereich [0, 180] Grad zurück.
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Gibt den Winkel zwischen den beiden Vektoren in Grad in einem Bereich von 0 bis 360 zurück. Die Richtung des Winkels wird anhand der Drehachse bestimmt.
otherVector: Anderer Vektor
rotationAxis: Rotationsachse
Returns: Gibt den Winkel zwischen den angegebenen Vektoren in Grad von 0 bis 360 zurück
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Gibt den Winkel zwischen den beiden Vektoren im Bereich [0, 360] Grad zurück. Die Richtung des Winkels wird anhand der Drehachse bestimmt.
rotation angle