Autodesk.DesignScript.Geometry.Edge.ToString
Ruft eine Zeichenfolgendarstellung der Kante ab

Autodesk.DesignScript.Geometry.Edge.CurveGeometry
Die die Kante bildende und ihr zugrunde liegende Kurve

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
Die an diese Kante angrenzenden Flächen

Autodesk.DesignScript.Geometry.Edge.StartVertex
Der Scheitelpunkt, an dem diese Kante beginnt

Autodesk.DesignScript.Geometry.Edge.EndVertex
Der Scheitelpunkt, an dem diese Kante endet