Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
Ruft eine Zeichenfolgendarstellung des CoordinateSystem ab

Autodesk.DesignScript.Geometry.CoordinateSystem.Identity
Erstellt ein CoordinateSystem als Weltkoordinatensystem: Ursprung
0, 0, 0; X-Achse bei 1, 0, 0; Y-Achse bei 0, 1, 0; Z-Achse bei 0, 0, 1
zero,wcs

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
Erstellt ein CoordinateSystem mit Ursprung am eingegebenen Punkt mit X- und Y-Achse
als X- und Y-Achse des WKS.
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByPlane(Autodesk.DesignScript.Geometry.Plane)
Erstellt ein CoordinateSystem mit dem Ursprung am Ursprung der eingegebenen Ebene, wobei die X- und Y-Achse in der Ebene liegen und an der
X- und Y-Achse der Ebene ausgerichtet sind.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Erstellt ein CoordinateSystem am Ursprung mit X- und Y-Achse.
Die Eingabevektoren werden vor dem Erstellen des CoordinateSystem normalisiert.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Erstellt ein CoordinateSystem am Ursprung mit  X- und Y-Achse, wobei die Z-Achse
ignoriert wird. Die Eingabevektoren werden vor dem Erstellen             des CoordinateSystem normalisiert.
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Erstellt ein CoordinateSystem mit den angegebenen zylindrischen Koordinatenparametern in Bezug auf das angegebene Koordinatensystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Erstellt ein CoordinateSystem mit den angegebenen sphärischen Koordinatenparametern in Bezug auf das angegebene Koordinatensystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
Legt fest, ob es möglich ist, die Umkehrung dieses CoordinateSystem abzurufen.
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
Prüft, ob die Skalierung orthogonal ist, d. h. eine Scherkomponente enthält.
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
Prüft, ob die Skalierung orthogonal ist und alle Vektoren normalisiert wurden.
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
Erstellt einen Punkt für den Ursprung des CoordinateSystem.
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
Gibt die X-Achse des CoordinateSystem zurück.
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
Gibt die Y-Achse des CoordinateSystem zurück.
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
Gibt die Z-Achse des CoordinateSystem zurück.
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
Gibt die Skalierung des CoordinateSystem entlang der X-Achse zurück: Länge des Vektors für die X-Achse.

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
Gibt die Skalierung des CoordinateSystem entlang der Y-Achse zurück: Länge des Vektors für die Y-Achse.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
Gibt die Skalierung des CoordinateSystem entlang der Z-Achse zurück: Länge des Vektors für die Z-Achse.

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
Ruft die Umkehrung dieses CoordinateSystem ab. Durch Anwenden dieses CoordinateSystem auf ein Geometrieobjekt wird der Originalvorgang aufgehoben.

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Wendet das Argument-CoordinateSystem nach diesem an - Ergebnis = dieses * anderes

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Wendet das Argument-CoordinateSystem vor diesem an - Ergebnis = anderes * dieses

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
Gibt einen Vektor mit den X-, Y- und Z-Skalierfaktoren zurück.
Returns: Skalierter Vektor
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
Bestimmt, ob zwei CoordinateSystems gleich sind.
other: anderes Koordinatensystem
Returns: gibt true zurück, wenn Koordinatensysteme gleich sind

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
Verschiebt ein beliebiges angegebenes CoordinateSystem um die angegebenen Entfernungen in X-, Y- und
und Z-Richtung wie im WKS definiert.
xTranslation: Verschiebung entlang der X-Achse
yTranslation: Verschiebung entlang der Y-Achse
zTranslation: Verschiebung entlang der Z-Achse
Returns: Transformiertes CoordinateSystem
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
Verschiebt das Objekt in die Richtung und um den Betrag des Eingabevektors.
direction: Vektor für Translationsrichtung
Returns: Konvertiertes Koordinatensystem
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Verschiebt ein CoordinateSystem beliebigen Typs um die angegebene Entferung in die angegebene
Richtung.
direction: Vektor der Verschiebungsrichtung
distance: Abstand der Verschiebung in der angegebenen Richtung
Returns: Konvertiertes Koordinatensystem.
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Transformiert dieses CoordinateSystem aus dem Quell-CoordinateSystem in ein CoordinateSystem
im neuen Kontext.
Returns: Transformiertes CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Dreht ein Objekt um einen angegebenen Winkel in Grad um einen Ursprung und eine Achse
origin: Ursprungspunkt
axis: Vektorachse für Drehung
degrees: Grad für Drehung
Returns: Gedrehtes Koordinatensystem
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Dreht ein Objekt um einen angegebenen Winkel in Grad um den Ursprung und die Normale der angegebenen
Ebene.
plane: Ebene, von der Normale abgerufen werden soll
degrees: Drehungswert in Grad
Returns: Gedrehtes Koordinatensystem
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
Skaliert gleichmäßig vom Ursprung aus
amount: Skalierungsbetrag
Returns: Skaliertes Koordinatensystem
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
Skaliert ungleichmäßig vom Ursprung aus
xamount: An X-Achse zu skalierender Betrag
yamount: An Y-Achse zu skalierender Betrag
zamount: An Z-Achse zu skalierender Betrag
Returns: Skaliertes Koordinatensystem
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Skaliert ungleichmäßig von der angegebenen Ebene aus
plane: Ebene für Skalierung
xamount: An X-Achse zu skalierender Betrag
yamount: An Y-Achse zu skalierender Betrag
zamount: An Z-Achse zu skalierender Betrag
Returns: Skaliertes Koordinatensystem
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Einheitlich skalieren um einen bestimmten Punkt, mit
basePoint: Basispunkt für Skalierung
from: Punkt, von dem ab skaliert wird
to: Punkt, bis zu dem skaliert wird
Returns: Skaliertes Koordinatensystem
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Skaliert eindimensional anhand eines Basispunkts, eines Startpunkts (von) und eines Endpunkts (bis). Die Skalierungsachse wird von der Linie zwischen dem Basispunkt und dem Startpunkt definiert.
basePoint: Basispunkt für Skalierung
from: Punkt, von dem ab skaliert wird
to: Punkt, bis zu dem skaliert wird
Returns: Skaliertes Koordinatensystem
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Skaliert zweidimensional anhand von Basis und 2 Auswahlpunkten. Die beiden Auswahlpunkte werden auf die Basisebene projiziert, um die 2D-Skalierungsfaktoren zu ermitteln
basePlane: Basispunkt für Skalierung
from: Punkt, von dem ab skaliert wird
to: Punkt, bis zu dem skaliert wird
Returns: Skaliertes Koordinatensystem
resize,size,from,to,scale2d,2d