Autodesk.DesignScript.Geometry.Curve.ToString
Ruft eine Zeichenfolgendarstellung der Kurve ab

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Erstellt eine Kurve für die Verschmelzung zweier Kurven
curve1: Erste Kurve für die Verschmelzung
curve2: Zweite Kurve für die Verschmelzung
endOrStart1: Flag zur Kennzeichnung des zu verschmelzenden Endes von Kurve 1
endOrStart2: Flag zur Kennzeichnung des zu verschmelzenden Endes von Kurve 1
isG2Continuous: Flag, das angibt, ob die resultierende Kurve G1- oder G2-Stetigkeit aufweist
Returns: Resultierende Kurve aus der Verschmelzung zweier Kurven
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
Ruft ein CoordinateSystem mit Ursprung im Punkt am angegebenen Parameter ab. Die XAxis wird an der Kurvennormalen, die YAxis an der Tangente der Kurve in diesem Punkt und die Z-Achse am Aufwärtsvektor oder der Binormalen in diesem Punkt ausgerichtet.
param: Für die Auswertung zu verwendender Parameter
Returns: CoordinateSystem am Parameter der Kurve
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
Gibt eine Ebene zurück, deren Normale an der Tangente der Kurve ausgerichtet ist. Parameter werden so angepasst, dass 0 immer der Anfangs- und 1 immer der Endpunkt ist.
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtDistance(System.Double)
Ruft einen Punkt an einer bestimmten Bogenlänge entlang der Kurve ab.
segmentLength: Für die Auswertung zu verwendende Entfernung entlang der Kurve
Returns: Punkt an der angegebenen Bogenlänge
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
Gibt Punkte in regelmäßigen Abständen entlang der Länge der Kurve basierend auf der eingegebenen Anzahl der Unterteilungen zurück.
divisions: Anzahl der Unterteilungen
Returns: In gleichmäßigen Abständen auf der Kurve verteilte Punkte

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
Gibt Punkte entlang der Kurve mit gleicher Sehnenlänge basierend auf der eingegebenen Anzahl der Unterteilungen zurück.
divisions: Anzahl der Unterteilungen
Returns: Liste der Punkte auf der Kurve

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Gibt Punkte in gleichmäßigen Abständen entlang der Kurve mit der angegebenen Segmentlänge ausgehend vom angegebenen Punkt zurück.
point: Bezugspunkt für den Beginn der Messung
segmentLength: Für die Auswertung zu verwendende Entfernung entlang der Kurve
Returns: Liste der Punkte auf der Kurve

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Gibt Punkte auf der Kurve mit der angegebenen Sehnenlänge ausgehend vom angegebenen Punkt zurück.
point: Bezugspunkt für den Beginn der Messung.
chordLength: Sehnenlänge
Returns: Liste der Punkte auf der Kurve

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
Gibt ein CoordinateSystem mit dem angegebenen Abstand vom Startpunkt der Kurve zurück. Die Y-Achse verläuft tangential zur Kurve, die X-Achse gibt die Krümmung an.
segmentLength: Für die Auswertung zu verwendende Entfernung entlang der Kurve
Returns: CoordinateSystem auf Kurve
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtDistance(System.Double)
Gibt ein CoordinateSystem mit dem angegebenen Abstand vom Startpunkt der Kurve zurück. Die Y-Achse verläuft tangential zur Kurve, die X-Achse gibt die Krümmung an.
segmentLength: Für die Auswertung zu verwendende Entfernung entlang der Kurve
Returns: CoordinateSystem auf Kurve
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
Gibt eine Ebene mit dem angegebenen Abstand entlang der Kurve beginnend an deren Startpunkt zurück. Die Normale der Ebene ist an der Tangente der Kurve ausgerichtet.
segmentLength: Für die Auswertung zu verwendende Entfernung entlang der Kurve
Returns: Ebene auf Kurve
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PlaneAtDistance(System.Double)
Gibt eine Ebene mit dem angegebenen Abstand entlang der Kurve beginnend an deren Startpunkt zurück. Die Normale der Ebene ist an der Tangente der Kurve ausgerichtet.
segmentLength: Für die Auswertung zu verwendende Entfernung entlang der Kurve
Returns: Ebene auf Kurve
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
Ruft die Segmentlänge gemessen vom Startpunkt der Kurve bis zum angegebenen Parameter ab.
param: Wert zwischen 0 und 1
Returns: Segmentlänge
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtDistance(System.Double)
Ruft den Parameter für eine bestimmte Bogenlänge entlang der Kurve ab.
segmentLength: Für die Auswertung zu verwendende Entfernung entlang der Kurve
Returns: Parameter
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.LengthBetweenParameters(System.Double,System.Double)
Ruft die Bogenlänge zwischen zwei Parameterpunkten auf der Kurve ab.
startParam: Anfang der Domäne
endParam: Ende der Domäne
Returns: Bogenlänge zwischen den beiden Parametern
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Ruft den Parameter an einem bestimmten Punkt auf der Kurve ab. Liegt der Punkt nicht auf der Kurve, wird der am nächsten gelegene Parameter abgerufen. Wenn die Eingabekurve eine PolyCurve ist, gibt diese Funktion nur dann einen gültigen Parameter zurück, wenn der Punkt auf der PolyCurve liegt. Für andere Kurventypen gibt diese Funktion den Parameter entlang der Kurve zurück, die am nächsten zum Eingabepunkt gelegenen Punkt liegt.
point: Ein Punkt entlang oder in der Nähe der Kurve
Returns: Der Parameter auf der Kurve für PolyCurves oder der nächstgelegene Parameter auf der Kurve für andere Kurventypen.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.DivideEqually(System.Int32)
Teilt die Kurve in die angegebene Anzahl von Kurven gleicher Länge.
divisions: Anzahl der Unterteilungen
Returns: Array von Kurven nach der Teilung
chopcurve,segment,slices

Autodesk.DesignScript.Geometry.Curve.DivideByDistance(System.Int32)
Teilt die Kurve in die angegebene Anzahl von Kurven mit gleichen Abständen zwischen Anfangs- und Endpunkt jeder Kurve (gleichen Sehnen).
divisions: Anzahl der Unterteilungen
Returns: Array von Kurven nach der Teilung
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByLengthFromParameter(System.Double,System.Double)
Teilt die Kurve in Kurven der angegebenen Länge, gemessen ab der angegebenen Parameterposition.
length: Länge der Kurven nach der Unterteilung
parameter: Parameterposition für Messung
Returns: Array von Kurven nach Teilung
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByDistanceFromParameter(System.Double,System.Double)
Teilt die Kurve in Kurven mit der angegebenen Sehnenlänge, gemessen ab der angegebenen Parameterposition.
distance: Sehnenlänge der einzelnen durch die Teilung entstehenden Kurven
parameter: Parameterposition für Messung
Returns: Array von Kurven nach der Teilung
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimStart(System.Double)
Entfernt den Anfang der Kurve am angegebenen Parameter.
startParameter: Der Parameter für den Anfang der Stutzung
Returns: Neue Kurve nach Entfernen des Anfangs
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimEnd(System.Double)
Entfernt das Ende der Kurve am angegebenen Parameter.
endParameter: Der Parameter für den Anfang der Stutzung
Returns: Neue Kurve nach Entfernen des Endes
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrim(System.Double,System.Double)
Entfernt den Anfang und das Ende der Kurve an den angegebenen Parametern.
startParameter: Der Parameter für den Anfang der Stutzung
endParameter: Der Parameter für den Anfang der Stutzung
Returns: Neue Kurve nach Entfernen der äußeren Segmente
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.ParameterTrimInterior(System.Double,System.Double)
Entfernt den inneren Teil einer Kurve an den angegebenen Parametern.
startParameter: Der Parameter für den Anfang der Stutzung
endParameter: Der Parameter für den Anfang der Stutzung
Returns: Neue Kurve nach Entfernen des inneren Segments
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimSegments(System.Double[])
Entfernt mehrere Segmente der Kurve, wobei das 1., 3., 5. Segment usw. verworfen werden.
parameters: Liste der Parameter zum Teilen der Kurve
Returns: Array von Kurven, wobei das 1., 3., 5. Segment usw. verworfen werden
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
Entfernt mehrere Segmente der Kurve, wobei das 2., 4., 6. Segment usw. verworfen werden, wenn der boolesche Ausdruck true ist
parameters: Liste der Parameter zum Teilen der Kurve
discardEvenSegments: Festlegen, ob geradzahlige Segmente verworfen werden sollen oder nicht
Returns: Array von Kurven, wobei das 2., 4., 6. Segment usw. verworfen werden, wenn im booleschen Ausdruck true angegeben wurde.
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double)
Teilt eine Kurve am angegebenen Parameter in zwei Teile.
parameter: Parameter zum Teilen der Kurve
Returns: Die beiden nach der Teilung verbleibenden Kurven
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double)
Teilt eine Kurve am angegebenen Parameter in zwei Teile.
parameter: Parameter zum Teilen der Kurve
Returns: Die beiden nach der Teilung verbleibenden Kurven
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double[])
Teilt eine Kurve in mehrere Teile an den angegebenen Parametern.
parameters: Liste der Parameter zum Teilen der Kurve
Returns: Durch Teilung erstellte Kurven
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(Autodesk.DesignScript.Geometry.Curve)
Verbindet diese Kurve und die eingegebene Kurve zu einer neuen PolyCurve, wobei die ursprünglichen Kurven genau erhalten bleiben.
curve: Kurve, mit der verbunden werden soll
Returns: Aus den beiden Kurven gebildete PolyCurve
convertcurve,curve2polycurve,joincurve,concat

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
Verlängert eine Kurve um die angegebene Strecke am durch einen Auswahlpunkt festgelegten Ende. Die ausgewählte Seite wird verlängert. Geschlossene Kurven wie Kreise und Ellipsen können nicht verlängert werden.
distance: Strecke für Verlängerung
pickSide: Punkt am zu verlängernden Ende
Returns: Verlängerte Kurve
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
Verlängert eine Kurve um die angegebene Strecke an ihrem Anfang. Geschlossene Kurven wie Kreise und Ellipsen können nicht verlängert werden.
distance: Strecke für Verlängerung
Returns: Verlängerte Kurve
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
Verlängert eine Kurve um die angegebene Strecke an ihrem Ende. Geschlossene Kurven wie Kreise und Ellipsen können nicht verlängert werden.
distance: Strecke für Verlängerung
Returns: Verlängerte Kurve
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Patch
Füllt eine geschlossene Kurve.
Returns: Surface im Inneren der Kurve
fill,profiletosurf,loop,loop2surf,edgesurf

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projiziert eine Eingabekurve entlang einer angegebenen Projektionsrichtung auf eine festgelegte Basisgeometrie. Geometrie zur Projektion von ontoVectorList von Geometrien, die in die Basisgeometrie projiziert werden