Autodesk.DesignScript.Geometry.UV.ToString
Ruft eine Zeichenfolgendarstellung des UV ab

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
Vergleich der zwei UVs
other: Der andere UV
Returns: Gibt an, ob diese zwei Objekte gleich sind

Autodesk.DesignScript.Geometry.UV.GetHashCode
Ruft einen Hashcode für diesen Typ ab
Returns: Ein eindeutiger Hashcode für dieses Objekt