Autodesk.DesignScript.Geometry.Line.ToString
Ruft eine Zeichenfolgendarstellung der Linie ab

Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Erstellt eine zur eingegebenen Kurve tangentiale Linie am Parameterpunkt der eingegebenen Kurve.
curve: Basiskurve für Tangentenlinie
parameter: Parameterwert
Returns: Tangentenlinie
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Erstellt eine gerade Linie mit der angegebenen Länge vom Startpunkt ausgehend in Vektorrichtung.
startPoint: Linienanfangspunkt
direction: Richtungsvektor
length: Länge der Linie
Returns: Linie von Anfangsrichtung und -länge
linebyvector,lines