Autodesk.DesignScript.Geometry.PolyCurve.ToString
Ruft eine Zeichenfolgendarstellung der PolyCurve ab

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Erstellt eine PolyCurve durch Verbinden von Kurven. Kehrt die Kurve nach Bedarf um, um die Verbindung sicherzustellen. Wählen Sie eine bevorzugte Gelenktoleranz zwischen 1e-6 und 1e-3 Einheiten aus.
curves: Zur PolyCurve zu verbindende Kurven
joinTolerance: Toleranz zur Bestimmung der zulässigen Spaltgröße zwischen den zu verbindenden Kurven
Returns: Polykurve aus verbundenen Kurven erstellt
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Erstellen Sie eine oder mehrere Polykurven, indem Sie verbundene Kurven gruppieren. Wählen Sie eine bevorzugte Verbindungstoleranz zwischen 1e-6 und 1e-3 Einheiten aus.
curves: Kurven, die zu einer oder mehreren PolyCurves gruppiert werden sollen
joinTolerance: Toleranz zur Bestimmung der zulässigen Spaltgröße zwischen den zu verbindenden Kurven

Autodesk.DesignScript.Geometry.PolyCurve.Curves
Gibt die Kurven in der Polykurve zurück.
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
Verlängert eine Polykurve durch einen Tangentenbogen.
length: Länge des Verlängerungsbogens
radius: Radius des Bogens
endOrStart: Angabe, ob vom Anfang oder Ende der PolyCurve aus verlängert werden soll

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Abrundung für Polykurve in ihrer Ebene
radius: Radius für Abrundung
rightSide: True für Abrundung auf der rechten Seite in Bezug auf den Start der Polykurve, false für Abrundung auf der linken Seite
Returns: Abgerundete PolyCurve
round,smooth,radius