Autodesk.DesignScript.Geometry.Point.ToString
Ruft eine Zeichenfolgendarstellung des Punkts ab

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Vergleich der zwei Punkte
other: Der andere Punkt
Returns: Gibt an, ob diese zwei Objekte gleich sind

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
Ruft einen Hashcode für diesen Typ ab
Returns: Ein eindeutiger Hashcode für dieses Objekt

Autodesk.DesignScript.Geometry.Point.Origin
Ruft den Ursprung ab (0,0,0).
Returns: Ursprungspunkt
zero,origin