Autodesk.DesignScript.Geometry.Rectangle.ToString
Ruft eine Zeichenfolgendarstellung des Rechtecks ab

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Erstellt ein Rectangle zentriert am Ursprung des WKS in der XY-Ebene des WKS mit der angegebenen Breite (X-Achse) und Länge (Y-Achse).
width: Breite des Rechtecks
length: Länge des Rechtecks
Returns: Durch Breite und Länge erstelltes Rechteck
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Erstellt ein Rectangle zentriert am Ursprung der eingegebenen Plane mit der eingegebenen Breite (X-Achse) und Länge (Y-Achse).
plane: Zum Zentrieren des Rechtecks verwendete Ebene
width: Breite des Rechtecks
length: Länge des Rechtecks
Returns: Durch Breite und Länge erstelltes Rechteck
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Erstellt ein Rectangle zentriert am eingegebenen Ursprung in der XY-Ebene des CoordinateSystem mit der angegebenen Breite (X-Achse) und Länge (Y-Achse).
coordinateSystem: Koordinatensystem des Rechtecks (Mittelpunkt des Rechtecks)
width: Breite des Rechtecks
length: Länge des Rechtecks
Returns: Aus Breite und Länge erstelltes Rechteck
rectbylengths