Autodesk.DesignScript.Geometry.Arc.ToString
Ruft eine Zeichenfolgendarstellung des Bogens ab

Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Erstellt einen Bogen oder Doppelbogen aus Start- und Endpunkt sowie Tangenten an Anfang und Ende.
point1: Punkt für den Anfang des Doppelbogens
vector1: Tangentenvektor für den Anfang des Doppelbogens
point2: Punkt für das Ende des Doppelbogens
vector2: Tangentenvektor für das Ende des Doppelbogens
arc,tangent

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Erstellt einen Bogen aus Start- und Endpunkt mit Starttangente zum Vektor.
startPoint: Startpunkt des Bogens
endPoint: Endpunkt des Bogens
startTangent: Richtungsvektor der Starttangente
arc,tangent,arcs