Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Umožňuje převést povrch TSpline na těleso nebo povrch v závislosti na tvaru.
Poznámka: Možná budou menší neočekávatelné změny ve výsledném B-Rep, pokud je vstupní povrch vytvořen ve vyšší verzi T-Spline než verze načtená v aplikaci Dynamo. V tomto případě bude kopie povrchu zhoršena na verzi aplikace Dynamo a bude použita v převodu.
matchTopology: Určuje, zda by výsledné těleso mělo mít stejnou topologii jako vstupní povrch TSpline.
Returns: Entita topologie (těleso nebo povrch)
tspline,brep,solid,surface