Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Vytvořte objekt BSplineCurve pomocí explicitních řídicích bodů. POZNÁMKA 1: Objekty BSplineCurve s hodnotou deg=1 mají přerušení G1, což může vést k problémům s vysunutím, tažením a jinými operacemi. Neměly by se používat. Místo nich použijte objekt PolyCurve. POZNÁMKA 2: Pokud je oblouk periodický (uzavřený), pak první a poslední bod MUSÍ být stejné.
points: Body křivky nurbs
Returns: Křivka Nurbscurve vytvořená z bodů
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Vytvořte objekt BSplineCurve pomocí explicitních řídicích bodů. POZNÁMKA 1: Objekty BSplineCurve s hodnotou deg=1 mají přerušení G1, což může vést k problémům s vysunutím, tažením a jinými operacemi. Neměly by se používat. Místo nich použijte objekt PolyCurve. POZNÁMKA 2: Pokud je oblouk periodický (uzavřený), pak první a poslední bod MUSÍ být stejné.
points: Body křivky nurbs
degree: Stupeň křivky
Returns: Křivka Nurbscurve vytvořená z bodů
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Vytvořte objekt BSplineCurve pomocí explicitních řídicích bodů. POZNÁMKA 1: Objekty BSplineCurve s hodnotou deg=1 mají přerušení G1, což může vést k problémům s vysunutím, tažením a jinými operacemi. Neměly by se používat. Místo nich použijte objekt PolyCurve. POZNÁMKA 2: Pokud je oblouk periodický (uzavřený), pak první a poslední bod MUSÍ být stejné.
points: Body křivky nurbs
degree: Stupeň křivky
closeCurve: Přepnout na uzavření křivky
Returns: Křivka Nurbscurve vytvořená z bodů
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Vytvořte objekt BSplineCurve pomocí interpolace mezi body. POZNÁMKA 2: Pokud je křivka periodická (uzavřená), MUSÍ být první a poslední bod stejné.
points: Body křivky nurbs
closeCurve: Přepnout na uzavření křivky
Returns: Křivka Nurbscurve vytvořená z bodů
fit,approximate,spline,lines
0.5,0.5,0.5,0.45