Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Vytvořte elipsu vystředěnou na vstupní bod, zarovnanou s rovinou XY GSS a s určenými poloměry osy X a Y.
origin: Bod počátku elipsy
xAxisRadius: Poloměr osy X
yAxisRadius: Poloměr osy Y
Returns: Elipsa vytvořená pomocí počátku a poloměrů
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Vytvořte elipsu vystředěnou na vstupní bod, se dvěma zadanými osami. Osy by navzájem měly svírat úhel 90 stupňů.
origin: Bod počátku elipsy
xAxisRadius: Poloměr osy X
yAxisRadius: Poloměr osy Y
Returns: Elipsa vytvořená z vektorů počátku
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Vytvořte elipsu vystředěnou a zarovnanou se vstupním systémem CoordinateSystem, s poloměrem x_radius ve směru X systému CS a poloměrem y_radius ve směru Y systému CS.
origin: Souřadnicový systém počátku elipsy
xAxisRadius: Poloměr osy X
yAxisRadius: Poloměr osy Y
Returns: Elipsa vytvořená pomocí souřadnicového systému a poloměrů
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Vytvořte elipsu vystředěnou a zarovnanou se vstupní rovinou, s poloměrem x_radius ve směru osy X roviny a s poloměrem y_radius ve směru osy Y roviny.
plane: Rovina, kde je nakreslen oblouk elipsy
xAxisRadius: Poloměr osy X
yAxisRadius: Poloměr osy Y
Returns: Elipsa vytvořená z roviny a poloměrů
ellipse,aligned ellipse,ellipsebylengths