Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Vytvořte kvádr vystředěný na vstupní bod, s určenou šířkou, délkou a výškou.
origin: Bod počátku
width: Šířka kvádru
length: Délka kvádru
height: Výška kvádru
Returns: Kvádr vytvořený pomocí délek
box,cube,cubebysize,bycenter,cubes