Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Vytvořte tečnu na vstupní křivku, umístěnou na bod parametru vstupní křivky.
curve: Základní oblouk pro tečnu
parameter: Hodnota parametru
Returns: Tečna
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Vytvořte přímou čáru od počátečního bodu, přičemž ji prodlužte ve směru vektoru podle zadané délky.
startPoint: Počáteční bod čáry
direction: Směrový vektor
length: Délka čáry
Returns: Čára od počátečního směru a délka
linebyvector,lines