Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Vytvoří kružnici se zadaným středem a poloměrem v globální rovině XY, s rovinou Z jako normálou.
centerPoint: Střed kružnice
radius: Poloměr
Returns: Kružnice vytvořená pomocí středu a poloměru
circle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
Vytvořte kružnici vystředěnou na počátku vstupní roviny (kořenu), ležící ve vstupní rovině, se zadaným poloměrem.
plane: Kořen roviny použitý k vystředění kružnice
radius: Poloměr
Returns: Kružnice vytvořená pomocí roviny a poloměru
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Vytvořte kružnici procházející třemi vstupními body.
p1: 1. bod kružnice
p2: 2. bod kružnice
p3: 3. bod kružnice
circle