Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Vytvoří „orientovanou“ rovinu umístěnou v počátku bodu s normálovým vektorem, ale se specifickou orientací osy X. Toto nastavení nemá žádný vliv na rozdělení, průsečíky, promítnutí a jiné podobné operace, pouze určuje orientaci vstupního souřadnicového systému.
origin: Bod počátku roviny
normal: Normálový směrový vektor
xAxis: Směrový vektor osy X
Returns: Rovina podle normály počátku a osy x

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Vytvořte rovinu obsahující vstupní čáru a externí bod. Bod nemůže ležet na čáře nebo na ose čáry.
line: Čára použitá k určení roviny
point: Bod použitý k určení roviny
Returns: Rovina vytvořená z čáry a bodu
lines
0.4