Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Získat průsečík dvou objektů BoundingBox
other: Jiný hraniční obdélník k protnutí
Returns: Hraniční obdélník získaný z průniku hraničních obdélníků

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Určit, zda se dva objekty BoundingBox protínají
other: Jiný hraniční obdélník
Returns: Protínají se hraniční obdélníky
get overlap