Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Vytváří objekt NurbsSurface s určenými interpolovanými body a stupni U a V. Výsledný povrch bude procházet všemi body.
points: Osnova bodů pro povrch nurbs
uDegree: Stupeň ve směru U
vDegree: Stupeň ve směru V
Returns: Povrch Nurbs vytvořený pomocí bodů
fit,topoints