Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Vytvořte jeden nebo více objektů PolyCurve seskupením spojených křivek. Vyberte preferovanou toleranci spojení mezi 1e-6 a 1e-3 jednotkami.
curves: Křivky, které chcete seskupit dohromady, aby se vytvořil jeden nebo více objektů PolyCurve
joinTolerance: Tolerance, která určuje velikost povolené mezery mezi spojovanými křivkami

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Objekt PolyCurve zaoblení v jeho rovině
radius: Poloměr zaoblení
rightSide: Hodnota True znamená zaoblení napravo vzhledem k počátku objektu polycurve, hodnota false označuje zaoblení na levé straně
Returns: Zaoblený objekt PolyCurve
round,smooth,radius