Autodesk.DesignScript.Geometry.Properties.Resources.OutsideAllowableModelingRange
Vyhledá lokalizovaný řetězec podobný řetězci „Vstup leží mimo povolený rozsah modelování. Zvažte výběr nastavení {0} s rozsahem modelování v rozsahu {1} až {2} z nabídky Předvolby => Obecné => Měřítko geometrie.“.