Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Vytvořte povrch pomocí šablonování mezi křivkami vstupního příčného řezu.
crossSections: Křivky, kterými se má šablonovat
Returns: Povrch vytvořený šablonováním
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Šablonujte povrch prostřednictvím průřezů s určenými vodicími křivkami (neboli trajektoriemi). Vodicí křivka musí protínat všechny křivky průřezů.
crossSections: Křivky, kterými se má šablonovat
guideCurves: Křivky, kterými bude šablonování vedeno
Returns: Povrch vytvořený šablonováním
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Vytvořte povrch mnohoúhelníku spojující vstupní body v uzavřeném polygonu a opravující jej.
points: Seznam bodů obvodu
Returns: Povrch vytvořený z bodů obvodu
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Vytvořte povrch tažením křivky profilu kolem paprsku osy vytvořeného pomocí bodu počátku ve směru vektoru osy, počínaje objektem start_angle ve stupních a pokračujíce tažením objektu sweep_angle ve stupních.
profile: Křivka profilu k rotaci
axisOrigin: Počátek osy rotace
axisDirection: Směr osy rotace
startAngle: Počáteční úhel ve stupních
sweepAngle: Úhel tažení ve stupních
Returns: Povrch vytvořený rotací profilu
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Vytvořte povrch vyplněním vnitřní části uzavřené hranice definované vstupními křivkami.
closedCurve: Uzavřená křivka použitá jako hranice povrchu
Returns: Povrch vytvořený záplatou
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Zobrazí se reprezentace NURBS povrchu s určenou tolerancí. Tato metoda může v určitých případech aproximovat povrch.
tolerance: Zadaná tolerance
Returns: Reprezentace povrchu pomocí nurbs povrchu
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Zesilte plochu na těleso tím, že ji vysunete ve směru normály povrchu na obou stranách povrchu.
thickness: Množství k zesílení
Returns: Zesílený povrch jako těleso
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Zesilte plochu na těleso tím, že ji vysunete ve směru normál povrchu. Pokud má parametr both_sides hodnotu true, povrch se zesílí na obou stranách.
thickness: Množství k zesílení
both_sides: Vrací hodnotu true pro zesílení na obou stranách, false pro zesílení na jedné straně
Returns: Zesílený povrch jako těleso
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
Vrácený souřadnicový systému využívá osy xAxis, yAxis a zAxis a pomocí nich reprezentuje uDir, vDir a normálu. Délka os xAxis, yAxis představuje zakřivení.
u: Komponenta U parametru
v: Komponenta V parametru
Returns: Souřadnicový systém založený na normále, směru U a směru V na pozici UV na povrchu

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Vrací nový povrch s převrácenými normálami. Tento povrch ponechá beze změny.
Returns: Povrch, který je stejný jako vstupní povrch, ale má obrácené normály