Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Vytvořte těleso rotace pomocí tažení křivky profilu kolem paprsku osy, který je tvořen počátkem a vektorem osy, a to z počátečního úhlu ve stupních do úhlu tažení ve stupních.
profile: Křivka profilu k rotaci
axisOrigin: Počátek osy rotace
axisDirection: Směr osy rotace
startAngle: Počáteční úhel ve stupních
sweepAngle: Úhel tažení ve stupních
Returns: Těleso vytvořené rotací
Brep,brep,lathe,revolveprofile