Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Vytvořte šroubovici. Šroubovice se vždy otáčí ve směru hodinových ručiček okolo zadaného směru osy. Při prohlížení podél směru osy se v prohlížeči zobrazí bod otáčející se ve směru pohybu hodinových ručiček kolem osy, protože se pohybuje po křivce ve směru vzrůstajícího parametru. Rozteč je vzdálenost, kterou šroubovice urazí ve směru osy za jedno otočení. Tato hodnota může být kladná nebo záporná.
axisPoint: Bod osy
axisDirection: Směrový vektor osy
startPoint: Počáteční bod šroubovice
pitch: Vzdálenost šroubovice na každých 360 stupňů ve směru osy
angleTurns: Počet otočení ve stupních
Returns: Šroubovice vytvořená pomocí osy
helix,screw,corkscrew,thread