Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Vytvořit vektor pomocí 3 euklidovských souřadnic
x: Souřadnice X
y: Souřadnice Y
z: Souřadnice Z
Returns: Vektor vytvořený pomocí souřadnic
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Vytvořit vektor pomocí 3 euklidovských souřadnic a normalizovat vektor
x: Souřadnice X
y: Souřadnice Y
z: Souřadnice Z
normalized: Hodnota True znamená normalizaci vektoru, hodnota false označuje neprovedení normalizace
Returns: Vektor vytvořený pomocí souřadnic
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Vytvořit skalární součin dvou vektorů
vec: druhý vektor
Returns: Výsledný skalární součin
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Určit, zda jsou dva vektory rovnoběžné.
otherVector: Jiný vektor
Returns: Vrací hodnotu true, pokud jsou vektory rovnoběžné, jinak vrací hodnotu false.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Určit, zda se dva vektory téměř rovnají. Kvůli správnému zpracování přesnosti je dána hodnota tolerance 1e-5.
otherVector: Jiný vektor
Returns: Vrací hodnotu true, pokud jsou vektory téměř stejné, jinak vrací hodnotu false.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transformovat tento vektor pomocí vstupní matice systému CoordinateSystem
coordinateSystem: Souřadnicový systém použitý k transformaci vektoru
Returns: Transformovaný vektor

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Otočí vektor kolem osy o zadaný počet stupňů.
axis: Vektor osy rotace
degrees: Počet stupňů k otočení
Returns: Otočený vektor
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Otočí vektor kolem počátku roviny a normály podle zadaného stupně.
plane: Rovina otočení
degrees: Počet stupňů k otočení
Returns: Otočený vektor
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Upravit měřítko vektoru rovnoměrně kolem počátku
scale_factor: Faktor měřítka
Returns: Vektor s měřítkem
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Vrací úhel mezi dvěma vektory ve stupních od 0 do 360. Prostřednictvím osy otáčení určuje směr úhlu.
otherVector: Jiný vektor
rotationAxis: Osa rotace
Returns: Vrací úhel mezi zadanými vektory ve stupních od 0 do 360
rotation angle,