Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Vytvořte obdélník vystředěný na počátek systému GSS v rovině XY systému GSS se zadanou šířkou (délka osy x) a délkou (délka osy Y).
width: Šířka obdélníku
length: Délka obdélníku
Returns: Obdélník vytvořený pomocí šířky a délky
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Vytvořte obdélník vystředěný na kořen vstupní roviny se vstupní šířkou (délka osy X roviny) a délkou (délka osy Y roviny).
plane: Rovina použitá k vystředění obdélníku
width: Šířka obdélníku
length: Délka obdélníku
Returns: Obdélník vytvořený pomocí šířky a délky
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Vytvořte obdélník vystředěný na vstupní počátek v rovině XY systému CoordinateSystem se zadanou šířkou (délka osy x) a délkou (délka osy Y).
coordinateSystem: Souřadnicový systém obdélníku (střed obdélníku)
width: Šířka obdélníku
length: Délka obdélníku
Returns: Obdélník vytvořený z šířky a délky
rectbylengths