Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Vytvořit oblouk z počátečního bodu do koncového bodu s počáteční tečnou k vektoru
startPoint: Počáteční bod oblouku
endPoint: Koncový bod oblouku
startTangent: Počáteční směrový vektor tečny
arc,tangent,arcs