DSCore.List.IndexOf(System.Collections.IList,System.Object)
Retorna o índice do elemento na lista fornecida. A correspondência entre a lista fornecida e o elemento de destino deve ser exata (ou seja, int com int, double com double, double com double, object com object etc.)
list: A lista na qual localizar o elemento.
element: O elemento cujo índice deve ser retornado.
O índice do elemento na lista. Índice inválido – retornará 1 se não for encontrada uma correspondência exata.
index,indexof

DSCore.List.Cycle(System.Collections.IList,System.Int32)
Cria uma nova lista ao concatenar as cópias de uma determinada lista.
list: Lista para repetir.
amount: Número de vezes para repetir.
Lista de listas repetidas do tipo: var[]..[]
repeat,repeated,duplicate,repeated list,concat list