DSCore.DateTime.Components(System.DateTime)
Extrai os componentes individuais de uma data/hora.
dateTime: Data/hora da qual são obtidos os componentes
Representação numérica do ano (1-9999)
Representação numérica do mês (1-12)
Representação numérica do dia (1 a [dias no mês])
Representação numérica da hora (0-23)
Representação numérica dos minutos (0-59)
Representação numérica dos segundos (0-59)
Representação numérica dos segundos (0-999)