DSCore.DummyPythonEvaluator
O avaliador do Python que somente gerará um erro durante a avaliação.
É usado principalmente para indicar que não foi possível localizar um avaliador real do Python.

DSCore.DummyPythonEvaluator.Evaluate(System.String,System.Collections.IList,System.Collections.IList)
Gera uma exceção com a mensagem atribuída