Autodesk.DesignScript.Geometry.Properties.Resources.OutsideAllowableModelingRange
Procura uma sequência de caracteres localizada semelhante ao As entradas estão fora do intervalo de modelagem permitido, considere a possibilidade de escolher a configuração {0} com um intervalo de modelagem entre {1} e {2} na caixa de diálogo “Preferências => Geral => Escala da geometria”.