Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Cria uma superfície Nurb com pontos interpolados especificados e graus U e V.  A superfície resultante irá passar através de todos os pontos.
points: Grade de pontos da superfície nurbs
uDegree: Grau na direção u
vDegree: Grau na direção v
Returns: Superfície nurbs criada por pontos
fit,topoints