Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Criar um arco a partir do ponto inicial ao ponto final com a tangente inicial para o vetor
startPoint: Ponto inicial do arco
endPoint: Ponto final do arco
startTangent: Vetor de direção tangente inicial
arc,tangent,arcs