Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Cria uma hélice. A hélice sempre rotaciona no sentido horário sobre o eixo de direção fornecido. Ao visualizar ao longo da direção do eixo de direção, o usuário verá o ponto virando no sentido horário ao redor do eixo quando ele se move ao longo da curva na direção do parâmetro aumentando. O declive é a distância na qual a hélice se move na direção do eixo por vez. Isto pode ser positivo ou negativo.
axisPoint: Ponto do eixo
axisDirection: Vetor de direção do eixo
startPoint: Ponto inicial da hélice
pitch: Distância da hélice por cada 360 graus na direção do eixo
angleTurns: Número de voltas em graus
Returns: Hélice criada usando o eixo
helix,screw,corkscrew,thread