Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Crie uma retângulo centralizado na origem do WCS no plano XY do WCS, com a largura (comprimento do eixo X) e comprimento (comprimento do eixo Y) especificados.
width: Largura do retângulo
length: Comprimento do retângulo
Returns: Retângulo criado usando a largura e o comprimento
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Crie um retângulo centralizado na raiz do plano de entrada, com a largura (comprimento do eixo X do plano) e o comprimento (comprimento do eixo Y do plano) de entrada.
plane: Plano usado para centralizar o retângulo
width: Largura do retângulo
length: Comprimento do retângulo
Returns: Retângulo criado usando a largura e o comprimento
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crie um retângulo centralizado na origem da entrada do plano XY do CoordinateSystem, com a largura (comprimento do eixo X) e o comprimento (comprimento do eixo Y) especificados.
coordinateSystem: Sistema de coordenadas do retângulo (centro do retângulo)
width: Largura do retângulo
length: Comprimento do retângulo
Returns: Retângulo criado com base na largura e no comprimento
rectbylengths