Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Criar um grupo de índices armazenando três índices
a: Índice a
b: Índice b
c: Índice c
Returns: IndexGroup
tri,polygon,mesh,meshes