Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crie uma BSplineCurve utilizando os pontos de controle explícitos. NOTA 1: BSplineCurves com deg=1 tem descontinuidades G1, que causam problemas para a extrusão, extrusão por percurso e outras operações. Elas devem ser evitadas. Utilize em seu lugar uma PolyCurve.  NOTA 2: se a curva for periódica (fechada), então os últimos pontos DEVEM ser os mesmos.
points: Pontos da curva nurbs
Returns: Nurbscurve criada com base nos pontos
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Crie uma BSplineCurve utilizando os pontos de controle explícitos. NOTA 1: BSplineCurves com deg=1 tem descontinuidades G1, que causam problemas para a extrusão, extrusão por percurso e outras operações. Elas devem ser evitadas. Utilize em seu lugar uma PolyCurve.  NOTA 2: se a curva for periódica (fechada), então os últimos pontos DEVEM ser os mesmos.
points: Pontos da curva nurbs
degree: Grau da curva
Returns: Nurbscurve criada com base nos pontos
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Crie uma BSplineCurve utilizando os pontos de controle explícitos. NOTA 1: BSplineCurves com deg=1 tem descontinuidades G1, que causam problemas para a extrusão, extrusão por percurso e outras operações. Elas devem ser evitadas. Utilize em seu lugar uma PolyCurve.  NOTA 2: se a curva for periódica (fechada), então os últimos pontos DEVEM ser os mesmos.
points: Pontos da curva nurbs
degree: Grau da curva
closeCurve: Alternar para fechar curva
Returns: Nurbscurve criada com base nos pontos
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Crie uma BSplineCurve ao interpolar entre pontos. NOTA 2: se a curva for periódica (fechada), então o primeiro e o último ponto DEVE ser o mesmo.
points: Pontos da curva nurbs
closeCurve: Alternar para fechar curva
Returns: Nurbscurve criada com base nos pontos
fit,approximate,spline,lines
0.5,0.5,0.5,0.45