Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Crie uma elipse centralizada no ponto de entrada, alinhada com o plano XY do WCS, com o raio especificado dos eixos X e Y.
origin: Ponto de origem da elipse
xAxisRadius: Raio do eixo X
yAxisRadius: Raio do eixo Y
Returns: Elipse criada usando a origem e os raios
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crie uma elipse centralizada no ponto de entrada, com dois eixos especificados.  Os eixos devem estar a 90 graus um do outro.
origin: Ponto de origem da elipse
xAxisRadius: Raio do eixo X
yAxisRadius: Raio do eixo Y
Returns: Elipse criada com base em vetores de origem
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crie uma elipse centralizada e alinhada com o CoordinateSystem de entrada, com um raio x_raio na direção CS e o raio y_raio na direção CS Y.
origin: Sistema de coordenadas de origem da elipse
xAxisRadius: Raio do eixo X
yAxisRadius: Raio do eixo Y
Returns: Elipse criada usando o sistema de coordenadas e os raios
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Crie uma elipse centralizada e alinhada com um plano de entrada, com um raio x_raio na direção do eixo X do plano e raio y_raio na direção do eixo Y do plano.
plane: Plano onde o arco da elipse é desenhado
xAxisRadius: Raio do eixo X
yAxisRadius: Raio do eixo Y
Returns: Elipse criada com base no plano e nos raios
ellipse,aligned ellipse,ellipsebylengths