Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Crie um sólido de revolução, efetuando a extrusão por percurso da curva do perfil em torno do eixo do raio formada pela origem e pelo vetor do eixo, desde o ângulo inicial em graus até o ângulo com extrusão por percurso em graus.
profile: Curva de perfil para revolução
axisOrigin: Origem do eixo de revolução
axisDirection: Direção do eixo de revolução
startAngle: Ângulo inicial em graus
sweepAngle: Ângulo de varredura em graus
Returns: Sólido criado usando a revolução
Brep,brep,lathe,revolveprofile