Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Converta a superfície da T-Spline em sólido ou superfície dependendo da forma.
Observação: Poderão existir sutis diferenças inesperadas no B-Rep resultante se a superfície de entrada for criada em uma versão da T-Splines superior à da versão carregada no Dynamo. Nesse caso, uma cópia da superfície será rebaixada para a versão do Dynamo e usada na conversão.
matchTopology: Determina se o corpo resultante deve ter a mesma topologia que a superfície da T-Spline resultante.
Returns: Entidade de topologia (sólido ou superfície)
tspline,brep,solid,surface