Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Crie uma superfície ao elevar entre as curvas de seção transversal de entrada.
crossSections: Curvas pelas quais se deve fazer a elevação
Returns: Superfície criada usando a elevação
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Eleve a superfície através das seções transversais com curvas guia especificada (aka corrimãos). As curvas guia devem efetuar a intersecção com todas as curvas da seção transversal.
crossSections: Curvas pelas quais se deve fazer a elevação
guideCurves: Curvas pelas quais guiar a elevação
Returns: Superfície criada usando a elevação
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Crie uma superfície ao efetuar a extrusão por percurso de uma curva da seção transversal ao longo de um caminho.
profile: Curva a ser varrida
path: Curva de caminho usada para varrer
Returns: Superfície criada ao varrer o perfil ao longo do caminho
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crie uma superfície poligonal conectando os pontos de entrada em um polígono fechado e preenchendo o mesmo.
points: Lista de pontos de perímetro
Returns: Superfície criada com base nos pontos de perímetro
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Crie uma superfície ao efetuar a extrusão por percurso da curva do perfil ao redor do raio do eixo formado pelo ponto de origem na direção do vetor do eixo, começando no ângulo inicial em em graus, efetuando a extrusão por percurso do ângulo da extrusão por percurso em graus.
profile: Curva de perfil para revolução
axisOrigin: Origem do eixo de revolução
axisDirection: Direção do eixo de revolução
startAngle: Ângulo inicial em graus
sweepAngle: Ângulo de varredura em graus
Returns: Superfície criada usando o perfil de revolução
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Crie uma superfície ao preencher o interior de um contorno fechado definido por curvas de entrada.
closedCurve: Curva fechada usada como limite da superfície
Returns: Superfície criada por fechamento
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Obtém uma representação Nurbs da superfície em uma tolerância especificada. Este método pode aproximar a superfície em determinadas circunstâncias.
tolerance: Tolerância especificada
Returns: Representação da superfície nurbs da superfície
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Torne mais espessa a superfície em um sólido, efetuando a extrusão na direção de normais de superfície em ambos os lados da superfície.
thickness: Quantidade a ser tornada mais espessa
Returns: Superfície tornada mais espessa como sólido
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Torne mais espessa a superfície em um sólido, efetuando a extrusão na direção de normais de superfície. Se o parâmetro both_sides for verdadeiro, a superfície é tornada mais espessa em ambos os lados.
thickness: Quantidade a ser tornada mais espessa
both_sides: True para espessar em ambos os lados. False para espessar em um lado
Returns: Superfície tornada mais espessa como sólido
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
O sistema de coordenadas retornado usa o EixoX, EixoY e EixoZ para representar o uDir, vDir e normal. O comprimento do EixoX, EixoY representa as curvaturas.
u: Componente U do parâmetro
v: Componente V do parâmetro
Returns: Sistema de coordenadas com base na normal, direção U e direção V na posição UV na superfície

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Retorna uma nova superfície com a normal invertido. Deixa a superfície inalterada.
Returns: Superfície, que é a mesma que a superfície de entrada, mas com normais invertidas