Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Obter a intersecção de duas caixas delimitadoras
other: Outra caixa delimitadora para interseção
Returns: Caixa delimitadora obtida da interseção de caixas delimitadoras

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Determinar se duas caixas delimitadoras efetuam a intersecção
other: Outra caixa delimitadora
Returns: Fazer interseção de caixas delimitadoras
get overlap