Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Crie uma linha tangente à curva de Entrada, posicionada no ponto do parâmetro da curva de entrada.
curve: Curva base da linha tangente
parameter: Valor do parâmetro
Returns: Linha tangente
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Crie uma linha reta começando no ponto inicial, estendendo-se na direção do vetor pelo comprimento especificado.
startPoint: Ponto inicial da linha
direction: Vetor de direção
length: Comprimento da linha
Returns: Linha com base na direção inicial e no comprimento
linebyvector,lines