Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Cria um círculo com o ponto de centro de entrada e raio no plano XY universal, com o Z universal como normal.
centerPoint: Ponto central do círculo
radius: Raio
Returns: Círculo criado com ponto central e raio
circle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
Crie um círculo centralizado na origem do plano de entrada (raiz), que reside no plano de entrada, com o raio especificado.
plane: Raiz do plano usado para centralizar círculo
radius: Raio
Returns: Círculo criado com plano e raio
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Crie um círculo passando através de três pontos de entrada.
p1: 1º ponto do círculo
p2: 2º ponto do círculo
p3: 3º ponto do círculo
circle