Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crie um plano “orientado”, posicionado na origem do ponto com o vetor normal, mas com uma orientação específica do eixo X. Isso não tem impacto para dividir, efetuar a intersecção, no projeto e em operações, isso somente especifica a orientação de CoordinateSystem de entrada.
origin: Ponto de origem do plano
normal: Vetor de direção normal
xAxis: Vetor de direção do eixo X
Returns: Plano usando a normal de origem e o eixo x

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Crie o plano que contém a linha de entrada e o ponto externo. O ponto não pode estar na linha ou no eixo da linha.
line: Linha usada para determinar o plano
point: Ponto usado para determinar o plano
Returns: Plano criado com base na linha e no ponto
lines
0.4