Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Crie um cubóide centralizado no ponto de entrada, com uma largura, comprimento e altura especificados.
origin: Ponto de origem
width: Largura do cuboide
length: Comprimento do cuboide
height: Altura do cuboide
Returns: Cuboide criado usando os comprimentos
box,cube,cubebysize,bycenter,cubes