Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Crie a PolyCurve unindo curvas. Inverte a curva conforme necessário para a conectividade. Escolha uma tolerância de união preferencial entre as unidades 1e-6 e 1e-3.
curves: Curvas a unir na PolyCurve
joinTolerance: Tolerância para determinar o tamanho permitido da lacuna entre curvas a unir
Returns: PolyCurve criada usando curvas unidas
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Crie uma ou mais PolyCurves agrupando curvas conectadas. Escolha uma tolerância de união preferida entre 1e-6 e 1e-3 unidades.
curves: Curvas a agrupar para criar uma ou mais PolyCurves
joinTolerance: Tolerância para determinar o tamanho permitido da lacuna entre curvas a unir

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
O policurva com concordância em seu plano.
radius: Raio de concordância
rightSide: Verdadeiro para fazer a concordância no lado direito em relação ao início da policurva, falso para fazer a concordância no lado esquerdo
Returns: PolyCurve com concordância
round,smooth,radius