Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Forma de um vetor por 3 coordenadas Euclidean
x: Coordenada X
y: Coordenada Y
z: Coordenada Z
Returns: Vetor criado por coordenadas
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Forma de um vetor por 3 coordenadas Euclidean e normalizar o vetor
x: Coordenada X
y: Coordenada Y
z: Coordenada Z
normalized: Verdadeiro para normalizar o vetor, falso para não normalizar
Returns: Vetor criado por coordenadas
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Formar o produto escalar de dois vetores
vec: um segundo vetor
Returns: Produto escalar resultante
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Determine se dois vetores estão paralelos.
otherVector: Outro vetor
Returns: Retornará True se os vetores forem paralelos; caso contrário, retornará False.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Determine se dois vetores são quase iguais. Um valor de tolerância de 1e-5 devido a problemas de previsão no manipulador.
otherVector: Outro vetor
Returns: Retornará True se os vetores forem quase iguais; caso contrário, retornará False.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforma esse vetor pela matriz de entrada do CoordinateSystem
coordinateSystem: Sistema de coordenadas utilizado para transformar o vetor
Returns: Vetor transformado

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Rotaciona um vetor em torno de um eixo por um grau especificado
axis: Vetor do eixo de rotação
degrees: Número de graus para rotacionar
Returns: Vetor rotacionado
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rotaciona um vetor em torno da origem e normal do plano por um grau especificado
plane: Plano de rotação
degrees: Número de graus para rotacionar
Returns: Vetor rotacionado
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Vetor de escala de forma uniforme em torno da origem
scale_factor: Fator de escala
Returns: Vetor dimensionado
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Retorna o ângulo entre os dois vetores de 0 a 360 graus. Usa o eixo de rotação para determinar a direção do ângulo.
otherVector: Outro vetor
rotationAxis: Eixo de rotação
Returns: Retorna o ângulo entre os vetores fornecidos em graus de 0 a 360
rotation angle,