Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Crea un rectángulo centrado en el origen del SCU en el plano XY del SCU con la anchura (longitud del eje X) y longitud (longitud del eje Y) especificadas.
width: Anchura del rectángulo
length: Longitud del rectángulo
Returns: Rectángulo creado por la anchura y la longitud
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Crea un rectángulo centrado en la raíz del plano de entrada, con la anchura (longitud del eje X del plano) y la longitud de entrada (longitud del eje Y del plano).
plane: Plano utilizado para centrar el rectángulo
width: Anchura del rectángulo
length: Longitud del rectángulo
Returns: Rectángulo creado por la anchura y la longitud
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crea un rectángulo centrado en el origen de entrada del plano XY del CoordinateSystem con la anchura (longitud del eje X) y la longitud (longitud del eje Y) especificadas.
coordinateSystem: Sistema de coordenadas del rectángulo (centro del rectángulo)
width: Anchura del rectángulo
length: Longitud del rectángulo
Returns: Rectángulo creado a partir de la anchura y la longitud
rectbylengths