Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Crea un IndexGroup que almacena tres índices.
a: Índice a
b: Índice b
c: Índice c
Returns: IndexGroup
tri,polygon,mesh,meshes