Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea una BSplineCurve mediante puntos de control explícitos. NOTA 1: las BSplineCurve con grado=1 tienen discontinuidades G1, las cuales causan problemas en extrusión, barrido y otras operaciones. Se recomienda evitarlas y utilizar PolyCurve en su lugar. NOTA 2: si la curva es periódica (cerrada), el primer y el último punto DEBEN coincidir.
points: Puntos para curva NURBS
Returns: Curva NURB creada a partir de puntos
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Crea una BSplineCurve mediante puntos de control explícitos. NOTA 1: las BSplineCurve con grado=1 tienen discontinuidades G1, las cuales causan problemas en extrusión, barrido y otras operaciones. Se recomienda evitarlas y utilizar PolyCurve en su lugar. NOTA 2: si la curva es periódica (cerrada), el primer y el último punto DEBEN coincidir.
points: Puntos para curva NURBS
degree: Grado de la curva
Returns: Curva NURB creada a partir de puntos
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Crea una BSplineCurve mediante puntos de control explícitos. NOTA 1: las BSplineCurve con grado=1 tienen discontinuidades G1, las cuales causan problemas en extrusión, barrido y otras operaciones. Se recomienda evitarlas y utilizar PolyCurve en su lugar. NOTA 2: si la curva es periódica (cerrada), el primer y el último punto DEBEN coincidir.
points: Puntos para curva NURBS
degree: Grado de la curva
closeCurve: Activar/desactivar para cerrar la curva
Returns: Curva NURB creada a partir de puntos
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Crea una BSplineCurve mediante la interpolación entre puntos. NOTA 2: si esta curva es periódica (cerrada), el primer y el último punto DEBEN coincidir.
points: Puntos para curva NURBS
closeCurve: Activar/desactivar para cerrar la curva
Returns: Curva NURB creada a partir de puntos
fit,approximate,spline,lines
0.5,0.5,0.5,0.45