Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Crea un cubo centrado en el punto de entrada, con anchura, longitud y altura especificadas.
origin: Punto de origen
width: Anchura del ortoedro
length: Longitud del ortoedro
height: Altura del ortoedro
Returns: Ortoedro creado por longitudes
box,cube,cubebysize,bycenter,cubes