Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Crea una línea tangente a la curva de entrada, que se coloca en el parámetro de punto de la curva de entrada.
curve: Curva base para línea de tangente
parameter: Valor del parámetro
Returns: Línea de tangente
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Crea una línea recta desde el punto inicial y la extiende la longitud especificada en la dirección del vector.
startPoint: Punto inicial de la línea
direction: Vector de dirección
length: Longitud de la línea
Returns: Línea desde la longitud y la dirección iniciales
linebyvector,lines