Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Convierte la superficie de T-Spline en sólido o superficie según la forma.
Nota Podría haber sutiles cambios inesperados en el elemento B-Rep resultante si la superficie de entrada se crea en una versión de T-Spline superior a la versión cargada en Dynamo, ya que, en ese caso, se reducirá la versión de una copia de la superficie para que coincida con la versión de Dynamo y se utilizará esta en la conversión.
matchTopology: Determina si el cuerpo resultante debe tener la misma topología que la superficie de T-Spline de entrada.
Returns: Entidad de topología (sólido o superficie)
tspline,brep,solid,surface