Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Crea una NurbsSurface con los puntos interpolados y los grados U y V especificados. La superficie resultante pasará por todos los puntos.
points: Rejilla de puntos para la superficie NURBS
uDegree: Grado en dirección U
vDegree: Grado en dirección V
Returns: Superficie NURBS creada por puntos
fit,topoints