Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Crea una superficie mediante la solevación entre curvas de sección transversal de entrada.
crossSections: Curvas por las que se debe solevar
Returns: Superficie creada por solevación
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Soleva una superficie a través de las secciones transversales con las curvas guías (o carriles) especificadas. Las curvas guías deben intersecar con todas las curvas de sección transversal.
crossSections: Curvas por las que se debe solevar
guideCurves: Curvas por las que guiar la solevación
Returns: Superficie creada por solevación
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Crea una superficie mediante el barrido de una curva de sección transversal a lo largo de una trayectoria.
profile: Curva que barrer
path: Curva de ruta utilizada para el barrido
Returns: Superficie creada mediante barrido de perfil a lo largo de la trayectoria
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Crea una superficie de polígono conectando los puntos de entrada de un polígono cerrado y aplicando a esta un parche.
points: Lista de puntos del perímetro
Returns: Superficie creada a partir de puntos de perímetro
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Crea una superficie barriendo la curva de perfil alrededor del rayo de eje formado por el punto de origen en la dirección del vector del eje. El ángulo inicial es start_angle y el barrido se realiza en el ángulo de sweep_angle, que se expresan en ambos casos en grados.
profile: Curva de perfil para revolución
axisOrigin: Origen del eje de revolución
axisDirection: Dirección del eje de revolución
startAngle: Ángulo inicial en grados
sweepAngle: Ángulo de barrido en grados
Returns: Superficie creada por perfil de revolución
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Crea una superficie mediante el relleno del interior de un contorno cerrado definido por curvas de entrada.
closedCurve: Curva cerrada utilizada como contorno de superficie
Returns: Superficie creada por parche
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Obtiene una representación NURBS de la superficie dentro de la tolerancia especificada. Este método puede aproximar la superficie en determinadas circunstancias.
tolerance: Tolerancia especificada
Returns: Representación de superficie NURBS de superficie
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Engrosa la superficie hasta convertirla en un sólido y realiza la extrusión en la dirección de las normales de superficie en ambos lados de la superficie.
thickness: Cantidad que se va a engrosar
Returns: Superficie engrosada como sólido
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Engrosa la superficie hasta convertirla en un sólido y realiza la extrusión en la dirección de las normales de superficie. Si el parámetro both_sides es True, la superficie se engrosa en ambos lados.
thickness: Cantidad que se va a engrosar
both_sides: "True" (verdadero) para engrosar en ambos lados. "False" (falso) para engrosar en un lado.
Returns: Superficie engrosada como sólido
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
El sistema de coordenadas devuelto utiliza xAxis, yAxis y zAxis para representar uDir, vDir y la normal. La longitud de xAxis e yAxis representa las curvaturas.
u: Componente U del parámetro
v: Componente V del parámetro
Returns: Sistema de coordenadas basado en la normal y las direcciones U y V en la posición UV de la superficie

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Devuelve una nueva superficie con la normal volteada. No aplica ningún cambio en esta superficie.
Returns: Superficie, que igual a la superficie de entrada, pero con normales volteadas.