Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Genera un vector mediante 3 coordenadas euclidianas.
x: Coordenada X
y: Coordenada Y
z: Coordenada Z
Returns: Vector creado por coordenadas
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Genera un vector mediante 3 coordenadas euclidianas y lo normaliza.
x: Coordenada X
y: Coordenada Y
z: Coordenada Z
normalized: "True" para normalizar el vector y "false" para no normalizarlo.
Returns: Vector creado por coordenadas
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Genera el producto escalar de dos vectores.
vec: un segundo vector
Returns: Producto de punto resultante
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Determina si dos vectores son paralelos.
otherVector: Otro vector
Returns: Devuelve "true" si los vectores son paralelos; de lo contrario, devuelve "false" (falso).

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Determina si dos vectores son prácticamente iguales. Se debe especificar un valor de tolerancia de 1e-5 para solucionar los problemas de precisión.
otherVector: Otro vector
Returns: Devuelve "true" si los vectores son casi iguales; de lo contrario, devuelve "false" (falso).
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transforma el vector según la matriz CoordinateSystem de entrada.
coordinateSystem: Sistema de coordenadas utilizado para transformar el vector
Returns: Vector transformado

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Rota un vector sobre un eje el número de grados especificado.
axis: Vector del eje de rotación
degrees: Número de grados que girar
Returns: Vector girado
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rota un vector sobre la normal y el origen del plano el número de grados especificado.
plane: Plano de rotación
degrees: Número de grados que girar
Returns: Vector girado
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Escala de forma uniforme el vector sobre el origen.
scale_factor: Factor de escala
Returns: Vector con escala ajustada
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Devuelve el ángulo entre los dos vectores en el rango de 0 a 360 grados. Utiliza el eje de rotación para determinar la dirección del ángulo.
otherVector: Otro vector
rotationAxis: Eje de rotación
Returns: Devuelve el ángulo entre los vectores especificados en grados de 0 a 360.
rotation angle,