Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crea un plano "orientado", colocado en el origen del punto con el vector normal, pero con una orientación específica al eje X. Esto no afecta a las operaciones de división, intersección y proyección, entre otras; solo especifica la orientación del CoordinateSystem de entrada.
origin: Punto de origen del plano
normal: Vector de dirección normal
xAxis: Vector de dirección del eje X
Returns: Plano por eje X y normal de origen

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Crea el plano que contiene la línea de entrada de entrada y el punto externo. El punto no puede encontrarse en la línea ni en el eje de la línea.
line: Línea utilizada para determinar el plano
point: Punto utilizado para determinar el plano
Returns: Plano creado a partir de una línea y un punto
lines
0.4