Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Crea una elipse centrada en el punto de entrada alineado con el plano XY del SCU con los radios de ejes X e Y especificados.
origin: Punto de origen de la elipse
xAxisRadius: Radio del eje X
yAxisRadius: Radio del eje Y
Returns: Elipse creada por origen y radios
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Crea una elipse centrada en el punto de entrada, con los dos ejes especificados. Los ejes deben estar a 90 grados el uno del otro.
origin: Punto de origen de la elipse
xAxisRadius: Radio del eje X
yAxisRadius: Radio del eje Y
Returns: Elipse creada a partir de vectores de origen
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Crea una elipse centrada y alineada con el CoordinateSystem de entrada, con un radio x_radius en la dirección X del sistema de coordenadas y un radio y_radius en la dirección Y del sistema de coordenadas.
origin: Sistema de coordenadas de origen de la elipse
xAxisRadius: Radio del eje X
yAxisRadius: Radio del eje Y
Returns: Elipse creada por el sistema de coordenadas y radios
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Crea una elipse centrada y alineada con el plano de entrada, con un radio x_radius en la dirección del eje X del plano y un radio y_radius en la dirección del eje Y del plano.
plane: Plano en el que se dibuja el arco de la elipse
xAxisRadius: Radio del eje X
yAxisRadius: Radio del eje Y
Returns: Elipse creada a partir de un plano y radios
ellipse,aligned ellipse,ellipsebylengths