Autodesk.DesignScript.Geometry.Properties.Resources.OutsideAllowableModelingRange
Busca una cadena localizada similar a Las entradas están fuera del intervalo de modelado permitido; considere la posibilidad de elegir el parámetro {0} con un intervalo de modelado entre {1} y {2} en el cuadro de diálogo "Preferencias => General => Escala de geometría".