Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Crea un arco del punto inicial al punto final con la tangente inicial al vector.
startPoint: Punto inicial del arco
endPoint: Punto final del arco
startTangent: Vector de dirección de tangente inicial
arc,tangent,arcs