Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Crea una sólido de revolución mediante el barrido de la curva de perfil alrededor del rayo de eje formado por el vector de eje y el de origen, a partir del ángulo inicial hasta el ángulo de barrido, ambos expresados en grados.
profile: Curva de perfil para revolución
axisOrigin: Origen del eje de revolución
axisDirection: Dirección del eje de revolución
startAngle: Ángulo inicial en grados
sweepAngle: Ángulo de barrido en grados
Returns: Sólido creado por revolución
Brep,brep,lathe,revolveprofile