Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Crea un círculo con punto central y radio en el plano XY universal, con el plano Z universal como normal.
centerPoint: Punto central del círculo
radius: Radio
Returns: Círculo creado con punto central y radio
circle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
Crea un círculo centrado en el origen de plano de entrada (raíz), que se encuentra, en el plano de entrada, con el radio especificado.
plane: Raíz del plano que se utiliza para centrar el círculo
radius: Radio
Returns: Círculo creado con plano y radio
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Crea un círculo que pasa por tres puntos de entrada.
p1: Primer punto del círculo
p2: Segundo punto del círculo
p3: Tercer punto del círculo
circle