Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Crea una hélice. La hélice siempre gira hacia la derecha sobre la dirección de eje proporcionada. En visualizaciones orientadas en la dirección del eje, el usuario ve que el punto rota hacia la derecha alrededor del eje a medida que se desplaza a lo largo de la curva en la dirección del parámetro de incremento. El paso es la distancia que se mueve la hélice en la dirección del eje en cada giro. Este valor puede ser positivo o negativo.
axisPoint: Punto del eje
axisDirection: Vector de dirección del eje
startPoint: Punto inicial de la hélice
pitch: Distancia de la hélice por cada 360 grados en la dirección del eje
angleTurns: Número de giros en grados
Returns: Hélice creada por eje
helix,screw,corkscrew,thread