Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Cree una o varias PolyCurves mediante la agrupación de curvas conectadas. Elija una tolerancia de unión preferida entre 1e-6 y 1e-3 unidades.
curves: Curvas que se agruparán para crear una o varias PolyCurves
joinTolerance: Tolerancia para determinar el tamaño de hueco permitido entre las curvas que se van a unir.

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Empalma la PolyCurve en su plano.
radius: Radio de empalme
rightSide: "True" (verdadero) para empalmar en el lado derecho relativo al inicio de la PolyCurve, "false" (falso) para empalmar en el lado izquierdo.
Returns: PolyCurve empalmada
round,smooth,radius