Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Obtiene la intersección de dos BoundingBox.
other: Otro cuadro delimitador que intersecar
Returns: Cuadro delimitador obtenido a partir de la intersección de cuadros delimitadores

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Determina si dos BoundingBox intersecan.
other: Otro cuadro delimitador
Returns: Intersección de los cuadros delimitadores
get overlap