DSCore.List.IndexOf(System.Collections.IList,System.Object)
返回给定列表中图元的索引。给定列表和目标图元之间的匹配必须是严格匹配(即 int 对应 int、double 对应 double、string 对应 string、object 对应 object 等)
list: 要在其中查找图元的列表。
element: 要返回索引的图元。
列表中图元的索引。如果未找到严格匹配，将返回无效索引 -1。
index,indexof