Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
获取 TSplineTopology 的字符串表示

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
返回给定索引处的顶点
index: 要用于获取顶点的索引
Returns: T 样条曲线顶点
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
返回给定索引处的边
index: 要用于获取边的索引
Returns: T 样条曲线边
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
返回给定索引处的面
index: 要用于获取面的索引
Returns: T 样条曲线面
tspline,face,byindex