Autodesk.DesignScript.Geometry.Surface.ToString
获取 Surface 的字符串表示

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
将一组曲面合成为一个曲面。如果生成的并集为非流形或多面，则此方法可能会返回一个多重曲面。
surfaces: 一组曲面。
Returns: 曲面并集
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
通过在输入横截面曲线之间放样来创建实体。
crossSections: Curves to loft through
Returns: Surface created by loft
loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
通过在输入横截面直线之间放样来创建实体。这比 Surface。ByLoft 速度稍快，但生成的结果较不平滑。
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
使用一条指定导向曲线(也称为轨线)通过横截面放样曲面。导向曲线必须与所有横截面曲线相交。
loftbyrail

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
使用多条指定导向曲线(也称为轨线)通过横截面放样曲面。各导向曲线必须与所有横截面曲线相交。
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
通过沿路径扫掠横截面曲线创建曲面。
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
创建多边形曲面，连接闭合多边形内的输入点并修补。
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
沿由两条轨线引导的路径扫掠横截面曲线
path: 要沿途扫掠的输入路径。
guideRail: 用于引导扫掠方向的轨道。
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
绕由原点形成的轴向量方向的轴射线扫掠轮廓曲线，从起点角(度)起，扫掠掠角(度)，创建曲面。
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
通过在由输入曲线确定的闭合边界内填充来创建曲面。
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
此曲面的布尔差集和输入曲面的并集。如果生成的布尔为非流形或多面，则此方法可能会返回一个多重曲面。
others: 要减去的其他曲面
Returns: 生成的布尔曲面或多重曲面
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
修剪输入曲面内具有一个或多个环集的曲面。其中一个环需要是输入曲面的边界环。此外，需要为孔添加一个或多个内部环。
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
在曲面上输入点处返回曲面法线。
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
获取曲面的 NURBS 表示。在某些情况该方法可粗略逼近曲面。

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
在指定公差范围内获取曲面的 NURBS 表示。在某些情况该方法可粗略逼近曲面。
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
加厚曲面到实体，朝曲面法线方向在曲面两侧进行拉伸。
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
加厚曲面到实体，朝曲面法线方向拉伸。如果 both_sides (两侧)参数为“True”，则在两侧加厚曲面。
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
在曲面法线方向按指定距离偏移曲面。
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
返回的坐标系统使用 xAxis、yAxis 和 zAxis 表示 uDir、vDir 和法线。xAxis 和 yAxis 长度表示曲率。
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
返回一个与主曲率方向对齐的 CoordinateSystem。
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
返回指定 U 和 V 参数处的 U 切向量。
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
返回指定 U 和 V 参数处的 V 切向量。
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
返回指定 U 和 V 参数处的法向量。
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
返回输入 U 和 V 坐标处的导数。
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
返回 U 和 V 参数处的主方向向量。
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
在给定曲面上创建参数线曲线。创建一条表示曲面上 U 或 V 参数线的曲线。参数线以恒定相反的 U 或 V 参数朝 U 或 V 参数不断增加的方向延伸。所生成的曲线将与曲面参数匹配，其范围将由曲面参数范围限制。返回的曲线类型将取决于曲面类型。
isoDirection: 若方向 == 0，则创建 U 参数线，若方向 == 1，则创建 V 参数线。
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
返回法线翻转的新曲面。保留该曲面不变。
Returns: Surface, which is the same as the input surface but with flipped normals

Autodesk.DesignScript.Geometry.Surface.Join(Autodesk.DesignScript.Geometry.Surface)
将该曲面和输入曲面合并为 PolySurface
topolysurface

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
将该曲面和输入曲面合并为 PolySurface
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
按输入向量方向将输入几何图形投射到该曲面上。!!该投射方法当前仅支持点或曲线!!
projecttosurface,projectonto