Autodesk.DesignScript.Geometry.Properties.Resources.LowerModelerExtentExceeded
查找类似“您的输入位于允许的建模范围之外，请考虑从"设置 => 几何图形工作范围"对话框中选择建模范围介于 {1} 和 {2} 之间的 {0} 设置”的本地化字符串。

Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
查找类似“已超出允许的建模范围，请考虑选择较小值”的本地化字符串。

Autodesk.DesignScript.Geometry.Properties.Resources.UpperModelerExtentExceeded
查找类似“您的输入位于允许的建模范围之外，请考虑从"设置 => 几何图形工作范围"对话框中选择建模范围介于 {1} 和 {2} 之间的 {0} 设置”的本地化字符串。