Autodesk.DesignScript.Geometry.Curve.ToString
获取 Curve 的字符串表示

Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
通过 UV 空间中曲面的线创建曲线
baseSurface: 要使用的曲面
startParams: 曲线将开始的起点 uv
endParams: 曲线将结束的终点 UV
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
创建混合了两条曲线的曲线
curve1: 要混合的第一条曲线
curve2: 要混合的第二条曲线
endOrStart1: 标志，用于指示要混合的曲线 1 的终点
endOrStart2: 标志，用于指示要混合的曲线 1 的终点
isG2Continuous: 标志，用于指示生成的曲线是 G1 连续还是 G2 连续
Returns: 通过混合两条曲线生成的曲线
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
通过曲面等值线创建曲线
baseSurface: 基础曲面
direction: 若为 0，则等值线将沿 U 方向，若为 1，则沿 V 方向
parameter: 固定用于其他曲面参数的曲线值
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
获取以给定参数处的点为原点的 CoordinateSystem。XAxis 与曲线法线对齐，YAxis 与该点处的曲线切线对齐，而 ZAxis 与该点处的向上向量或次发现对齐
param: 要计算的位置的参数
Returns: 曲线参数处的坐标系
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
返回一个平面，其法线与曲线切线对齐。调整参数以使 0 始终为起点和 1 始终为终点。
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtDistance(System.Double)
沿曲线获取特定弧长处的点
segmentLength: 沿曲线要计算的距离
Returns: 给定弧长处的点
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
返回基于输入的分段数沿曲线长度均匀分布的点
divisions: 分割数
Returns: 沿曲线长度均匀分布的点

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
返回基于输入的分段数沿曲线以相等弧长分布的点
divisions: 分割数
Returns: 曲线上点的列表

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
返回从给定点开始以给定线段长度沿曲线均匀分布的点
point: 参照点(测量起点)
segmentLength: 沿曲线要计算的距离
Returns: 曲线上点的列表

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
返回从给定点开始以给定线段长度沿曲线均匀分布的点
point: 参照点(测量起点)
chordLength: 弦长
Returns: 曲线上点的列表

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
返回与曲线起点相距指定距离的 CoordinateSystem。Y 轴与曲线相切，X 轴为曲率。
segmentLength: 沿曲线要计算的距离
Returns: 曲线上的 CoordinateSystem
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtDistance(System.Double)
返回与曲线起点相距指定距离的 CoordinateSystem。Y 轴与曲线相切，X 轴为曲率。
segmentLength: 沿曲线要计算的距离
Returns: 曲线上的 CoordinateSystem
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
返回沿曲线距起点指定距离的平面。平面法线与曲线切线对齐。
segmentLength: 沿曲线要计算的距离
Returns: 曲线上的面
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PlaneAtDistance(System.Double)
返回沿曲线距起点指定距离的平面。平面法线与曲线切线对齐。
segmentLength: 沿曲线要计算的距离
Returns: 曲线上的面
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
获取从曲线起点到给定参数测得的线段长度。
param: 值介于 0 到 1 之间
Returns: 线段长度
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtDistance(System.Double)
沿曲线获取特定弧长处的参数。
segmentLength: 沿曲线要计算的距离
Returns: 参数
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.LengthBetweenParameters(System.Double,System.Double)
获取曲线上两个参数点之间的圆弧长度
startParam: 域的起点
endParam: 域的终点
Returns: 两个参数之间的圆弧长度
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
获取曲线上给定点处的参数。如果点不在曲线上，则获取最接近的参数。如果输入曲线是复合线，则仅当点位于复合线上时，此函数才会返回有效参数。对于其他曲线类型，此函数将返回曲线上距输入点最近点处的参数。
point: 曲线上或曲线附近的点
Returns: 对于复合线，曲线上的参数；对于其他曲线类型，沿曲线的最近参数。
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.DivideEqually(System.Int32)
将曲线分割为给定数量的长度相等的曲线
divisions: 分割数
Returns: 分割后的一组曲线
chopcurve,segment,slices

Autodesk.DesignScript.Geometry.Curve.DivideByDistance(System.Int32)
将曲线分割为给定数量的曲线，每条曲线起点和终点之间距离相等(弦相等)。
divisions: 分割数
Returns: 分割后的一组曲线
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByLengthFromParameter(System.Double,System.Double)
将曲线分割为给定长度(从给定参数位置测量)的曲线
length: 分割后的曲线长度
parameter: 用于测量的参数位置的起点
Returns: 分割后的曲线数组
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByDistanceFromParameter(System.Double,System.Double)
将曲线分割为给定长度(从给定参数位置测量)的曲线
distance: 每条曲线从分割获得的弦长
parameter: 用于测量的参数位置的起点
Returns: 分割后的一组曲线
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimStart(System.Double)
删除指定参数处曲线的起点
startParameter: 修剪起点的参数
Returns: 起点删除后的新曲线
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimEnd(System.Double)
删除指定参数处曲线的终点
endParameter: 修剪起点的参数
Returns: 终点删除后的新曲线
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrim(System.Double,System.Double)
删除指定参数处曲线的起点和终点
startParameter: 修剪起点的参数
endParameter: 修剪起点的参数
Returns: 外部线段删除后的新曲线
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.ParameterTrimInterior(System.Double,System.Double)
删除指定参数处曲线的内部部分
startParameter: 修剪起点的参数
endParameter: 修剪起点的参数
Returns: 内部线段删除后的新曲线
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimSegments(System.Double[])
删除曲线的多个分段，放弃第 1、第 3、第 5... 段
parameters: 分割曲线的各位置的参数的列表
Returns: 丢弃第 1、3、5...段后的一组曲线
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
删除曲线的多个分段，如果布尔值为“True”，则放弃第 2、第 4、第 6... 段
parameters: 分割曲线的各位置的参数的列表
discardEvenSegments: 切换为放弃偶数段
Returns: 若布尔为 True，则为丢弃第 2、4、6... 段后的一组曲线
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double)
在给定参数处将曲线分割为两个线段
parameter: 执行分割的位置的参数
Returns: 分割后剩余的两条曲线
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double)
在给定参数处将曲线分割为两个线段
parameter: 执行分割的位置的参数
Returns: 分割后剩余的两条曲线
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double[])
在给定参数处将曲线分割为多个线段
parameters: 分割曲线的各位置的参数的列表
Returns: 由分割创建的曲线
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
将曲线集连接至复合线终点。翻转曲线以确保连接。
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany

Autodesk.DesignScript.Geometry.Curve.Join(Autodesk.DesignScript.Geometry.Curve)
将该曲线和输入曲线连接到新的 PolyCurve，同时正确地保持原始曲线。
curve: 要连接的曲线
Returns: 由这两条曲线组成的复合线
convertcurve,curve2polycurve,joincurve,concat

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
在由拾取点确定的特定终点按给定距离延伸曲线。拾取侧将被延伸。圆和椭圆等闭合曲线无法延伸。
distance: 延伸距离
pickSide: 要延伸端的点
Returns: 延伸的曲线
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
在曲线起点侧按给定距离延伸曲线。圆和椭圆等闭合曲线不能延伸。
distance: 延伸距离
Returns: 延伸的曲线
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
在曲线终点按给定距离延伸曲线。圆和椭圆等闭合曲线不能延伸。
distance: 延伸距离
Returns: 延伸的曲线
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Patch
修补闭合曲线
Returns: 曲线 Curve 内部的 Surface
fill,profiletosurf,loop,loop2surf,edgesurf

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
沿给定投影方向将输入曲线投影到指定的基础几何图形上。要投影到已投影到基础几何图形的几何图形的向量列表的几何图形