Autodesk.DesignScript.Geometry.Cuboid.ToString
获取 Cuboid 的字符串表示

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(System.Double,System.Double,System.Double)
以 WCS 原点为中心使用宽度、长度和高度创建立方体。
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
以输入点为中心使用特定宽度、长度和高度创建立方体。
origin: Origin point
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
以 WCS 原点为中心使用宽度、长度和高度创建长方体。
coordinateSystem: 父坐标系(长方体中心)
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created from lengths
box,cube,cubebysize,bycoord,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
通过从低点到高点延伸创建立方体。
lowPoint: Corner low point of cuboid
highPoint: Corner high point of cuboid
Returns: Cuboind created by corners
box,cube,byminmax,by corners,by points,cubes

Autodesk.DesignScript.Geometry.Cuboid.Length
返回长度距离。                       注意: 这样将返回立方体的输入维数，而不是实际世界空间维数。换言之，如果创建宽度 (X 轴)为 10 的长方体，并将其变换到 X 轴缩放 2 倍的坐标系，宽度将仍为 10。ASM 不允许以任何可预测阶数提取实体的顶点，因该无法确定变换之后的维数。

Autodesk.DesignScript.Geometry.Cuboid.Width
返回宽度距离。                       注意: 这样将返回立方体的输入维数，而不是实际世界空间维数。换言之，如果创建宽度 (X 轴)为 10 的长方体，并将其变换到 X 轴缩放 2 倍的坐标系，宽度将仍为 10。ASM 不允许以任何可预测阶数提取实体的顶点，因该无法确定变换之后的维数。

Autodesk.DesignScript.Geometry.Cuboid.Height
返回高度距离。                       注意: 这样将返回立方体的输入维数，而不是实际世界空间维数。换言之，如果创建宽度 (X 轴)为 10 的长方体，并将其变换到 X 轴缩放 2 倍的坐标系，宽度将仍为 10。ASM 不允许以任何可预测阶数提取实体的顶点，因该无法确定变换之后的维数。