Autodesk.DesignScript.Geometry.Plane.ToString
获取 Plane 的字符串表示

Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
以原点为中心通过输入法向量创建平面。
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
创建“定向”平面，定位于原点及向量法线，但使用特定 X 轴方向。这不会影响拆分、相交和投影等操作，它仅指定输入坐标系的方向。
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
X 和 Y 轴位于此平面内。Z 轴为两个向量的矢积。
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
将平面与输入点拟合；基本是三维散点图拟合。
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
创建包含输入线和外部点的平面，点不能位于此输入线或输入线轴线上。
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
在世界坐标 XY 平面创建平面
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
在世界坐标 XZ 平面创建平面
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
在世界坐标 YZ 平面创建平面
Returns: Plane at YZ plane of world

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
生成表示该平面的新 CoordinateSystem。它基于原点以及 X 和 Y 轴基准。
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
通过在法线方向按指定距离偏移该平面来创建新平面。
alongnormal,moveplane