Autodesk.DesignScript.Geometry.IndexGroup.ToString
获取 IndexGroup 的字符串表示

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
比较两个 IndexGroup 的字符串表示
other: 其他 IndexGroup
Returns: 两个对象是否相等

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
获取此类型的哈希代码
Returns: 此对象的唯一哈希代码

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
创建存储四个索引的 IndexGroup
a: Index a
b: Index b
c: Index c
d: Index d
Returns: IndexGroup
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
创建存储三个索引的 IndexGroup
a: Index a
b: Index b
c: Index c
Returns: IndexGroup
tri,polygon,mesh,meshes