Autodesk.DesignScript.Geometry.Rectangle.ToString
获取 Rectangle 的字符串表示

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
通过四个角点创建矩形。
points: List of corner points of rectangle
Returns: Rectangle created by corner points
rectbypointarray

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
通过四个角点创建矩形。
p1: 1st corner point of rectangle
p2: 2nd corner point of rectangle
p3: 3rd corner point of rectangle
p4: 4th corner point of rectangle
Returns: Rectangle created by corner points
rectbypoints

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
在 WCS 的 XY 平面上以 WCS 原点为中心按指定宽度 (X 轴长度)和长度 (Y 轴长度)创建矩形。
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
以输入平面原点为中心按输入宽度(平面 X 轴长度)和长度(平面 Y 轴长度)创建矩形。
plane: Plane used to center rectangle
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
以 CoordinateSystem XY 平面上的输入原点为中心按指定宽度 (X 轴长度)和长度 (Y 轴长度)创建矩形。
coordinateSystem: 矩形的坐标系(矩形中心)
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created from width and length
rectbylengths