Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
获取 TSplineSurface 的字符串表示

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
创建“定向”T 样条曲线平面，定位于原点及向量法线，但使用特定 X 轴方向。
这不会影响拆分、相交和投影等操作，它仅指定输入坐标系的方向。
origin: 平面的根点
normal: 平面的法线
xAxis: 平面的 X 轴
minCorner: 平面坐标中最小角的二维点
maxCorner: 平面坐标中最大角的二维点
xSpans: 宽度方向的跨距数
ySpans: 长度方向的跨距数
symmetry: T 样条曲线曲面的对称选项
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: 平面 T 样条曲线曲面
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
通过原点、X 轴和 Y 轴创建平面。
Z 轴为两个向量的矢积。
origin: 平面的根点
xAxis: 平面的 X 轴
yAxis: 平面的 Y 轴
minCorner: 平面坐标中最小角的二维点
maxCorner: 平面坐标中最大角的二维点
xSpans: 宽度方向的跨距数
ySpans: 长度方向的跨距数
symmetry: T 样条曲线曲面的对称选项
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: 平面 T 样条曲线曲面
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
以坐标系原点为基准点创建 T 样条曲线圆锥体，在坐标系的 Z 轴方向上延伸，
圆形底部于在坐标系 XY 平面内。
cs: 圆锥体中心和底部将位于该坐标系的 X-Y 平面
height: 圆锥体高度
radius: 圆锥体半径
radiusSpans: 周长方向跨距数
heightSpans: 高度方向跨距数
symmetry: T 样条曲线曲面的对称选项
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: 锥形 T 样条曲线曲面
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
以 CoordinateSystem 原点为基准点创建 T 样条曲线圆锥体，在 CoordinateSystem Z 轴方向延伸，
其圆形底部在 CoordinateSystem XY 平面内。
cs: 圆锥体中心和底部将位于该坐标系的 X-Y 平面
height: 圆锥体高度
startRadius: 圆锥体起点半径
endRadius: 圆锥体终点半径
radiusSpans: 周长方向跨距数
heightSpans: 高度方向跨距数
symmetry: T 样条曲线曲面的对称选项
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: 锥形 T 样条曲线曲面
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
创建包含曲面上四个输入点的 T 样条曲线球体。
points: 列表中用于创建球体的四个点。点不共面
radiusSpans: 径向跨距数
heightSpans: 高度方向跨距数
symmetry: T 样条曲线曲面的对称选项
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: 球形 T 样条曲线曲面
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
以输入点为中心使用指定宽度、长度和高度创建 T 样条曲线长方体。
origin: 长方体中心
width: 长方体宽度
length: 长方体长度
height: 长方体高度
xSpans: 宽度方向的跨距数
ySpans: 长度方向的跨距数
zSpans: 高度方向的跨距数
symmetry: T 样条曲线曲面的对称选项
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: T 样条曲线长方体
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
以输入 CoordinateSystem 为中心和导向使用特定宽度、长度和高度创建立方体。
cs: 长方体的 X-Y 平面将与相应 X 轴对齐
width: 长方体宽度
length: 长方体长度
height: 长方体高度
xSpans: 宽度方向的跨距数
ySpans: 长度方向的跨距数
zSpans: 高度方向的跨距数
symmetry: T 样条曲线曲面的对称选项
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: T 样条曲线长方体
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
通过从低点到高点延伸创建立方体。
lowPoint: 第一个角点
highPoint: 第二个角点
xSpans: 宽度方向的跨距数
ySpans: 长度方向的跨距数
zSpans: 高度方向的跨距数
symmetry: T 样条曲线曲面的对称选项
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: T 样条曲线长方体
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
以 CoordinateSystem 原点为球心使用给定半径创建 T 样条曲线四分球
cs: 局部坐标系
radius: 四分球半径
spans: 四分球各边两个维度的跨距数
symmetry: T 样条曲线曲面的对称选项
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: T 样条曲线四分球
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
以给定圆心和半径创建 T 样条曲线四分球，并使其与默认世界 XY 平面对齐
center: 四分球中心点
radius: 四分球半径
spans: 四分球各边两个维度的跨距数
symmetry: T 样条曲线曲面的对称选项
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: T 样条曲线四分球
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
使用均匀策略由 NURBS 曲面构造 T 样条曲线曲面。
输入 NURBS 曲面将通过相同参数化或圆弧长度间隔
放置的均匀节点重新构建，具体取决于相应 useArcLen 标志，
并通过 3 阶 NURBS 曲面逼近。输出 T 样条曲线被 U 方向和 V 方向给定的
跨距数分割。
nurbsSurface: 输入 NURBS 曲面
uSpans: U 方向所需的跨距数
vSpans: V 方向所需的跨距数
uUseArcLen: 在 U 参数化方向是使用圆弧长度还是参数化细分
vUseArcLen: 在 V 参数化方向是使用圆弧长度还是参数化细分
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
使用曲率细分策略由 NURBS 曲面构造 T 样条曲线曲面。
输入 NURBS 曲面将重新构建为 3 阶。输出 T 样条曲线在自动检测到的每个方向都有跨度数和
位置，具体取决于曲率。
nurbsSurface: 输入 NURBS 曲面
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByExtrude(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
通过沿给定向量拉伸曲面来创建 T 样条曲线。
curve: 轮廓曲线
direction: 拉伸向量
frontDistance: 按向量方向拉伸距离
backDistance: 针对向量方向拉伸距离
frontSpans: 通过向量方向跨越数量。如果传递了 0，则不会执行通过向量方向拉伸
backSpans: 针对向量方向跨越数量。如果传递了 0，则不会执行针对向量方向的拉伸
profileSpans: 在轮廓方向跨越数量。如果为 0 或更少，则自动定义
uniform: 为沿轮廓方向的跨越分布使用统一或曲率策略
inSmoothMode: 以方框或平滑可视化显示 T 样条曲线曲面
tspline,extrude,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
通过沿路径扫掠横截面曲线构造 T 样条曲线。
profile: 轮廓曲线
path: 路径曲线
parallel: 跨距是否应与路径方向平行
pathSpans: 路径方向跨距数
profileSpans: 轮廓方向跨距数。若为 0 个或更少则自动定义
pathUniform: 将统一或曲率策略用于沿路径的跨距分布
profileUniform: 将统一或曲率策略用于沿轮廓的跨距分布
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
绕由轴原点和轴方向形成的轴向量掠轮廓曲线，从起点角(度)起，扫掠掠角(度)，从而创建 T 样条曲线曲面。
profile: 轮廓曲线
axisOrigin: 旋转中心
axisDirection: 旋转轴
startAngle: 旋转开始角度
sweepAngle: 旋转完成角度
radialSpans: 半径方向跨距数
axialSpans: 高度方向跨距数。若为 0 个或更少则自动定义
uniform: 将统一或曲率策略用于跨距分布
symmetry: T 样条曲线曲面的对称选项
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
由曲线或线网络生成管道曲面。
在每个曲线交点处创建平滑连接。
有些参数获取单一值或列表 - 每条曲线两个值。
curves: 曲线列表，所用来创建的管道来自
defaultRadius: 已创建管道的默认半径
snappingTolerance: 用于检测曲线交点的公差
segmentsCount: 每根管道的分段数。单一值或列表，允许是曲线数的两倍
endRotations: 每根管道的端部旋转值(度)。单一值或列表，允许是曲线数的两倍
endRadii: 每根管道的端部半径值(度)。单一值或列表，允许是曲线数的两倍
endPercentage: 从每条输入曲线的终点到管网起点的值(0 到 1)。单一值或列表，允许是曲线数的两倍
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
由曲线或线网络生成管道曲面。
在每个曲线交点处创建平滑连接。
有些参数获取单一值或列表 - 每条曲线一个值。
curves: 曲线列表，所用来创建的管道来自
defaultRadius: 已创建管道的默认半径
snappingTolerance: 用于检测曲线交点的公差
segmentsCount: 每条曲线的分段数。此列表的大小可以是曲线数或 1 (表示复制)或 0 (表示自动确定)。
autoHandleStart: 如果为 True，则会自动生成每条曲线起点处控制柄的参数，并忽略 rotationsAtStart、radiiAtStart 和 positionsAtStart 的自定义参数。
autoHandleEnd: 如果为 True，则会自动生成每条曲线终点处控制柄的参数，并忽略 rotationsAtEnd、radiiAtEnd 和 positionsAtEnd 的自定义参数。
startRotations: 每条曲线起点处每个管道控制柄的自定义旋转角度(以度为单位)。当 autoHandleStart 为 True 时，将忽略此参数。列表的大小可以是曲线数或 1 (表示复制)。
endRotations: 每条曲线终点处每个管道控制柄的自定义旋转角度(以度为单位)。当 autoHandleEnd 为 True 时，将忽略此参数。列表的大小可以是曲线数或 1 (表示复制)。
startRadii: 每条曲线起点处每个管道控制柄的自定义半径。当 autoHandleStart 为 True 时，将忽略此参数。列表的大小可以是曲线数或 1 (表示复制)。
endRadii: 每条曲线终点处每个管道控制柄的自定义半径。当 autoHandleEnd 为 True 时，将忽略此参数。列表的大小可以是曲线数或 1 (表示复制)。
startPositions: 每条曲线起点处每个管道控制柄的自定义位置(以 0 和 1 之间的百分比表示，沿曲线的弧长)。当 autoHandleStart 为 True 时，将忽略此参数。列表的大小可以是曲线数或 1 (表示复制)。每条曲线上的起点和终点位置不应相互重叠。理想情况下，起点位置应接近 0，而终点位置接近 1。
endPositions: 每条曲线终点处每个管道控制柄的自定义位置(以 0 和 1 之间的百分比表示，沿曲线的弧长)。当 autoHandleEnd 为 True 时，将忽略此参数。列表的大小可以是曲线数或 1 (表示复制)。每条曲线上的起点和终点位置不应相互重叠。理想情况下，起点位置应接近 0，而终点位置接近 1。
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
将给定的多个 T 样条曲线曲面组合为一个。
曲面可以不相互连接。
如果至少有一个曲面处于方框模式 - 则输出曲面也将处于方框模式。
tSplineSurfaces: 要组合的 T 样条曲线曲面
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
以方框还是平滑模式显示 T 样条曲线
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
T 样条曲线是否处于打开状态。
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
将 T 样条曲线曲面转换为实体或曲面，具体取决于形状
matchTopology: 确定生成的主体是否具有与 T 样条曲线相同的拓扑
Returns: 拓扑实体(实体或曲面)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
将 T 样条曲线曲面转换为网格。网格可以有三角形和四边形。
minSegments: 每个方向的最小段数。始终会生成至少一个线段。
tolerance: 从网格到曲面允许的最大距离。设置为零或负值将禁用该距离
Returns: 网格实体
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
将给定顶点列表焊接为一个顶点。
vertices: 要焊接的顶点
newPosition: 生成的顶点夹点的位置。若传递 NULL，则使用各夹点平均位置。
keepSubdCreases: 保留输入拓扑的细分折痕
Returns: 顶点已焊接的 T 样条曲线曲面
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
创建与 T 样条曲线和曲线闭合环的匹配
tsEdges: 要创建匹配的 T 样条曲线边闭合环
curves: 要创建匹配的曲线闭合环
continuity: 要尝试匹配的几何连续性：G0、G1、G2
useArclength: 构建匹配时是否要使用 arcLength 对齐
useRefinement: 若为 True，则会将额外控制点添加到 T 样条曲线以在给定公差范围内匹配曲面。
numRefinementSteps: 最大优化步数。若 useRefinement 设置为 False，则忽略
refinementTolerance: 要达到的公差。若 useRefinement 设置为 False，则忽略
usePropagation: 构建匹配时是否要使用传播
widthOfPropagation: 确定有多少曲面受此匹配影响。若 usePropagation 设置为 False，则忽略
tangentScale: 切线比例。若连续性未设置为 G1，则忽略
curvParamWeight: 曲率参数权重。若连续性未设置为 G2，则忽略
flipSourceTargetAlignment: 是否要反转路线方向
Returns: 位于给定 T 样条曲线边界边和曲线环之间的 T 样条曲线曲面
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
创建与 T 样条曲线和 BRep 边闭合环的匹配。首先，
边环将被转换为曲线环，然后执行匹配
tsEdges: 要创建匹配的 T 样条曲线边闭合环
brepEdges: 要创建匹配的 BRep 边闭合环
continuity: 要尝试匹配的几何连续性：G0、G1、G2
useArclength: 构建匹配时是否要使用 arcLength 对齐
useRefinement: 若为 True，则会将额外控制点添加到 T 样条曲线以在给定公差范围内匹配曲面。
numRefinementSteps: 最大优化步数。若 useRefinement 设置为 False，则忽略
refinementTolerance: 要达到的公差。若 useRefinement 设置为 False，则忽略
usePropagation: 构建匹配时是否要使用传播
widthOfPropagation: 确定有多少曲面受此匹配影响。若 usePropagation 设置为 False，则忽略
tangentScale: 切线比例。若连续性未设置为 G1，则忽略
curvParamWeight: 曲率参数权重。若连续性未设置为 G2，则忽略
flipSourceTargetAlignment: 是否要反转路线方向
Returns: 位于给定 T 样条曲线边界边和 BRep 边环之间的 T 样条曲线曲面
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
更改 T 样条曲线的可视化样式。
若通过 True 则采用平滑可视化，否则为方框可视化。
enable: 启用或禁用平滑可视化
Returns: 可视化样式已选定的 T 样条曲线
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
在两个面集之间构建桥接。第一组的项目
将被视为该曲面的子对象。第二组的项目
可以是该曲面的子对象也可以属于
不同曲面。每组中的拓扑可能不会相邻，
但应创建不同回路的相同计数。
firstGroup: 要桥接的第一组面
secondGroup: 要桥接的第二组面
followCurves: 每个不同拓扑回路的
桥接曲线(若传递空列表则使用直线；若传递一条曲线，
则在检测到多个输入回路时复制曲线)
frameRotations: 沿每个不同拓扑回路的桥接曲线，
绕框架法线的完整旋转数
(若传递空列表则使用 0；若传递一个值，
则在检测到多个输入回路时复制该值)
spansCounts: 沿每个不同拓扑回路的桥接的分段数
。每组的跨距计数应
大于相应数量的旋转(若传递空列表则使用 1，
若传递一个值，则在检测到多个输入回路时
复制该值)
cleanBorderBridges: 删除边界边之间的桥接。
keepSubdCreases: 保留输入拓扑的
细分折痕
firstAlignVertices: 第一组的每个不同拓扑回路的
定向顶点列表(顶点数量应
检测到的输入回路相同或列表可能为空)
secondAlignVertices: 从第二组起每个不同拓扑回路的
定向顶点列表(顶点数量应
检测到的输入回路相同或列表可能为空)
flipAlignmentFlags: 标志列表指示
是否为相应拓扑回路反转桥接路线。
(若传递空列表则设定 False；若传递一个值，
则为检测到的每个输入回路复制该值)
Returns: 采用拓扑的 T 样条曲线曲面，桥接连接
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
在面集和边集之间构建桥接。第一组的项目
将被视为该曲面的子对象。第二组的项目
可以是该曲面的子对象也可以属于
不同曲面。每组中的拓扑可能不会相邻，
但应创建不同回路的相同计数。
firstGroup: 要桥接的第一组面
secondGroup: 要桥接的第二组边
followCurves: 每个不同拓扑回路的
桥接曲线(若传递空列表则使用直线；若传递一条曲线，
则在检测到多个输入回路时复制曲线)
frameRotations: 沿每个不同拓扑回路的桥接曲线，
绕框架法线的完整旋转数
(若传递空列表则使用 0；若传递一个值，
则在检测到多个输入回路时复制该值)
spansCounts: 沿每个不同拓扑回路的桥接的分段数
。每组的跨距计数应
大于相应数量的旋转(若传递空列表则使用 1，
若传递一个值，则在检测到多个输入回路时
复制该值)
cleanBorderBridges: 删除边界边之间的桥接。
keepSubdCreases: 保留输入拓扑的
细分折痕
firstAlignVertices: 第一组的每个不同拓扑回路的
定向顶点列表(顶点数量应
检测到的输入回路相同或列表可能为空)
secondAlignVertices: 从第二组起每个不同拓扑回路的
定向顶点列表(顶点数量应
检测到的输入回路相同或列表可能为空)
flipAlignmentFlags: 标志列表指示
是否为相应拓扑回路反转桥接路线。
(若传递空列表则设定 False；若传递一个值，
则为检测到的每个输入回路复制该值)
Returns: 采用拓扑的 T 样条曲线曲面，桥接连接
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
在边集和面集之间构建桥接。第一组的项目
将被视为该曲面的子对象。第二组的项目
可以是该曲面的子对象也可以属于
不同曲面。每组中的拓扑可能不会相邻，
但应创建不同回路的相同计数。
firstGroup: 要桥接的第一组边
secondGroup: 要桥接的第二组面
followCurves: 每个不同拓扑回路的
桥接曲线(若传递空列表则使用直线；若传递一条曲线，
则在检测到多个输入回路时复制曲线)
frameRotations: 沿每个不同拓扑回路的桥接曲线，
绕框架法线的完整旋转数
(若传递空列表则使用 0；若传递一个值，
则在检测到多个输入回路时复制该值)
spansCounts: 沿每个不同拓扑回路的桥接的分段数
。每组的跨距计数应
大于相应数量的旋转(若传递空列表则使用 1，
若传递一个值，则在检测到多个输入回路时
复制该值)
cleanBorderBridges: 删除边界边之间的桥接。
keepSubdCreases: 保留输入拓扑的
细分折痕
firstAlignVertices: 第一组的每个不同拓扑回路的
定向顶点列表(顶点数量应
检测到的输入回路相同或列表可能为空)
secondAlignVertices: 从第二组起每个不同拓扑回路的
定向顶点列表(顶点数量应
检测到的输入回路相同或列表可能为空)
flipAlignmentFlags: 标志列表指示
是否为相应拓扑回路反转桥接路线。
(若传递空列表则设定 False；若传递一个值，
则为检测到的每个输入回路复制该值)
Returns: 采用拓扑的 T 样条曲线曲面，桥接连接
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
在两个边集之间构建桥接。第一组的项目
将被视为该曲面的子对象。第二组的项目
可以是该曲面的子对象也可以属于
不同曲面。每组中的拓扑可能不会相邻，
但应创建不同回路的相同计数。
firstGroup: 要桥接的第一组边
secondGroup: 要桥接的第二组边
followCurves: 每个不同拓扑回路的
桥接曲线(若传递空列表则使用直线；若传递一条曲线，
则在检测到多个输入回路时复制曲线)
frameRotations: 沿每个不同拓扑回路的桥接曲线，
绕框架法线的完整旋转数
(若传递空列表则使用 0；若传递一个值，
则在检测到多个输入回路时复制该值)
spansCounts: 沿每个不同拓扑回路的桥接的分段数
。每组的跨距计数应
大于相应数量的旋转(若传递空列表则使用 1，
若传递一个值，则在检测到多个输入回路时
复制该值)
cleanBorderBridges: 删除边界边之间的桥接。
keepSubdCreases: 保留输入拓扑的
细分折痕
firstAlignVertices: 第一组的每个不同拓扑回路的
定向顶点列表(顶点数量应
检测到的输入回路相同或列表可能为空)
secondAlignVertices: 从第二组起每个不同拓扑回路的
定向顶点列表(顶点数量应
检测到的输入回路相同或列表可能为空)
flipAlignmentFlags: 标志列表指示
是否为相应拓扑回路反转桥接路线。
(若传递空列表则设定 False；若传递一个值，
则为检测到的每个输入回路复制该值)
Returns: 采用拓扑的 T 样条曲线曲面，桥接连接
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
填充 T 样条曲线中的孔
edges: 带内孔的边集。各边必须为边界。
fillMethod: 孔的填充方法：0 - 细分、1 - n 边形，2 - 收拢，3 - 折叠和焊接
keepSubdCreases: 保留输入拓扑的细分折痕
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
压缩曲面上的所有拓扑并使索引连续。此功能将保持索引的相对顺序。
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
前向插值将控制点移动到曲面上其参数化位置。反转插值为每个原始控制点在曲面上生成一个点，然后将该控制点移动到其相应的曲面点。
reverse: 插值方向: 若为 False 则向前，否则就反转
Returns: 以给定方向插入的 T 样条曲线
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
将选定面复制到新曲面。新曲面不对称
faces: 要复制的面
Returns: 仅包含选定面的 T 样条曲线曲面
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
沿给定向量移动给定顶点
vertices: 要移动的顶点列表
vector: 移动方向
onSurface: 标志，指示使用曲面还是顶点控制点

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
以 T 样条曲线网格格式将 T 样条曲线全面写入字符串。
tSplineSurface: 要序列化的 T 样条曲线曲面
Returns: T 样条曲线曲面进行序列化时所在的字符串
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
从 T 样条曲线网格格式的字符串创建 T 样条曲线曲面。
content: T 样条曲线网格文件的字符串表示
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: 新载入列表中的 T 样条曲线曲面
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
从给定 T 样条曲线网格文件加载 T 样条曲线曲面
filePath: 用于加载的文件的路径
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: 新载入列表中的 T 样条曲线曲面
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
从给定 T 样条曲线场景文件加载 T 样条曲线曲面集
filePath: 用于加载的文件的路径
inSmoothMode: 以方框还是平滑可视化显示 T 样条曲线曲面
Returns: 一组新载入的 T 样条曲线曲面
tspline,import,load,tss,path