Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
获取 TSplineReflection 的字符串表示

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
使用给定线段数和每对线段之间的给定角度(度)通过给定平面创建 T 样条曲线对称的径向反射。
plane: 法线为 T 样条曲线径向反射的轴的平面。在世界坐标中给定
segmentsCount: 径向反射的分段数
segmentAngle: 径向对称的每对线段之间的角度(度)。若将其设置为 0，则该角度由 (360 / segmentsCount) 确定
Returns: T 样条曲线径向反射
tspline,symmetry,reflection,radial