Autodesk.DesignScript.Geometry.BoundingBox.ToString
获取 BoundingBox 的字符串表示

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
比较两个 BoundingBox 的字符串表示
other: 其他 BoundingBox
Returns: 两个对象是否相等

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
获取此类型的哈希代码
Returns: 此对象的唯一哈希代码

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
围绕输入几何图形创建与轴对齐的 BoundingBox。
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
围绕多个输入几何图形创建与轴对齐的 BoundingBox。
geom: Geometries to determine bounding box
Returns: Bounding box enclosing geometries
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
通过 CoordinateSystem X、Y 和 Z 轴定向，围绕输入几何图形创建不与轴对齐的 BoundingBox。
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
通过 CoordinateSystem X、Y 和 Z 轴定向，围绕多个输入几何图形创建不与轴对齐的 BoundingBox。
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
从最小坐标(框后部左下角)到最大坐标(框前部右上角)构造 BoundingBox。坐标系是从框坐标空间到模型空间的变换坐标系。该方法旨在与 Revit 的 API 匹配，从而能够从 Revit BoundingBox 提取参数而不用进行任何转换。
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
用于确定该 BoundingBox 的 CoordinateSystem

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
获取两个 BoundingBox 的交点
other: Other bounding box to intersect
Returns: Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
确定两个 BoundingBox 是否相交
other: Other bounding box
Returns: Do bounding boxes intersect
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
确定 BoundingBox 是否为空
Returns: Returns true if the bounding box is empty