Autodesk.DesignScript.Geometry.EllipseArc.ToString
获取 EllipseArc 的字符串表示

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
以给定半径沿 X 和 Y 轴并扫掠通过角度在平面内创建 EllipseArc
plane: 包含椭圆弧的平面
xRadius: 平面 X 轴方向 EllipseArc 的半径
yRadius: 平面 Y 轴方向 EllipseArc 的半径
startAngle: 从输入平面 X 正轴开始测量时圆弧的起始角
sweepAngle: 从起始角开始扫掠的角度(度)
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiStartAngleSweepAngle(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
以给定半径沿 X 和 Y 轴并扫掠通过角度在平面内创建 EllipseArc
plane: 包含 EllipseArc 的平面
xRadius: 平面 X 轴方向 EllipseArc 的半径
yRadius: 平面 Y 轴方向 EllipseArc 的半径
startAngle: 从输入平面 X 正轴开始测量时圆弧的起始角
sweepAngle: 从起始角开始扫掠的角度(度)
ellipsearc,arcs