Autodesk.DesignScript.Geometry.Cone.ToString
获取 Cone 的字符串表示

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
在起点以指定底面半径创建圆锥体，延伸到位于终点的顶点。
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
给定起点和终点半径，从起点到终点通过轴创建圆锥。该对象没有顶点，可看作是修剪后的圆锥体。
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
以基准点为 CoordinateSystem 原点创建圆锥体，在坐标系 Z 轴方向延伸长度量，圆形底部在坐标系 XY 平面内。

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
以基准点为 CoordinateSystem 原点创建圆锥体，在坐标系 Z 轴方向延伸长度量，圆形底部在坐标系 XY 平面内。
cone,cone by height,cones