Autodesk.DesignScript.Geometry.Point.ToString
获取 Point 的字符串表示

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
比较两个 Point 的字符串表示
other: 其他点
Returns: 两个对象是否相等

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
获取此类型的哈希代码
Returns: 此对象的唯一哈希代码

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
给定两个 2 笛卡尔坐标，在 XY 平面中形成点。Z 分量为 0。
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
获取原点 (0,0,0)
Returns: Origin point
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
通过给定的 3 个笛卡尔坐标形成一个点
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
通过 3 个笛卡尔坐标在给定坐标系中形成点
coordinateSystem: 父坐标系
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
删减点以排除所包含点的公差范围内的重复项
points: 要从中删减重复项的点列表
tolerance: 用于删减的公差
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near