Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
几何图形类型注册机制。
hostType: IGeometryEntity 衍生接口的类型。
contructor: 构造几何图形的代理。

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
在给定方向按向量长度平移几何图形
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
通过变换给定坐标系变换几何图形
Returns: 变换的几何图形

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
将该几何图形从源 CoordinateSystem 变换到新的
上下文 CoordinateSystem。
Returns: 已变换的几何图形。
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
绕原点和轴将对象旋转指定
度数
around,axis,degrees

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
绕平面原点和法线将对象旋转指定
度数
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
绕原点不等比例缩放
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
绕给定平面不等比例缩放
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
使用两个拾取点作为标量，绕给定点等比例缩放
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
由基准点和 2 个拾取点确定的一维缩放。缩放轴由基准点和起点之间的连线确定。
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
由基准点和 2 个拾取点确定的二维缩放，两个拾取点投影到基准平面以确定二维缩放系数
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
获取从该几何图形到另一几何图形的距离
other: 其他几何图形
Returns: 距离
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
获取该几何图形上至其他几何图形最近的点
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
确定另一几何对象是否与该几何对象相交
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
获取该对象与另一对象的相交几何图形
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
获取该对象几何图形与其他几何图形集的交点。查找所有参与者的共同几何图形。
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
使用其他几何图形作为拆分工具，拆分该几何图形
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
检查两个对象是否具有相同的典型几何图形或数字值
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
获取包含给定几何图形的 BoundingBox
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
将几何图形转化为实体定义 JSON
Returns: JSON 格式的字符串

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
导入一个 SAT 文件并返回一个所导入几何图形的数组
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
导入一个 SAT 文件并返回一个所导入几何图形的数组
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
将指定几何图形导出至给定 SAT 文件路径
filePath: 接收导出几何图形的文件的名称

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
将指定几何图形导出至给定 SAT 文件路径
filePath: 接收导出几何图形的文件的名称
unitsMM: 要使用的单位

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String,System.Double)
将指定几何图形列表导出至给定 SAT 文件路径

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
将指定几何图形序列化为标准 ACIS 二进制 (SAB) 格式，并返回序列化二进制流数据

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
将指定几何图形列表序列化为标准 ACIS 二进制 (SAB) 格式，并返回序列化二进制流数据
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
获取当初用于创建该几何图形的关联/参考坐标系。