Autodesk.DesignScript.Geometry.PolySurface.ToString
获取 PolySurface 的字符串表示

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
通过沿轨线扫掠曲线创建 Polysurface。
rail: 扫掠路径曲线
profile: 扫掠轮廓
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
按点查找曲面。获取前进方向的第一个交点。如果点击曲面内部，则返回一个曲面；如果点击边内部，则返回两个曲面；如果点击顶点，则返回多个曲面
surfacesatpoint,findsurfaces,extractsurfaces

Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
返回多重曲面的曲面数量。
Returns: Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
返回多重曲面的边数量。
Returns: Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
返回多重曲面的顶点数量。
Returns: Number of vertices