Autodesk.DesignScript.Geometry.Circle.ToString
获取 Circle 的字符串表示

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
以世界坐标系 Z 轴为法线通过在世界坐标系 XY 平面输入圆心和半径创建圆。
centerPoint: Center point of circle
radius: Radius
Returns: Circle created with center point and radius
circle

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadiusNormal(Autodesk.DesignScript.Geometry.Point,System.Double,Autodesk.DesignScript.Geometry.Vector)
通过指定圆心、半径和法线方向创建圆。
centerPoint: Center point of circle
radius: Radius
normal: Normal direction vector
Returns: Circle created with center point radius and normal
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
在输入平面内以输入平面原点为圆心按给定半径创建圆。
plane: Root of plane used to center circle
radius: Radius
Returns: Circle created with plane and radius
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
通过三个输入点创建圆。
p1: 1st point of circle
p2: 2nd point of circle
p3: 3rd point of circle
circle

Autodesk.DesignScript.Geometry.Circle.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
通过点的最佳拟合圆
points: 圆弧的拟合目标点的列表
Returns: Circle created from points
circle,approximate