Autodesk.DesignScript.Geometry.Vector.ToString
获取 Vector 的字符串表示

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
比较两个 Vector 的字符串表示
other: 其他向量
Returns: 两个对象是否相等

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
获取此类型的哈希代码
Returns: 此对象的唯一哈希代码

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
由 3 个欧几里得坐标形成一个向量
x: X 轴坐标
y: Y 轴坐标
z: Z 轴坐标
Returns: Vector created by coordinates
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
由 3 个欧几里得坐标形成一个向量并使向量规范化
x: X 轴坐标
y: Y 轴坐标
z: Z 轴坐标
normalized: True 表示对向量规格化；False 表示不规格化
Returns: Vector created by coordinates
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
由两个终点形成一个向量。结果是一个从起点到终点的向量。
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
获取规范 X 轴向量 (1,0,0)
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
获取规范 Y 轴向量 (0,1,0)
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
获取规范 Z 轴向量 (0,0,1)
z,basis,up

Autodesk.DesignScript.Geometry.Vector.Cross(Autodesk.DesignScript.Geometry.Vector)
形成两个向量的矢积
perpendicular

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
形成两个向量的点积
vec: a second vector
Returns: Resulting dot product
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
确定两个向量是否平行。
otherVector: 其他向量
Returns: Returns True if the vectors are parallel; false otherwise.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
确定两个向量是否几乎相等。为处理精度问题提供了 1e-5 的公差值。
otherVector: 其他向量
Returns: Returns True if the vectors are almost equal; false otherwise.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
通过输入 CoordinateSystem 矩阵变换该向量。
coordinateSystem: 变换向量所用的坐标系
Returns: Transformed vector

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
绕轴按指定度数旋转向量
axis: Rotation axis vector
degrees: Number of degrees to rotate
Returns: Rotated vector
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
绕平面原点和法线按指定度数旋转向量
plane: 旋转平面
degrees: Number of degrees to rotate
Returns: Rotated vector
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
绕原点等比例缩放向量
scale_factor: Scale factor
Returns: Scaled vector
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
返回两个向量之间的角度(以度为单位，从 0 到 180)
otherVector: Other vector
Returns: Returns angle between the supplied vectors in degrees from 0 to 180.
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
返回两个向量之间的角度，范围为 [0, 180] 度。
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
返回两个向量之间的角度(以度为单位，从 0 到 360)。它使用旋转轴来确定角度方向。
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
返回两个向量之间的角度，范围为 [0, 360] 度。它使用旋转轴以确定角度方向。
rotation angle