Autodesk.DesignScript.Geometry.PolyCurve.ToString
获取 PolyCurve 的字符串表示

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
通过连接曲线生成 PolyCurve。根据需要翻转曲线以供连接。在 1e-6 到 1e-3 单位之间选择首选的连接公差。
curves: 连接到复合线的曲线
joinTolerance: 确定要连接的曲线之间允许的间隙尺寸的公差
Returns: 由连接曲线创建的复合线
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
通过连接点生成 PolyCurve。将“connectLastToFirst”输入设置为 True 以闭合 PolyCurve。
points: 用于生成复合线的点
connectLastToFirst: True 表示将最后一个点连接到第一个点；False 表示保持张开状态
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.Curves
返回复合线的各曲线
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
按索引返回复合线的曲线
index: 用于定位点的长度
endOrStart: True 表示从复合线的终点开始计数；False 表示从复合线的起点开始计数
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
通过切线圆弧延伸复合线
length: 延伸圆弧的长度
radius: 圆弧的半径
endOrStart: 复合线延伸终点或起点

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
在其平面偏移复合线。
signedDistance: 偏移量
extendCircular: 切换为使角变圆
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
在其平面给复合线倒圆角。
radius: 圆角半径
rightSide: True 表示对右侧倒圆角(相对于复合线的起点)；False 表示对左侧倒圆角
Returns: Filleted polyCurve
round,smooth,radius