Autodesk.DesignScript.Geometry.UV.ToString
获取 UV 的字符串表示

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
比较两个 UV 的字符串表示
other: 其他 UV
Returns: 两个对象是否相等

Autodesk.DesignScript.Geometry.UV.GetHashCode
获取此类型的哈希代码
Returns: 此对象的唯一哈希代码

Autodesk.DesignScript.Geometry.UV.ByCoordinates(System.Double,System.Double)
由两个双精度数创建 UV。
u: U value
v: V value
Returns: UV created by coordinates
surfaceparam,parameters,uv,uvs