Autodesk.DesignScript.Geometry.NurbsCurve.ToString
获取 NurbsCurve 的字符串表示

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
通过使用明确的控制点创建 BSplineCurve。注意 1:  阶数为 1 的 BSplineCurve 具有 G1 不连续性，这会导致拉伸、扫掠和其他操作问题。这应该尽可能避免。使用 PolyCurve 替代。注意 2: 如果曲线具有周期性(闭合)， 则第一个点和最后一个点必须相同。
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
通过使用明确的控制点创建 BSplineCurve。注意 1:  阶数为 1 的 BSplineCurve 具有 G1 不连续性，这会导致拉伸、扫掠和其他操作问题。这应该尽可能避免。使用 PolyCurve 替代。注意 2: 如果曲线具有周期性(闭合)， 则第一个点和最后一个点必须相同。
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
通过使用明确的控制点创建 BSplineCurve。注意 1:  阶数为 1 的 BSplineCurve 具有 G1 不连续性，这会导致拉伸、扫掠和其他操作问题。这应该尽可能避免。使用 PolyCurve 替代。注意 2: 如果曲线具有周期性(闭合)， 则第一个点和最后一个点必须相同。
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
由控制点、权重和节点创建 BSplineCurve。从 ASM 文档: 阶数: 应大于 1 (分段线性样条曲线)且小于 26 (ASM 支持的最大 B 样条曲线基础次数)。权重: 所有权重值(若提供)应仅限于正值。权重小于 1e-11 将被拒绝，该函数将失效。节点: 节点向量应为非递减序列。内部节点多重性不应大于起点/终点节点处的次数 + 1 和内部节点处的次数(这样才能表示具有 G1 不连续性的曲面)。请注意，非固定边界节点向量均受支持，但将被转换为“固定边界”节点，相应更改应用到控制点/权重数据。节点数组: 数组大小必须为控制点数 + 阶数 + 1
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
通过在各点之间插值创建 BSplineCurve。
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
通过在各点之间插值创建 BSplineCurve。注意 2: 如果曲线具有周期性(闭合)，则第一个点和最后一个点必须相同。
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
通过按指定角度在各点之间插值创建 BSplineCurve。
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
返回通过各点且具有切线方向的 BSplineCurve。
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
获取 NurbsCurve 的控制点。这些是曲线插入的点。
Returns: 一组点

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
曲线的节点。节点是一系列参数值(双精度值)，用于确定控制点影响曲线的位置和方式。
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
返回 NurbsCurve 控制点权重。权重确定每个控制点对曲线形状的影响。
Returns: Weights of nurbs curve
ptweight