Autodesk.DesignScript.Geometry.Solid.ToString
获取 Solid 的字符串表示

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
以导向曲线为辅助，通过在输入横截面闭合曲线之间放样来创建实体。导向曲线必须与所有横截面曲线相交。
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
以导向曲线为辅助，通过在输入横截面闭合曲线之间放样来创建实体。导向曲线必须与所有横截面曲线相交。
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
通过在由闭合 PolyCurve 构成的输入横截面之间放样来创建实体。此操作已针对由直线段构成的截面进行了完全优化，其中顶点遵循相同顺序。启用此选项后，检查和修复选项会保证所生成实体的有效性，而禁用该选项会提高性能。
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
沿两条轨道曲线扫掠闭合轮廓曲线。
path: 要沿途扫掠的输入路径。
guideRail: 用于引导扫掠方向的轨道。
profile: The profile curve to sweep along the path
Brep,brep,sweep2,guides,sweepprofile

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
绕由原点和轴向量形成的轴射线扫掠轮廓曲线，从起点角(度)到掠角(度)，创建旋转实体。
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Solid created by revolve
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
将一列实体与该实体合并。
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
该实体与另一实体的布尔差集

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
从该实体各个表面获取实体壳
internalFaceThickness: 壳体向内延伸的距离
externalFaceThickness: 壳外向外延伸的距离
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
按输入向量方向将输入几何图形投射到该实体上。!!该投射方法当前仅支持点或曲线!!
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
如果一个实体包含多个不相交块，则会将该实体分离为各个实体。如果实体是单个连续块，则会返回该同一实体。
Returns: 分离不相交的实体
split,disjoint