Autodesk.DesignScript.Geometry.Helix.ToString
获取 Helix 的字符串表示

Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
创建螺旋线。螺旋线始终相对所提供的轴方向顺时针旋转。如果沿轴方向查看，会看到在点沿曲线朝参数不断增加的方向移动时会绕轴顺时针旋转。螺距为螺旋线每转一圈的轴向移动距离，可以是正值或负值。
axisPoint: Axis point
axisDirection: Axis direction vector
startPoint: Helix start point
pitch: Distance of the helix per each 360 degrees in the direction of the axis
angleTurns: How many turns in degrees
Returns: Helix created by axis
helix,screw,corkscrew,thread