Autodesk.DesignScript.Geometry.Arc.ToString
获取 Arc 的字符串表示

Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
创建最接近点集合的圆弧
points: 圆弧的最佳拟合目标点的列表
Returns: Arc created by best fit through points
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
通过起点和终点以及起点和终点的切线来创建圆弧或切线双圆弧
point1: 双圆弧的起始点
vector1: 双圆弧的起始切向量
point2: 双圆弧的终结点
vector2: 双圆弧的端点的切向量
arc,tangent

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
从起点到终点创建圆弧，且起点与向量相切
startPoint: Start point of arc
endPoint: End point of arc
startTangent: Start tangent direction vector
arc,tangent,arcs