Autodesk.DesignScript.Geometry.Edge.ToString
获取 Edge 的字符串表示

Autodesk.DesignScript.Geometry.Edge.CurveGeometry
构成边的基本曲线

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
与该边相邻的面

Autodesk.DesignScript.Geometry.Edge.StartVertex
该边起点处的顶点

Autodesk.DesignScript.Geometry.Edge.EndVertex
该边终点处的顶点