Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
获取 CoordinateSystem 的字符串表示

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
创建 CoordinateSystem，使其原点位于输入点， X 和 Y 轴
设置为 WCS 的 X 和 Y 轴。
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
通过 X 和 Y 轴在原点处创建 CoordinateSystem，Z
轴完全忽略。在创建此 CoordinateSystem 之前先将输入向量
规范化。
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
在指定柱面坐标参数处相对于指定坐标系创建 CoordinateSystem

Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
在指定球面坐标参数处相对于指定坐标系创建 CoordinateSystem

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
确定能否获取该 CoordinateSystem 的逆变换
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
测试缩放是否正交，即是否具有错切分量。
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
测试缩放是否正交且所有向量是否规范化。
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
创建表示 CoordinateSystem 原点的点。
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
返回 CoordinateSystem 的 X 轴。
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
返回 CoordinateSystem 的 Y 轴。
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
返回 CoordinateSystem 的 Z 轴。
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
返回 CoordinateSystem 的 X 轴缩放: X 轴向量的长度。

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
返回 CoordinateSystem 的 Y 轴缩放: Y 轴向量的长度。

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
返回 CoordinateSystem 的 Z 轴缩放: Z 轴向量的长度。

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
获取该 CoordinateSystem 的逆变换 - 将该 CoordinateSystem 应用于一个几何图形以逆变换回原坐标系。

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
在该坐标系之后应用 CoordinateSystem - 结果 = 该坐标系 * 其他坐标系

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
在该坐标系之前应用 CoordinateSystem - 结果 = 其他坐标系 * 该坐标系

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
返回一个包含 X、Y 和 Z 缩放系数的向量
Returns: 缩放的向量
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
确定两个坐标系是否相同
other: 其他坐标系
Returns: 如果坐标系相等，则返回 True

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
将任意 CoordinateSystem 按给定位移朝 WCS 中分别定义的 X、Y、Z 方向
平移。
xTranslation: 沿 X 轴的位移。
yTranslation: 沿 Y 轴的位移。
zTranslation: 沿 Z 轴的位移。
Returns: 已变换的 CoordinateSystem。
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
按输入向量的方向和大小平移对象。
direction: 平移方向的向量
Returns: 转换的坐标系
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
将任意 CoordinateSystem 类型按给定距离朝给定方向
平移。
direction: 位移方向向量
distance: 沿给定方向的位移距离
Returns: 转换的坐标系
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
将该 CoordinateSystem 从源 CoordinateSystem 变换到新
上下文 CoordinateSystem。
Returns: 已变换的 CoordinateSystem。

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
绕原点和轴将对象旋转指定度数
origin: 原点
axis: 旋转的向量轴
degrees: 旋转度数
Returns: 旋转的坐标系
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
绕给定平面原点和法线将对象旋转指定
度数
plane: 要从其获取法线的平面
degrees: 旋转值(以度为单位)
Returns: 旋转的坐标系
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
绕原点等比例缩放
amount: 缩放量
Returns: 缩放的坐标系
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
绕原点不等比例缩放
xamount: X 轴上的缩放量
yamount: Y 轴上的缩放量
zamount: Z 轴上的缩放量
Returns: 缩放的坐标系
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
绕给定平面不等比例缩放
plane: 要围绕其缩放的平面
xamount: X 轴上的缩放量
yamount: Y 轴上的缩放量
zamount: Z 轴上的缩放量
Returns: 缩放的坐标系
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
绕给定点等比例缩放，请使用
basePoint: 缩放基点
from: 缩放起点
to: 缩放终点
Returns: 缩放的坐标系
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
使用基点、起点(从)和终点(到)进行一维缩放。缩放轴由基点和起点之间的连线确定。。
basePoint: 缩放基点
from: 缩放起点
to: 缩放终点
Returns: 缩放的坐标系
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
由基准点和 2 个拾取点确定的二维缩放，两个拾取点投影到基准平面以确定二维缩放系数
basePlane: 缩放基点
from: 缩放起点
to: 缩放终点
Returns: 缩放的坐标系
resize,size,from,to,scale2d,2d