Autodesk.DesignScript.Geometry.Cylinder.ToString
获取 Cylinder 的字符串表示

Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
由父 CoordinateSystem、半径和圆柱体高度构造实心圆柱体
coordinateSystem: 父坐标系
radius: Radius size
height: Cylinder height
Returns: Cylinder created from radius and height
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
通过给定圆柱体底部和顶部中心点构造实心圆柱体。
startPoint: Start point of cylinder
endPoint: End point of cylinder
radius: Radius  of cylinder
Returns: Cylinder created by points and radius
cylinder,tube,by center points