Autodesk.DesignScript.Geometry.NurbsSurface.ToString
获取 NurbsSurface 的字符串表示

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
创建具有指定插入点以及 U 和 V 阶数的 NurbsSurface。生成的曲面将通过所有的点。
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
创建具有指定插入点以及 U 和 V 阶数的 NurbsSurface。生成的曲面将通过所有的点。切线的数量必须与相应方向点的数量匹配。在 U 和 V 方向生成的曲面均为 3 阶。
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
创建满足一组不同曲面特性条件的 NurbsSurface。这是最高级曲面拟合方式。生成的曲面将通过所有的点。切线的数量必须与相应方向点的数量匹配。在 U 和 V 方向生成的曲面均为 3 阶。角导数应为二阶(dP / dUdV)，并应在该阶 [lowU、lowV]、[highU、lowV]、[lowU、highV]、[highU、highV] 提供。
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
使用明确的控制点以指定 U 和 V 阶数创建 NurbsSurface。
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
创建具有指定控制顶点、节点、权重和 U V 阶数的 NurbsSurface。对数据有若干限制，如果超出限制，将导致该函数失效并引发异常。次数: U- 和 V- 阶数应 > = 1 (分段线性样条曲线)且小于 26 (ASM 支持的最大 B 样条曲线基础次数)。权重: 所有权重值(若提供)应仅限于正值。权重小于 1e-11 将被拒绝，该函数将失效。节点: 两个节点向量应为非递减序列。内部节点多重性不应大于起点/终点节点处的次数 + 1 和内部节点处的次数(这样才能表示具有 G1 不连续性的曲面)。请注意，非固定边界节点向量均受支持，但将被转换为“固定边界”节点，相应更改应用到控制点/权重数据。
lines
0.4

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
返回 NurbsSurface 控制点权重。权重将确定每个控制点对曲面形状的影响。
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
返回 U 方向上的曲面节点。节点是一系列参数值(双精度值)，用于确定控制点影响曲面的位置和方式。
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
返回 V 方向上的曲面节点。节点是一系列参数值(双精度值)，用于确定控制点影响曲面的位置和方式。
Returns: Nurbs V knots of surface