DSCore.DummyPythonEvaluator
Analizator języka Python, który tylko zwraca błąd w przypadku próby przeprowadzenia analizy.
Służy przede wszystkim do wskazania, że nie można odnaleźć rzeczywistego analizatora języka Python.

DSCore.DummyPythonEvaluator.Evaluate(System.String,System.Collections.IList,System.Collections.IList)
Zgłasza wyjątek z przypisanym komunikatem