DSCore.DateTime.Components(System.DateTime)
Wyodrębnia poszczególne składowe DateTime.
dateTime: Wartość DateTime, z której zostaną pobrane składniki
Reprezentacja liczbowa roku (1–9999)
Reprezentacja liczbowa miesiąca (1–12)
Reprezentacja liczbowa dnia (1–[liczba dni w miesiącu])
Reprezentacja liczbowa godziny (0–23)
Reprezentacja liczbowa minut (0–59)
Reprezentacja liczbowa sekund (0–59)
Reprezentacja liczbowa sekund (0–999)