DSCore.List.IndexOf(System.Collections.IList,System.Object)
Zwraca indeks elementu na danej liście. Zgodność między daną listą a elementem docelowym musi być ścisła (tj. oba elementy muszą być typu int, double, string lub object itp.)
list: Lista, w której ma zostać znaleziony element.
element: Element, którego indeks ma zostać zwrócony.
Indeks elementu na liście. Jeśli nie zostanie znalezione ścisłe dopasowanie, zostanie zwrócony indeks niepoprawny: -1.
index,indexof

DSCore.List.Transpose(System.Collections.IList)
Zamienia wiersze i kolumny na wykazie list.
Jeśli listy zawierają wiersze, które są krótsze od pozostałych,
wstawiane są wartości zerowe jako obiekty zastępcze w otrzymywanym
szyku tak, by zawsze był prostokątny.
lists: Wykaz list do przestawienia
Wykaz przestawionych list
transpose,flip matrix,matrix,swap,rows,columns