DSCore.IO.Image.WriteToFile(System.String,System.Drawing.Bitmap)
Zapisz obraz w ścieżce na podstawie określonej nazwy pliku.
image: Obraz do zapisania
Brak danych wyjściowych
write image,image,file,filepath