Autodesk.DesignScript.Geometry.Ellipse.ToString
Pobierz reprezentację ciągu znaków elipsy

Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Utwórz elipsę ze środkiem w punkcie wejściowym, wyrównaną z płaszczyzną XY GUW, o określonych promieniach osi X i Y.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by origin and radii
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Utwórz elipsę ze środkiem w punkcie wejściowym, z dwoma określonymi osiami. Osie powinny być skierowane względem siebie pod kątem 90 stopni.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from origin vectors
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Utwórz elipsę wyśrodkowaną na i wyrównaną z wejściowym CoordinateSystem, o promieniu x_radius w kierunku X UW promieniu y_radius w kierunku Y UW.
origin: Origin coordinate system of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by coordinate system and radii
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Utwórz elipsę wyśrodkowaną na i wyrównaną z płaszczyzną wejściową, o promieniu x_radius w kierunku osi X płaszczyzny i promieniu y_radius w kierunku osi Y płaszczyzny.
plane: Plane where ellipse arc is drawn
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from plane and radii
ellipse,aligned ellipse,ellipsebylengths