Autodesk.DesignScript.Geometry.Plane.ToString
Pobierz reprezentację ciągu znaków płaszczyzny

Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Utwórz płaszczyznę wyśrodkowaną w punkcie głównym, z wejściowym wektorem normalnym.
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Utwórz płaszczyznę „zorientowaną”, położoną w punkcie początkowym z wektorem normalnym, ale z określoną orientacją osi X. Nie ma to wpływu na operacje dzielenia, przecinania, rzutowania, itp., określa jedynie orientację wejściowego układu współrzędnych.
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Osie X i Y leżą w płaszczyźnie. Oś Z jest iloczynem wektorowym tych dwóch wektorów.
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Dopasowuje płaszczyznę do punktów wejściowych; dopasowanie wykresu rozproszenia 3D.
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Utwórz płaszczyznę zawierającą linię wejściową i punkt zewnętrzny. Punkt nie może leżeć na linii ani na osi linii.
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.XY
Tworzy płaszczyznę w globalnej płaszczyźnie XY
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
Tworzy płaszczyznę w globalnej płaszczyźnie XZ
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
Tworzy płaszczyznę w globalnej płaszczyźnie XY
Returns: Plane at YZ plane of world

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
Tworzy nowy CoordinateSystem reprezentujący tę płaszczyznę. Jest on oparty na początku oraz podstawie osi X i Y.
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
Utwórz nowe odsunięcie płaszczyzny przez tę płaszczyznę w kierunku normalnej na określoną odległość.
alongnormal,moveplane