Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
Pobierz reprezentację ciągu znaków układu współrzędnych

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
Utwórz CoordinateSystem z początkiem w punkcie wejściowym, z osiami X i Y
ustawionymi jako osie X i Y GUW.
bypoint

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Utwórz CoordinateSystem w początku z osiami X i Y i z całkowitym pominięciem
osi Z. Wektory wejściowe są normalizowane przed utworzeniem
CoordinateSystem.
byxy,coord by2axis

Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Tworzy CoordinateSystem o określonych parametrach współrzędnych walcowych względem określonego układu współrzędnych

Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Tworzy CoordinateSystem o określonych parametrach współrzędnych sferycznych względem określonego układu współrzędnych

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
Określ, czy możliwe jest uzyskanie odwrócenia tego CoordinateSystem
inverse,testinverse

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
Sprawdza, czy skalowanie jest ortogonalne, tj. nie ma składnika ścinającego.
uniform

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
Sprawdza, czy skalowanie jest ortogonalne i czy wszystkie wektory są znormalizowane.
uniform,normal,samelength

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
Tworzy punkt reprezentujący początek CoordinateSystem.
position,center

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
Zwraca oś X CoordinateSystem.
left,right

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
Zwraca oś Y CoordinateSystem.
forward,back

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
Zwraca oś Z CoordinateSystem.
up,down

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
Zwraca skalowanie osi X CoordinateSystem: długość wektora osi X.

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
Zwraca skalowanie osi Y CoordinateSystem: długość wektora osi Y.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
Zwraca skalowanie osi Z CoordinateSystem: długość wektora osi Z.

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
Pobiera odwrócenie tego CoordinateSystem — zastosowanie tego CoordinateSystem do elementu geometrii odwraca oryginalny układ.

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Zastosuj argument CoordinateSystem po tym — Wynik = ten * inny

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Zastosuj argument CoordinateSystem przed tym — Wynik = inny * ten

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
Zwraca wektor zawierający współczynniki skali X, Y i Z
Returns: Przeskalowany wektor
get size,scalecomponents,scalevector

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
Określ, czy dwa układy CoordinateSystem są równe
other: inny układ współrzędnych
Returns: zwraca wartość prawda (True), jeśli układy współrzędnych są równe

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
Przekształca dowolny CoordinateSystem o dane przemieszczenia w kierunkach z, y
i z zdefiniowanych w układzie GUW.
xTranslation: Przesunięcie wzdłuż osi X.
yTranslation: Przesunięcie wzdłuż osi Y.
zTranslation: Przesunięcie wzdłuż osi Z.
Returns: Przekształcony CoordinateSystem.
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
Przekształć obiekt zgodnie z kierunkiem i wielkością wektora wejściowego.
direction: Wektor kierunku przekształcenia
Returns: Przekształcony układ współrzędnych
move,along vector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Przekształca dowolny typ CoordinateSystem o daną odległość w danym
kierunku.
direction: Wektor kierunku przemieszczenia
distance: Odległość przemieszczenia wzdłuż podanego kierunku
Returns: Przekształcony układ współrzędnych
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Przekształca ten CoordinateSystem ze źródłowego CoordinateSystem na nowy CoordinateSystem
kontekstu.
Returns: Przekształcony CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Obraca obiekt wokół początku i osi o określony stopień
origin: Punkt początkowy
axis: Oś wektora dla obrotu
degrees: Stopnie, o które należy obrócić
Returns: Obrócony układ współrzędnych
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Obraca obiekt wokół początku i normalnej płaszczyzny o określony
stopień
plane: Płaszczyzna, z której należy pobrać normalną
degrees: Wartość obrotu w stopniach
Returns: Obrócony układ współrzędnych
/// around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
Skaluj jednorodnie wokół początku
amount: Wartość, o którą należy przeskalować
Returns: Przeskalowany układ współrzędnych
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
Skaluj niejednorodnie wokół początku
xamount: Wartość, o którą należy przeskalować na osi X
yamount: Wartość, o którą należy przeskalować na osi Y
zamount: Wartość, o którą należy przeskalować na osi Z
Returns: Przeskalowany układ współrzędnych
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Skaluj jednorodnie wokół danej płaszczyzny
plane: Płaszczyzna do przeskalowania
xamount: Wartość, o którą należy przeskalować na osi X
yamount: Wartość, o którą należy przeskalować na osi Y
zamount: Wartość, o którą należy przeskalować na osi Z
Returns: Przeskalowany układ współrzędnych
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Skaluj jednorodnie wokół danego punktu, używając
basePoint: Punkt bazowy skalowania
from: Punkt, od którego należy skalować
to: Punkt, do którego należy skalować
Returns: Przeskalowany układ współrzędnych
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Skaluj w jednym wymiarze przez punkt bazowy, punkt początkowy (od) i punkt końcowy (do). Oś skalowania definiuje linia między punktem bazowym a punktem początkowym.
basePoint: Punkt bazowy skalowania
from: Punkt, od którego należy skalować
to: Punkt, do którego należy skalować
Returns: Przeskalowany układ współrzędnych
resize,size,from,to,scale1d,1d, lines
0.5,0.5,0.5,0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Skaluj w dwóch wymiarach przez punkt bazowy i 2 punkty wewnętrzne. Te dwa punkty wewnętrzne są rzutowane na płaszczyznę bazową w celu określenia współczynników skali 2D
basePlane: Punkt bazowy skalowania
from: Punkt, od którego należy skalować
to: Punkt, do którego należy skalować
Returns: Przeskalowany układ współrzędnych
resize,size,from,to,scale2d,2d