Autodesk.DesignScript.Geometry.Polygon.ToString
Pobierz reprezentację ciągu znaków wieloboku

Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Sprawdza, czy punkt znajduje się wewnątrz płaskiego wieloboku niezawierającego samoprzecinających się elementów.