Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
Pobierz reprezentację ciągu znaków TSplineTopology

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
Zwrócony wierzchołek o podanym indeksie
index: Indeks, aby uzyskać wierzchołek w
Returns: Wierzchołek bryły T-splajn
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
Zwrócona krawędź o podanym indeksie
index: Indeks, aby pobrać krawędź w
Returns: Krawędź bryły T-splajn
tspline,face,byindex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
Zwrócona powierzchnia o podanym indeksie
index: Indeks, aby uzyskać powierzchnię na
Returns: Powierzchnia bryły T-splajn
tspline,face,byindex