Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
Pobierz reprezentację ciągu znaków TSplineSurface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz „zorientowaną” płaszczyznę T-splajn, umieszczoną w punkcie początkowym z wektorem normalnym, ale z określoną orientacją osi X.
Nie ma to wpływu na operacje dzielenia, przecinania, projektowania itp., lecz jedynie określa orientację wejściowego układu współrzędnych.
origin: Główny punkt płaszczyzny
normal: Normalna dla płaszczyzny
xAxis: Oś x płaszczyzny
minCorner: Punkt 2D minimalnego narożnika we współrzędnych płaszczyzny
maxCorner: Punkt 2D maksymalnego narożnika we współrzędnych płaszczyzny
xSpans: Liczba rozpiętości w szerokości
ySpans: Liczba rozpiętości w długości
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Płaszczyzna powierzchni T-splajn
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz płaszczyznę wg punktu początkowego oraz osi X, Y.
Oś Z jest iloczynem wektorowym dwóch wektorów.
origin: Główny punkt płaszczyzny
xAxis: Oś x płaszczyzny
yAxis: Płaszczyzna osi Y
minCorner: Punkt 2D minimalnego narożnika we współrzędnych płaszczyzny
maxCorner: Punkt 2D maksymalnego narożnika we współrzędnych płaszczyzny
xSpans: Liczba rozpiętości w szerokości
ySpans: Liczba rozpiętości w długości
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Płaszczyzna powierzchni T-splajn
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz stożek T-splajn stożek o podanym promieniu bazowym w punkcie początkowym,
wydłużając go do wierzchołka w punkcie końcowym.
startPoint: Punkt początkowy stożka
endPoint: Punkt końcowy stożka
radius: Promień podstawy stożka
radiusSpans: Liczba rozpiętości w obwodzie
heightSpans: Liczba rozpiętości w wysokości
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Stożkowa powierzchnia bryły T-splajn
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz stożek T-splajn z punktem bazowym na początku układu współrzędnych, wydłużając go w kierunku osi Z układu współrzędnych,
z okrągłą podstawą w płaszczyźnie XY układu współrzędnych.
cs: Środek i podstawa stożka zostaną dopasowane w płaszczyźnie X-Y tego układu współrzędnych
height: Wysokość stożka
radius: Promień stożka
radiusSpans: Liczba rozpiętości w obwodzie
heightSpans: Liczba rozpiętości w wysokości
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Stożkowa powierzchnia bryły T-splajn
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz stożek T-splajn z punktem bazowym na początku układu współrzędnych, wydłużając go w kierunku osi Z układu współrzędnych,
z okrągłą podstawą w płaszczyźnie XY układu współrzędnych.
cs: Środek i podstawa zostaną dopasowane w płaszczyźnie X-Y tego układu współrzędnych
height: Wysokość stożka
startRadius: Początkowy promień stożka
endRadius: Promień końcowy stożka
radiusSpans: Liczba rozpiętości w obwodzie
heightSpans: Liczba rozpiętości w wysokości
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Stożkowa powierzchnia bryły T-splajn
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz kulę T-splajn ze środkiem w punkcie wejściowym, o podanym promieniu.
centerPoint: Środek sfery
radius: Promień kuli
radiusSpans: Liczba rozpiętości promieniowych
heightSpans: Liczba rozpiętości w wysokości
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Powierzchnia kuli T-splajn
tspline,sphere,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz kulę T-splajn zawierającą cztery punkty wejściowe na powierzchni.
points: Cztery punkty na liście, aby utworzyć kulę. Punkty nie powinny być współpłaszczyznowe
radiusSpans: Liczba rozpiętości promieniowych
heightSpans: Liczba rozpiętości w wysokości
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Powierzchnia kuli T-splajn
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz prostopadłościan T-splajn wyśrodkowany w punkcie wejściowym, z określoną szerokością, długością i wysokością.
origin: Środek kostki
width: Szerokość prostopadłościanu
length: Długość prostopadłościanu
height: Wysokość prostopadłościanu
xSpans: Liczba rozpiętości w szerokości
ySpans: Liczba rozpiętości w długości
zSpans: Liczba rozpiętości w wysokości
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Prostopadłościan T-splajn
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz prostopadłościan T-splajn wyśrodkowany i zorientowany na wejściowy układ współrzędnych, z określoną szerokością, długością i wysokością.
cs: Płaszczyzna X-Y pola zostanie wyrównana do odpowiedniej współrzędnej X
width: Szerokość prostopadłościanu
length: Długość prostopadłościanu
height: Wysokość prostopadłościanu
xSpans: Liczba rozpiętości w szerokości
ySpans: Liczba rozpiętości w długości
zSpans: Liczba rozpiętości w wysokości
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Prostopadłościan T-splajn
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz prostopadłościan T-splajn rozciągający się od dolnego do górnego punktu.
lowPoint: Pierwszy narożnik
highPoint: Drugi narożnik
xSpans: Liczba rozpiętości w szerokości
ySpans: Liczba rozpiętości w długości
zSpans: Liczba rozpiętości w długości
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Prostopadłościan T-splajn
box,cube,byminmax,by corners,by points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz kulę kwadrantową T-splajn ze środkiem w początku układu współrzędnych o danym promieniu
cs: Lokalny układ współrzędnych
radius: Promień kuli kwadrantowej
spans: Liczba rozpiętości w dwóch wymiarach boków kuli kwadrantowej
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Kula kwadrantowa T-splajn
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz kulę kwadrantową T-splajn o danym środku i promieniu, wyrównaną do domyślnej globalnej płaszczyzny XY
center: Punkt środkowy kuli kwadrantowej
radius: Promień kuli kwadrantowej
spans: Liczba rozpiętości w dwóch wymiarach boków kuli kwadrantowej
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Kula kwadrantowa T-splajn
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Powierzchnia T-splajn z konstrukcji powierzchni NURBS za pomocą strategia jednorodne.
Wejściowa powierzchnia NURBS zostanie przebudowana za pomocą jednolitych węzłów umieszczonych
w równych przedziałach parametrycznych lub długości łuku w zależności od odpowiednich znaczników useArcLen
oraz aproksymowana przez powierzchnię NURBS stopnia 3. Wyjściowa bryła T-splajn jest dzielona wg danej liczby rozpiętości
oraz kierunków U i V.
nurbsSurface: Wejściowa powierzchnia NURBS
uSpans: Wymagana liczba rozpiętości w kierunku u
vSpans: Wymagana liczba rozpiętości w kierunku v
uUseArcLen: Czy używać długość łuku lub parametrycznego podziału w kierunku parametrycznym U
vUseArcLen: Czy używać długość łuku lub parametrycznego podziału w kierunku parametrycznym V
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
Utwórz powierzchnię T-splajn z powierzchni NURBS za pomocą strategii podziału krzywizny.
Wejściowa powierzchnia NURBS jest przebudowywana do stopnia 3. Liczba i położenia rozpiętości
dla wyjściowej bryły T-Spline jest automatycznie wykrywana w każdym kierunku na podstawie krzywizny.
nurbsSurface: Wejściowa powierzchnia NURBS
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Utwórz bryłę T-splajn przez przeciągnięcie krzywej przekroju poprzecznego wzdłuż ścieżki.
profile: Krzywa profilu
path: Krzywa ścieżki
parallel: Rozpiętości powinny być równoległe w kierunku ścieżki
pathSpans: Liczba rozpiętości w ścieżce
profileSpans: Liczba rozpiętości w profilu. Definiowane automatycznie, jeśli 0 lub mniej
pathUniform: Użyj strategii jednorodnej lub krzywizny dla rozkładu rozpiętości wzdłuż ścieżki
profileUniform: Użyj strategii jednorodnej lub krzywizny dla rozkładu rozpiętości wzdłuż profilu
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Utwórz powierzchnię T-splajn przez przeciągnięcie krzywej profilu wokół osi uformowanej
przez początek osi i kierunek osi, rozpoczynając od start_angle w stopniach,
i przeciągając o sweep_angle w stopniach.
profile: Krzywa profilu
axisOrigin: Środek obrotu
axisDirection: Oś obrotu
startAngle: Kąt rozpoczęcia obrotu
sweepAngle: Kąt zakończenia obrotu
radialSpans: Liczba rozpiętości w promieniu
axialSpans: Liczba rozpiętości w wysokości. Definiowane automatycznie, jeśli 0 lub mniej
uniform: Użyj strategii jednorodnej lub krzywizny dla rozkładu rozpiętości
symmetry: Opcje symetrii powierzchni T-splajn
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Utwórz orurowaną powierzchnię z sieci krzywych lub linii.
Gładkie połączenie jest tworzone w każdym punkcie przecięcia krzywych.
Niektóre parametry przyjmują pojedynczą wartość lub listę — dwie wartości dla krzywej.
curves: Lista krzywych, aby utworzyć rury z
defaultRadius: Domyślny promień dla tworzonych rur
snappingTolerance: Tolerancja stosowana do wykrycia przecięć krzywych
segmentsCount: Liczba segmentów w każdej rurze. Dozwolona jest wartość pojedyncza lub lista, dwa razy dłuższa niż liczba krzywych
endRotations: Wartości obrotów końca dla każdej rury (w stopniach). Dozwolona jest wartość pojedyncza lub listy, dwa razy dłuższa niż liczba krzywych
endRadii: Wartości promieni końcowych dla każdej rury. Dozwolona jest wartość pojedyncza lub listy, dwa razy dłuższa niż liczba krzywych
endPercentage: Wartości (0 do 1) z końca każdej krzywej wejściowej do początku siatki rury. Dozwolona jest wartość pojedyncza lub lista, dwa razy dłuższa niż liczba krzywych
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildPipes(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean)
Utwórz orurowaną powierzchnię z sieci krzywych lub linii.
Gładkie połączenie jest tworzone w każdym punkcie przecięcia krzywych.
Niektóre parametry przyjmują pojedynczą wartość lub listę — jedna wartość dla krzywej.
curves: Lista krzywych, aby utworzyć rury z
defaultRadius: Domyślny promień dla tworzonych rur
snappingTolerance: Tolerancja stosowana do wykrycia przecięć krzywych
segmentsCount: Liczba segmentów dla każdej krzywej. Liczba pozycji listy może odpowiadać liczbie krzywych albo być równa 1 na potrzeby replikacji lub 0 na potrzeby ustalania automatycznego.
autoHandleStart: Jeśli wartość logiczna to Prawda, to parametry uchwytu na początku każdej krzywej są generowane automatycznie, a parametry niestandardowe rotationsAtStart, radiiAtStart i positionsAtStart są ignorowane.
autoHandleEnd: Jeśli wartość logiczna to Prawda, to parametry uchwytu na końcu każdej krzywej są generowane automatycznie, a parametry niestandardowe rotationsAtEnd, radiiAtEnd i positionsAtEnd są ignorowane.
startRotations: Niestandardowy kąt obrotu w stopniach dla każdego uchwytu rury na początku każdej krzywej. Ten parametr jest ignorowany, gdy parametr autoHandleStart ma wartość Prawda. Liczba pozycji listy może odpowiadać liczbie krzywych lub być równa 1 na potrzeby replikacji.
endRotations: Niestandardowy kąt obrotu w stopniach dla każdego uchwytu rury na końcu każdej krzywej. Ten parametr jest ignorowany, gdy parametr autoHandleEnd ma wartość Prawda. Liczba pozycji listy może odpowiadać liczbie krzywych lub być równa 1 na potrzeby replikacji.
startRadii: Niestandardowy promień dla każdego uchwytu rury na początku każdej krzywej. Ten parametr jest ignorowany, gdy parametr autoHandleStart ma wartość Prawda. Liczba pozycji listy może odpowiadać liczbie krzywych lub być równa 1 na potrzeby replikacji.
endRadii: Niestandardowy promień dla każdego uchwytu rury na końcu każdej krzywej. Ten parametr jest ignorowany, gdy parametr autoHandleEnd ma wartość Prawda. Liczba pozycji listy może odpowiadać liczbie krzywych lub być równa 1 na potrzeby replikacji.
startPositions: Niestandardowe położenie dla każdego uchwytu rury na początku każdej krzywej — wartość procentowa z zakresu od 0 do 1 wzdłuż długości łuku krzywej. Ten parametr jest ignorowany, gdy parametr autoHandleStart ma wartość prawda (True). Liczba pozycji listy może odpowiadać liczbie krzywych lub być równa 1 na potrzeby replikacji. Pozycje początkowa i końcowa nie mogą się nakładać na poszczególnych krzywych. Najlepiej, aby pozycja początkowa była bliska 0, a końcowa bliska 1.
endPositions: Niestandardowe położenie dla każdego uchwytu rury na końcu każdej krzywej — wartość procentowa z zakresu od 0 do 1 wzdłuż długości łuku krzywej. Ten parametr jest ignorowany, gdy parametr autoHandleEnd ma wartość prawda (True). Liczba pozycji listy może odpowiadać liczbie krzywych lub być równa 1 na potrzeby replikacji. Pozycje początkowa i końcowa nie mogą się nakładać na poszczególnych krzywych. Najlepiej, aby pozycja początkowa była bliska 0, a końcowa bliska 1.
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
tspline,create,pipe,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
Połącz dane powierzchnie brył T-splajn w jedną.
Powierzchnie mogą nie być połączone ze sobą.
Jeśli co najmniej jedna powierzchnia jest w trybie ramki, powierzchnia wyjściowa będzie również w trybie ramki.
tSplineSurfaces: Powierzchnie T-splajn do połączenie
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
Czy T-splajn jest w trybie ramki czy wygładzania
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
Czy T-splajn jest otwarty.
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Przekształć powierzchnię bryły T-splajn w bryłę lub powierzchnię w zależności od kształtu
matchTopology: Określa, czy powstała bryła powinna mieć tę samą topologię co T-splajn
Returns: Element topologii (bryła lub powierzchnia)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToMesh(System.Int32,System.Double)
Przekształć powierzchnię bryły T-splajn w siatkę. Siatka może mieć zarówno trójkąty, jak i czworoboki.
minSegments: Minimalna liczba segmentów w każdym kierunku. Co najmniej jeden segment będzie zawsze tworzony.
tolerance: Maksymalna dopuszczalna odległość od siatki do powierzchni. Ustawienie wartości zero lub ujemnej spowoduje wyłączenie zastosowania
Returns: Element siatki
tspline,convert,mesh

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Point,System.Boolean)
Zespój podaną listę wierzchołków w jeden wierzchołek.
vertices: Wierzchołki do spojenia
newPosition: Położenie uchwytu wierzchołka wyniku. Jeśli przekazano pustą wartość, używane jest średnie położenie uchwytów.
keepSubdCreases: Zachowaj fałdowania subd wejściowej topologii
Returns: Powierzchnia T-splajn z zespojonymi wierzchołkami
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Usuń spoinę wszystkich danych krawędzi; każdy wierzchołek na wszystkich krawędziach zostanie rozdzielony.
edges: Zestaw krawędzi do rozdzielenia
Returns: Powierzchnie T-splajn z rozdzielonymi krawędziami
tspline,unweld,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Rozdziel wszystkie określone wierzchołki. Wszystkie krawędzie na każdym wierzchołku będą rozdzielone.
vertices: Zbiór wierzchołków do rozdzielenia
Returns: Powierzchnia T-splajn z rozdzielonymi wierzchołkami
tspline,unweld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Utwórz dopasowanie do bryły T-splajn i zamkniętej pętli krzywych
tsEdges: Zamknięta pętla krawędzi bryły T-splajn, aby utworzyć dopasowanie do
curves: Zamknięta krzywa pętli, aby utworzyć dopasowanie do
continuity: Ciągłość geometrii do próby dopasowania: G0, G1, G2
useArclength: Czy użyć linii trasowania arcLength podczas budowania dopasowania
useRefinement: W przypadku wartości Prawda do bryły T-splajn zostaną dodane dodatkowe punkty sterujące w celu dopasowania powierzchni w ramach określonej tolerancji.
numRefinementSteps: Maksymalna liczba kroków wygładzania. Ignorowane, jeśli dla opcji useRefinement ustawiono wartość Fałsz
refinementTolerance: Tolerancja do uwzględnienia. Ignorowane, jeśli ustawienie useRefinement ma wartość Fałsz
usePropagation: Czy użyć propagacji podczas tworzenia dopasowania
widthOfPropagation: Określa, na jaką część powierzchni wpływa dopasowanie. Ignorowane, jeśli dla opcji usePropagation ustawiono wartość Fałsz
tangentScale: Skala stycznej. Jeśli nie ustawiono ciągłości na G1, jest ignorowana
curvParamWeight: Waga parametru krzywizny. Jeśli ciągłość nie jest ustawiona na G2, jest ignorowana
flipSourceTargetAlignment: Czy odwrócić kierunek linii trasowania
Returns: Powierzchnia bryły T-splajn umieszczona pomiędzy danymi krawędziami granicznymi T-splajn i pętlą krzywej
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Utwórz dopasowanie do bryły T-splajn i zamkniętej pętli krzywych
tsEdges: Zamknięta pętla krawędzi bryły T-splajn, aby utworzyć dopasowanie do
curves: Zamknięta krzywa pętli, aby utworzyć dopasowanie do
continuity: Ciągłość geometrii do próby dopasowania: G0, G1, G2
useArclength: Czy użyć linii trasowania arcLength podczas budowania dopasowania
useRefinement: W przypadku wartości Prawda do bryły T-splajn zostaną dodane dodatkowe punkty sterujące w celu dopasowania powierzchni w ramach określonej tolerancji.
numRefinementSteps: Maksymalna liczba kroków wygładzania. Ignorowane, jeśli dla opcji useRefinement ustawiono wartość Fałsz
refinementTolerance: Tolerancja do uwzględnienia. Ignorowane, jeśli ustawienie useRefinement ma wartość Fałsz
usePropagation: Czy użyć propagacji podczas tworzenia dopasowania
widthOfPropagation: Określa, na jaką część powierzchni wpływa dopasowanie. Ignorowane, jeśli dla opcji usePropagation ustawiono wartość Fałsz
scale: Skala stycznej dla G1 lub skala krzywizny dla G2. Ignorowane, jeśli ciągłość to G0.
flipSourceTargetAlignment: Czy odwrócić kierunek linii trasowania
Returns: Powierzchnia bryły T-splajn umieszczona pomiędzy danymi krawędziami granicznymi T-splajn i pętlą krzywej
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Double,System.Boolean)
Utwórz dopasowanie do bryły T-splajn i zamkniętej pętli krawędzi reprezentacji bryłowej. Najpierw,
pętla krawędzi jest przekształcana w pętlę krzywej, a następnie przeprowadzane jest dopasowanie
tsEdges: Zamknięta pętla krawędzi bryły T-splajn, aby utworzyć dopasowanie do
brepEdges: Zamknięta pętli krawędzi reprezentacji bryłowej, aby utworzyć dopasowanie do
continuity: Ciągłość geometrii do próby dopasowania: G0, G1, G2
useArclength: Czy użyć linii trasowania arcLength podczas budowania dopasowania
useRefinement: W przypadku wartości Prawda do bryły T-splajn zostaną dodane dodatkowe punkty sterujące w celu dopasowania powierzchni w ramach określonej tolerancji.
numRefinementSteps: Maksymalna liczba kroków wygładzania. Ignorowane, jeśli dla opcji useRefinement ustawiono wartość Fałsz
refinementTolerance: Tolerancja do uwzględnienia. Ignorowane, jeśli ustawienie useRefinement ma wartość Fałsz
usePropagation: Czy użyć propagacji podczas tworzenia dopasowania
widthOfPropagation: Określa, na jaką część powierzchni wpływa dopasowanie. Ignorowane, jeśli dla opcji usePropagation ustawiono wartość Fałsz
tangentScale: Skala stycznej. Jeśli nie ustawiono ciągłości na G1, jest ignorowana
curvParamWeight: Waga parametru krzywizny. Jeśli ciągłość nie jest ustawiona na G2, jest ignorowana
flipSourceTargetAlignment: Czy odwrócić kierunek linii trasowania
Returns: Powierzchnia bryły T-splajn umieszczona pomiędzy danymi krawędziami granicznymi T-splajn i pętlą krawędzi reprezentacji bryłowej
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
Zmień styl wizualizacji bryły T-splajn.
Wizualizacja gładka, jeśli przekazano wartość Prawda; w innym przypadku pole.
enable: Włącz lub wyłącz wygładzoną wizualizację
Returns: T-splajn z wybranym stylem wizualizacji
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Utwórz połączenie pomiędzy dwoma zbiorami powierzchni. Elementy
pierwszej grupy są traktowane jako elementy podrzędne tej powierzchni. Elementy
drugiej grupy mogą być zarówno elementami podrzędnymi tej powierzchni, jak i należeć
do innej powierzchni. Topologia w obrębie każdej grupy może nie być
przyległa, ale należy utworzyć taką samą liczbę różnych pętli.
firstGroup: Pierwsza grupa powierzchni do połączenia
secondGroup: Druga grupa powierzchni do połączenia
followCurves: Łączenie krzywych dla każdej odrębnej pętli topologii
(proste linie są używane, gdy przekazywana jest pusta lista, jeśli przekazana
jest jedna krzywa, zostaje powielona, jeśli wykryto więcej niż jedną pętlę wejściową)
frameRotations: Liczba pełnych obrotów wokół
normalnej ramek wzdłuż krzywej łączącej dla każdej odrębnej
pętli topologii (0 jest używane, jeśli zostanie przekazana pusta lista, jeśli przekazana zostanie
jedna wartość, jest ona powielana, a jeśli więcej niż jedna, wykrywana jest pętla wejściowa)
spansCounts: Liczba segmentów wzdłuż połączenia dla
każdej odrębnej pętli topologii. Liczba rozpiętości dla każdej grupy powinna być
większa niż odpowiadająca liczba obrotów (wartość 1 jest używana w przypadku przekazania
pustej listy; jeśli przekazano jedną wartość, jest ona powielana, jeśli więcej niż
jedną, wykrywana jest pętla wejściowa)
cleanBorderBridges: Usuń połączenia pomiędzy krawędziami ramki.
keepSubdCreases: Zachowaj fałdowania subd
wejściowej topologii
firstAlignVertices: Lista wierzchołków orientacji dla
każdej odrębnej pętli topologii z pierwszej grupy (liczba wierzchołków powinna
być taka sama jak wykryta liczba pętli wejściowych lub lista może być pusta)
secondAlignVertices: Lista wierzchołków orientacji dla
każdej odrębnej pętli topologii z drugiej grupy (liczba wierzchołków powinna
być taka sama jak wykryta liczba pętli wejściowych lub lista może być pusta)
flipAlignmentFlags: Lista znaczników określających, czy
odwrócić wyrównanie połączenia dla odpowiednich pętli topologii.
(wartość fałsz ustawiana jest w przypadku przekazania pustej linii, jeśli przekazano jedną wartość, jest ona replikowana
dla wszystkich wykrytych pętli wejściowych).
Returns: Powierzchnia T-splajn z topologią, połączona połączeniem
tspline,bridge,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeFacesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Utwórz połączenie pomiędzy zbiorem powierzchni i zbiorem krawędzi. Elementy
pierwszej grupy są traktowane jako elementy podrzędne tej powierzchni. Elementy
drugiej grupy mogą być zarówno elementami podrzędnymi tej powierzchni, jak i należeć
do innej powierzchni. Topologia w obrębie każdej grupy może nie być
przyległa, ale należy utworzyć taką samą liczbę różnych pętli.
firstGroup: Pierwsza grupa powierzchni do połączenia
secondGroup: Druga grupa krawędzi do połączenia
followCurves: Łączenie krzywych dla każdej odrębnej pętli topologii
(proste linie są używane, gdy przekazywana jest pusta lista, jeśli przekazana
jest jedna krzywa, zostaje powielona, jeśli wykryto więcej niż jedną pętlę wejściową)
frameRotations: Liczba pełnych obrotów wokół
normalnej ramek wzdłuż krzywej łączącej dla każdej odrębnej
pętli topologii (0 jest używane, jeśli zostanie przekazana pusta lista, jeśli przekazana zostanie
jedna wartość, jest ona powielana, a jeśli więcej niż jedna, wykrywana jest pętla wejściowa)
spansCounts: Liczba segmentów wzdłuż połączenia dla
każdej odrębnej pętli topologii. Liczba rozpiętości dla każdej grupy powinna być
większa niż odpowiadająca liczba obrotów (wartość 1 jest używana w przypadku przekazania
pustej listy; jeśli przekazano jedną wartość, jest ona powielana, jeśli więcej niż
jedną, wykrywana jest pętla wejściowa)
cleanBorderBridges: Usuń połączenia pomiędzy krawędziami ramki.
keepSubdCreases: Zachowaj fałdowania subd
wejściowej topologii
firstAlignVertices: Lista wierzchołków orientacji dla
każdej odrębnej pętli topologii z pierwszej grupy (liczba wierzchołków powinna
być taka sama jak wykryta liczba pętli wejściowych lub lista może być pusta)
secondAlignVertices: Lista wierzchołków orientacji dla
każdej odrębnej pętli topologii z drugiej grupy (liczba wierzchołków powinna
być taka sama jak wykryta liczba pętli wejściowych lub lista może być pusta)
flipAlignmentFlags: Lista znaczników określających, czy
odwrócić wyrównanie połączenia dla odpowiednich pętli topologii.
(wartość fałsz ustawiana jest w przypadku przekazania pustej linii, jeśli przekazano jedną wartość, jest ona replikowana
dla wszystkich wykrytych pętli wejściowych).
Returns: Powierzchnia T-splajn z topologią, połączona połączeniem
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Utwórz połączenie pomiędzy zbiorem krawędzi i zbiorem powierzchni. Elementy
pierwszej grupy są traktowane jako elementy podrzędne tej powierzchni. Elementy
drugiej grupy mogą być zarówno elementami podrzędnymi tej powierzchni, jak i należeć
do innej powierzchni. Topologia w obrębie każdej grupy może nie być
przyległa, ale należy utworzyć taką samą liczbę różnych pętli.
firstGroup: Pierwsza grupa krawędzi do połączenia
secondGroup: Druga grupa powierzchni do połączenia
followCurves: Łączenie krzywych dla każdej odrębnej pętli topologii
(proste linie są używane, gdy przekazywana jest pusta lista, jeśli przekazana
jest jedna krzywa, zostaje powielona, jeśli wykryto więcej niż jedną pętlę wejściową)
frameRotations: Liczba pełnych obrotów wokół
normalnej ramek wzdłuż krzywej łączącej dla każdej odrębnej
pętli topologii (0 jest używane, jeśli zostanie przekazana pusta lista, jeśli przekazana zostanie
jedna wartość, jest ona powielana, a jeśli więcej niż jedna, wykrywana jest pętla wejściowa)
spansCounts: Liczba segmentów wzdłuż połączenia dla
każdej odrębnej pętli topologii. Liczba rozpiętości dla każdej grupy powinna być
większa niż odpowiadająca liczba obrotów (wartość 1 jest używana w przypadku przekazania
pustej listy; jeśli przekazano jedną wartość, jest ona powielana, jeśli więcej niż
jedną, wykrywana jest pętla wejściowa)
cleanBorderBridges: Usuń połączenia pomiędzy krawędziami ramki.
keepSubdCreases: Zachowaj fałdowania subd
wejściowej topologii
firstAlignVertices: Lista wierzchołków orientacji dla
każdej odrębnej pętli topologii z pierwszej grupy (liczba wierzchołków powinna
być taka sama jak wykryta liczba pętli wejściowych lub lista może być pusta)
secondAlignVertices: Lista wierzchołków orientacji dla
każdej odrębnej pętli topologii z drugiej grupy (liczba wierzchołków powinna
być taka sama jak wykryta liczba pętli wejściowych lub lista może być pusta)
flipAlignmentFlags: Lista znaczników określających, czy
odwrócić wyrównanie połączenia dla odpowiednich pętli topologii.
(wartość fałsz ustawiana jest w przypadku przekazania pustej linii, jeśli przekazano jedną wartość, jest ona replikowana
dla wszystkich wykrytych pętli wejściowych).
Returns: Powierzchnia T-splajn z topologią, połączona połączeniem
tspline,bridge,face,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BridgeEdgesToEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{System.Boolean})
Utwórz połączenie pomiędzy dwoma zbiorami krawędzi. Elementy
pierwszej grupy są traktowane jako elementy podrzędne tej powierzchni. Elementy
drugiej grupy mogą być zarówno elementami podrzędnymi tej powierzchni, jak i należeć
do innej powierzchni. Topologia w obrębie każdej grupy może nie być
przyległa, ale należy utworzyć taką samą liczbę różnych pętli.
firstGroup: Pierwsza grupa krawędzi do połączenia
secondGroup: Druga grupa krawędzi do połączenia
followCurves: Łączenie krzywych dla każdej odrębnej pętli topologii
(proste linie są używane, gdy przekazywana jest pusta lista, jeśli przekazana
jest jedna krzywa, zostaje powielona, jeśli wykryto więcej niż jedną pętlę wejściową)
frameRotations: Liczba pełnych obrotów wokół
normalnej ramek wzdłuż krzywej łączącej dla każdej odrębnej
pętli topologii (0 jest używane, jeśli zostanie przekazana pusta lista, jeśli przekazana zostanie
jedna wartość, jest ona powielana, a jeśli więcej niż jedna, wykrywana jest pętla wejściowa)
spansCounts: Liczba segmentów wzdłuż połączenia dla
każdej odrębnej pętli topologii. Liczba rozpiętości dla każdej grupy powinna być
większa niż odpowiadająca liczba obrotów (wartość 1 jest używana w przypadku przekazania
pustej listy; jeśli przekazano jedną wartość, jest ona powielana, jeśli więcej niż
jedną, wykrywana jest pętla wejściowa)
cleanBorderBridges: Usuń połączenia pomiędzy krawędziami ramki.
keepSubdCreases: Zachowaj fałdowania subd
wejściowej topologii
firstAlignVertices: Lista wierzchołków orientacji dla
każdej odrębnej pętli topologii z pierwszej grupy (liczba wierzchołków powinna
być taka sama jak wykryta liczba pętli wejściowych lub lista może być pusta)
secondAlignVertices: Lista wierzchołków orientacji dla
każdej odrębnej pętli topologii z drugiej grupy (liczba wierzchołków powinna
być taka sama jak wykryta liczba pętli wejściowych lub lista może być pusta)
flipAlignmentFlags: Lista znaczników określających, czy
odwrócić wyrównanie połączenia dla odpowiednich pętli topologii.
(wartość fałsz ustawiana jest w przypadku przekazania pustej linii, jeśli przekazano jedną wartość, jest ona replikowana
dla wszystkich wykrytych pętli wejściowych).
Returns: Powierzchnia T-splajn z topologią, połączona połączeniem
tspline,bridge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
Wypełnij otwory w T–splajn
edges: Zestaw krawędzi z otworem w środku. Krawędzie muszą być ramką.
fillMethod: Metoda wypełniania luki: 0 – krzyżowanie, 1 – wieloboki, 2 — zwijanie, 3 — zwijanie i łączenie
keepSubdCreases: Zachowaj fałdowania subd wejściowej topologii
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
Skompresuj wszystkie topologie na powierzchni i ustaw ciągłe indeksy. Ta funkcja zachowuje względną kolejność indeksów.
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
Interpolacja w przód powoduje przesunięcie punktów kontrolnych do ich parametrycznych położeń na powierzchni. Interpolacja odwrotna tworzy punkt na powierzchni dla każdego oryginalnego punktu kontrolnego i przesuwa ten punkt kontrolny do odpowiadającego punktu powierzchni.
reverse: Kierunek interpolacji: do przodu, jeśli Fałsz, w przeciwnym razie odwrotny
Returns: Interpolowana bryła T-splajn w danym kierunku
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Skopiuj wybrane powierzchnie do nowej powierzchni. Nowa powierzchnia nie ma symetrii
faces: Powierzchnie do powielenia
Returns: Powierzchnia T-splajn tylko z wybranymi powierzchniami
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Przesuń podane wierzchołki wzdłuż danego wektora
vertices: Lista wierzchołków do przesunięcia
vector: Kierunek przesuwania
onSurface: Znacznik wskazujący, czy używać powierzchni czy punktów sterujących wierzchołków

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSS(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface},System.String)
Eksportuj dany zbiór powierzchni T-splajn do pliku sceny T-splajn
tSplineSurfaces: Zestaw powierzchni T-splajn do wyeksportowania
filePath: Ścieżka pliku do zapisu
Returns: Ścieżka pliku, gdzie zapisano zestaw T-splajn
tspline,export,save,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface,System.String)
Eksportuj daną powierzchnię T-splajn do pliku siatki T-splajn
tSplineSurface: Powierzchnia bryły T-splajn do wyeksportowania
filePath: Ścieżka pliku do zapisu
Returns: Ścieżka pliku, gdzie zapisano powierzchnię T-splajn
tspline,export,save,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
Zapis powierzchni T-splajn w ciągu w formacie siatki T-splajn.
tSplineSurface: Powierzchnia T-splajn do szeregowania
Returns: Ciąg, w którym powierzchnia T-splajn jest szeregowana
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
Utwórz powierzchnię T-splajn z ciągu w formacie siatki T-splajn.
content: Reprezentacja pliku siatki T-splajn w postaci ciągu
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Nowo wczytana powierzchnia T-splajn na liście
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
Wczytaj powierzchnię T-splajn z danego pliku siatki T-splajn
filePath: Ścieżka do wczytania pliku
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Nowo wczytana powierzchnia T-splajn na liście
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.IO.FileInfo,System.Boolean)
Wczytaj powierzchnię T-splajn z danego pliku siatki T-splajn
file: Wczytaj z pliku
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Nowo wczytana powierzchnia T-splajn na liście
tspline,import,load,tsm,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
Wczytaj zestaw powierzchni T-splajn z danego pliku sceny T-splajn
filePath: Ścieżka do wczytania pliku
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Zestaw nowo wczytanych powierzchni T-splajn
tspline,import,load,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.IO.FileInfo,System.Boolean)
Wczytaj zestaw powierzchni T-splajn z danego pliku sceny T-splajn
file: Wczytaj z pliku
inSmoothMode: Pokaż powierzchnię T-splajn w wizualizacji gładkiej lub trybie ramki
Returns: Zestaw nowo wczytanych powierzchni T-splajn
tspline,import,load,tss,file