Autodesk.DesignScript.Geometry.Cuboid.ToString
Pobierz reprezentację ciągu znaków prostopadłościanu

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(System.Double,System.Double,System.Double)
Utwórz prostopadłościan wyśrodkowany na początku GUW, z określoną szerokością, długością i wysokością.
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Utwórz prostopadłościan wyśrodkowany w punkcie wejściowym, z określoną szerokością, długością i wysokością.
origin: Origin point
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Utwórz prostopadłościan wyśrodkowany na początku GUW, z określoną szerokością, długością i wysokością.
coordinateSystem: Nadrzędny układ współrzędnych (środek prostopadłościanu)
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created from lengths
box,cube,cubebysize,bycoord,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Utwórz prostopadłościan łączący punkt niski z punktem wysokim.
lowPoint: Corner low point of cuboid
highPoint: Corner high point of cuboid
Returns: Cuboind created by corners
box,cube,byminmax,by corners,by points,cubes

Autodesk.DesignScript.Geometry.Cuboid.Length
Zwraca odległość długości.                         Uwaga: zwraca wymiary wejściowe prostopadłościanu, a NIE                    rzeczywiste wymiary przestrzeni globalnej. Innymi słowy, jeśli tworzysz prostopadłościan                    o szerokości (oś X) i długości 10 i przekształcasz go na CoordinateSystem z                   dwukrotnym skalowaniem w X, szerokość nadal będzie wynosiła 10. ASM nie pozwala                   na wyodrębnianie wierzchołków bryły w dowolnej przewidzianej kolejności, więc                     nie można określić wymiarów po przekształceniu.

Autodesk.DesignScript.Geometry.Cuboid.Width
Zwraca odległość szerokości.                         Uwaga: zwraca wymiary wejściowe prostopadłościanu, a NIE                    rzeczywiste wymiary przestrzeni globalnej. Innymi słowy, jeśli tworzysz prostopadłościan                    o szerokości (oś X) i długości 10 i przekształcasz go na CoordinateSystem z                   dwukrotnym skalowaniem w X, szerokość nadal będzie wynosiła 10. ASM nie pozwala                    na wyodrębnianie wierzchołków bryły w dowolnej przewidzianej kolejności, więc                     nie można określić wymiarów po przekształceniu.

Autodesk.DesignScript.Geometry.Cuboid.Height
Zwraca odległość wysokości.                         Uwaga: zwraca wymiary wejściowe prostopadłościanu, a NIE                    rzeczywiste wymiary przestrzeni globalnej. Innymi słowy, jeśli tworzysz prostopadłościan                    o szerokości (oś X) i długości 10 i przekształcasz go na CoordinateSystem z                   dwukrotnym skalowaniem w X, szerokość nadal będzie wynosiła 10. ASM nie pozwala                   na wyodrębnianie wierzchołków bryły w dowolnej przewidzianej kolejności, więc                     nie można określić wymiarów po przekształceniu.