Autodesk.DesignScript.Geometry.Face.ToString
Pobierz reprezentację ciągu znaków boku

Autodesk.DesignScript.Geometry.Face.SurfaceGeometry
Oryginalna powierzchnia tworząca tę powierzchnię
Returns: Surface representation of face