Autodesk.DesignScript.Geometry.Point.ToString
Pobierz reprezentację ciągu znaków punktu

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Porównaj dwa punkty
other: Drugi punkt
Returns: Czy oba obiekty są równe

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
Pobierz wartość skrótu dla tego typu
Returns: Unikalna wartość skrótu dla tego obiektu

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
Utwórz punkt na płaszczyźnie XY na podstawie 2 współrzędnych kartezjańskich. Składowa Z wynosi 0.
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
Pobierz punkt początku (0,0,0)
Returns: Origin point
zero,origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
Utwórz punkt na podstawie 3 współrzędnych kartezjańskich
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Utwórz punkt w podanym układzie współrzędnych z 3 współrzędnymi kartezjańskimi
coordinateSystem: Nadrzędny układ współrzędnych
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
Przytnij punkty, aby wykluczyć obiekty powielone w granicach tolerancji zawartych punktów
points: Lista punktów, od których należy przyciąć powielenia
tolerance: Tolerancja stosowana podczas przycinania
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near