Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,System.Boolean,Autodesk.DesignScript.Geometry.Geometry})
Mechanizm rejestracji typu geometrii.
hostType: Typ interfejsów wywodzących się z IGeometryEntity.
contructor: Funkcja delegata do budowy geometrii.

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
Przekształć geometrię w danym kierunku o długość wektora
move,along vector

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Przekształca dowolny typ geometrii o podaną odległość w podanym
kierunku.
direction: Kierunek przemieszczenia.
distance: Odległość przesunięcia wzdłuż podanego kierunku.
Returns: Przekształcona geometria.
move,along vector,distance

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Przekształca geometrię za pomocą podanego przekształcenia układu współrzędnych
Returns: Przekształcona geometria

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Przekształca tę geometrię ze źródłowego CoordinateSystem na
CoordinateSystem nowego kontekstu.
Returns: Przekształcona geometria.
from,to

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Obraca obiekt wokół początku i normalnej płaszczyzny o określony
stopień
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
Skaluj niejednorodnie wokół początku
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Skaluj niejednorodnie wokół danej płaszczyzny
resize,size,scalenu,scaleNU

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Skaluj jednorodnie wokół danego punktu, używając dwóch punktów wewnętrznych jako skalarów
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Skaluj w jednym wymiarze przez punkt bazowy i 2 punkty wewnętrzne. Oś skali definiuje linia między punktem bazowym a punktem „od”.
resize,size,from,to,scale1d,1d,lines
0.5,0.5,0.5,0.5,0.5,0.5,0.3

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Skaluj w dwóch wymiarach przez punkt bazowy i 2 punkty wewnętrzne. Te dwa punkty wewnętrzne są rzutowane na płaszczyznę bazową w celu określenia współczynników skali 2D
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
Wyznacz odległość od tej geometrii do innej
other: Druga geometria
Returns: Odległość
between,length,from,to

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
Wyznacz najbliższy punkt na tej geometrii do drugiej
NearestPoint, GetClosestPoint

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
Określ, czy inny obiekt geometrii przecina się z tym
intersects?,check intersection,test intersection

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
Pobierz geometrię z przecięciem dla tego obiektu i innego
get overlap

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Pobierz przecięcie geometrii dla tego obiektu i kolekcji innych geometrii. Znajduje wspólną geometrię dla wszystkich elementów uczestniczących.
get overlap,multi intersect,intersect many

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
Podziel tę geometrię, używając innej geometrii jako "narzędzia" do cięcia
cut

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
Sprawdź, czy oba obiekty mają taką samą geometrię reprezentacyjną lub wartości numeryczne
approximate,near,close

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
Pobierz BoundingBox zawierającą dany element geometrii
bounds

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
Przekształć geometrię w ciąg JSON definicji bryły
Returns: Ciąg w formacie JSON

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
Importuje plik SAT i zwraca tablicę importowanych geometrii
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
Importuje plik SAT i zwraca zestaw importowanych geometrii
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String)
Eksportuje określoną geometrię do podanej ścieżki do pliku SAT
filePath: Nazwa pliku, do którego zostanie wyeksportowana geometria

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.String,System.Double)
Eksportuje określoną geometrię do podanej ścieżki do pliku SAT
filePath: Nazwa pliku, do którego zostanie wyeksportowana geometria
unitsMM: Stosowane jednostki

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String,System.Double)
Eksportuje listę określonej geometrii do podanej ścieżki do pliku SAT

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB
Zaszeregowuje określoną geometrię do formatu Standard ACIS Binary (SAB) i zwraca zaszeregowane dane strumienia binarnego

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Zaszeregowuje listę określonej geometrii do formatu Standard ACIS Binary (SAB) i zwraca zaszeregowane dane strumienia binarnego
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
Pobierz układ współrzędnych kontekstu/odniesienia, który został użyty do utworzenia tej geometrii.