Autodesk.DesignScript.Geometry.NurbsSurface.ToString
Pobierz reprezentację ciągu znaków powierzchni NURBS

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Tworzy NurbsSurface z określonymi punktami interpolowanymi oraz stopniami U i V. Powstała powierzchnia będzie przechodzić przez wszystkie z tych punktów.
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Tworzy NurbsSurface z określonymi punktami interpolowanymi oraz stopniami U i V. Powstała powierzchnia będzie przechodzić przez wszystkie z tych punktów. Liczba stycznych musi odpowiadać liczbie punktów w odpowiednim kierunku. Powstała powierzchnia będzie stopnia 3 zarówno w kierunku U jak i V.
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Tworzy NurbsSurface spełniającą szereg różnych właściwości powierzchni. Jest to najbardziej zaawansowana metoda dopasowania powierzchni. Powstała powierzchnia będzie przechodzić przez wszystkie punkty. Liczba stycznych musi odpowiadać liczbie punktów w odpowiednim kierunku. Powstała powierzchnia będzie stopnia 3 zarówno w kierunku U jak i V. Pochodne wierzchołka powinny być drugiego rzędu (dP/dUdV) i powinny być dostarczane w następującej kolejności: [ lowU, lowV ], [ highU, lowV ], [ lowU, highV ], [ highU, highV ].
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Utwórz NurbsSurface, używając określonych punktów sterujących, z określonymi stopniami U i V.
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
Tworzy NurbsSurface z określonymi wierzchołkami sterującymi, węzłami, szerokością oraz stopniami U i V. Istnieje szereg ograniczeń dotyczących danych, które, jeśli są uszkodzone, spowodują, że funkcja zakończy się niepowodzeniem i zostanie wygenerowany wyjątek. Stopień: zarówno stopień u jak i v powinny być >= 1 (piecewise-liniowy splajn) i mniejsze niż 26 (maksymalny stopień podstawy B-splajn obsługiwany przez ASM). Szerokość: wszystkie wartości szerokości (jeśli podane) powinny być wyłącznie dodatnie. Szerokości mniejsze niż 1e-11 będą odrzucane, a działanie funkcji nie powiedzie się. Węzły: obydwa wektory węzłowe powinny występować w sekwencjach niemalejących. Mnogość węzła wewnętrznego nie powinna być większa niż stopień + 1 na węźle początkowym/końcowym i stopień na węźle wewnętrznym (umożliwia to przedstawienie powierzchni z nieciągłościami G1). Należy zwrócić uwagę, że niezamknięte wektory węzłowe są obsługiwane, ale zostaną przekształcone na zamknięte, a w danych dotyczących punktów sterujących/szerokości wprowadzone zostaną stosowne zmiany.
lines
0.4

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
Zwraca wagi punktów sterujących NurbsSurface. Wagi określą wpływ wywierany przez każdy z punktów sterujących na kształt powierzchni.
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
Zwraca węzły powierzchni w kierunku U. Węzły to seria wartości parametrów (typu double) służących do określenia, gdzie i jak punkty kontrolne wpływają na powierzchnię.
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
Zwraca węzły powierzchni w kierunku V. Węzły to seria wartości parametrów (typu double) służących do określenia, gdzie i jak punkty kontrolne wpływają na powierzchnię.
Returns: Nurbs V knots of surface