Autodesk.DesignScript.Geometry.PolySurface.ToString
Pobierz reprezentację ciągu znaków PolySurface

Autodesk.DesignScript.Geometry.PolySurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Utwórz polipowierzchnię przez przeciągnięcie krzywej wzdłuż toru.
rail: Krzywa do przeciągnięcia wzdłuż
profile: Przeciągnięcie profilu
sweep,rail,guide,sweep1,sweepprofile,profile

Autodesk.DesignScript.Geometry.PolySurface.LocateSurfacesByPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Zlokalizuj powierzchnie według punktu. Pobiera pierwszy punkt przecięcia w kierunku do przodu. Zwraca jedną powierzchnię, jeśli naciśniesz powierzchnię wewnętrzną, dwie, jeśli krawędź wewnętrzną, lub wiele, jeśli wierzchołek.
surfacesatpoint,findsurfaces,extractsurfaces

Autodesk.DesignScript.Geometry.PolySurface.SurfaceCount
Zwraca liczbę powierzchni krzywej PolyCurve.
Returns: Number of surfaces

Autodesk.DesignScript.Geometry.PolySurface.EdgeCount
Zwraca liczbę krawędzi krzywej PolyCurve.
Returns: Number of edges

Autodesk.DesignScript.Geometry.PolySurface.VertexCount
Zwraca liczbę wierzchołków krzywej PolyCurve.
Returns: Number of vertices