Autodesk.DesignScript.Geometry.UV.ToString
Pobierz reprezentację ciągu znaków UV

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
Porównaj dwa UV
other: Inne UV
Returns: Czy oba obiekty są równe

Autodesk.DesignScript.Geometry.UV.GetHashCode
Pobierz wartość skrótu dla tego typu
Returns: Unikalna wartość skrótu dla tego obiektu

Autodesk.DesignScript.Geometry.UV.ByCoordinates(System.Double,System.Double)
Utwórz UV z dwóch wartości podwojonych.
u: U value
v: V value
Returns: UV created by coordinates
surfaceparam,parameters,uv,uvs