Autodesk.DesignScript.Geometry.Vector.ToString
Pobierz reprezentację ciągu znaków wektora

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Porównaj dwa wektory
other: Drugi wektor
Returns: Czy oba obiekty są równe

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
Pobierz wartość skrótu dla tego typu
Returns: Unikalna wartość skrótu dla tego obiektu

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Utwórz wektor z 3 współrzędnych przestrzeni euklidesowej
x: Współrzędna X
y: Współrzędna Y
z: Współrzędna Z
Returns: Vector created by coordinates
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Utwórz wektor z 3 współrzędnych przestrzeni euklidesowej i normalizuj wektor
x: Współrzędna X
y: Współrzędna Y
z: Współrzędna Z
normalized: Wartość prawda (True), aby wektor wynikowy został znormalizowany. W przeciwnym razie — fałsz (False)
Returns: Vector created by coordinates
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Utwórz wektor z dwóch punktów końcowych. Powstanie wektor od punktu początkowego do punktu końcowego.
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
Pobierz kanoniczny wektor osi X (1,0,0)
x,basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
Pobierz kanoniczny wektor osi Y (0,1,0)
y,basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
Pobierz kanoniczny wektor osi Z (0,0,1)
z,basis,up

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Utwórz iloczyn skalarny dwóch wektorów
vec: a second vector
Returns: Resulting dot product
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Określ, czy dwa wektory są równoległe, czy nie.
otherVector: Inny wektor
Returns: Returns True if the vectors are parallel; false otherwise.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Określ, czy dwa wektory są prawie równe. Wartość tolerancji 1e-5 podano w celu rozwiązywania problemów z dokładnością.
otherVector: Inny wektor
Returns: Returns True if the vectors are almost equal; false otherwise.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Przekształć ten wektor przez wejściowy model CoordinateSystem.
coordinateSystem: Układ współrzędnych służący do przekształcenia wektora
Returns: Transformed vector

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Obraca wektor wokół osi o określoną liczbę stopni
axis: Rotation axis vector
degrees: Number of degrees to rotate
Returns: Rotated vector
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Obraca wektor wokół początku i normalnej płaszczyzny o określony stopień
plane: Płaszczyzna obrotu
degrees: Number of degrees to rotate
Returns: Rotated vector
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Skaluj wektor jednolicie wokół początku
scale_factor: Scale factor
Returns: Scaled vector
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
Zwraca wartość kąta między dwoma wektorami, w zakresie od 0 do 180 stopni.
otherVector: Other vector
Returns: Returns angle between the supplied vectors in degrees from 0 to 180.
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector)
Zwraca wartość kąta między dwoma wektorami, w zakresie [0, 180] stopni.
rotation angle

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Zwraca wartość kąta między dwoma wektorami w zakresie od 0 do 360 stopni. Kierunek kąta jest określany na podstawie osi obrotu.
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleBetween(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Zwraca wartość kąta między dwoma wektorami, w zakresie [0, 360] stopni. Używa on oś obrotu, aby określić kierunek kąta.
rotation angle