Autodesk.DesignScript.Geometry.Edge.ToString
Pobierz reprezentację ciągu znaków krawędzi

Autodesk.DesignScript.Geometry.Edge.CurveGeometry
Oryginalna krzywa tworząca krawędź

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
Powierzchnie przylegające do tej krawędzi

Autodesk.DesignScript.Geometry.Edge.StartVertex
Wierzchołek, przy którym zaczyna się ta krawędź

Autodesk.DesignScript.Geometry.Edge.EndVertex
Wierzchołek, przy którym kończy się ta krawędź