Autodesk.DesignScript.Geometry.Rectangle.ToString
Pobierz reprezentację ciągu znaków prostokąta

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Utwórz prostokąt z czterech punktów narożnych.
points: List of corner points of rectangle
Returns: Rectangle created by corner points
rectbypointarray

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Utwórz prostokąt z czterech punktów narożnych.
p1: 1st corner point of rectangle
p2: 2nd corner point of rectangle
p3: 3rd corner point of rectangle
p4: 4th corner point of rectangle
Returns: Rectangle created by corner points
rectbypoints

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Utwórz prostokąt ze środkiem w początku GUW w płaszczyźnie XY GUW, o określonej szerokości (długość osi X) i długości (długość osi Y).
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Utwórz prostokąt ze środkiem w głównym punkcie na płaszczyźnie wejściowej, o szerokości wejściowej (długość osi X) i długości (długość osi Y).
plane: Plane used to center rectangle
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Utwórz prostokąt ze środkiem w początku wejściowym w płaszczyźnie XY CoordinateSystem, o określonej szerokości (długość osi X) i długości (długość osi Y).
coordinateSystem: Układ współrzędnych prostokąta (środek prostokąta)
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created from width and length
rectbylengths