Autodesk.DesignScript.Geometry.Cylinder.ToString
Pobierz reprezentację ciągu znaków walca

Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Utwórz walec bryłowy określony przez nadrzędny CoordinateSystem, promień i wysokość walca
coordinateSystem: Nadrzędny układ współrzędnych
radius: Radius size
height: Cylinder height
Returns: Cylinder created from radius and height
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Utwórz walec bryłowy o podanym górnym i dolnym punkcie środkowym walca.
startPoint: Start point of cylinder
endPoint: End point of cylinder
radius: Radius  of cylinder
Returns: Cylinder created by points and radius
cylinder,tube,by center points