Autodesk.DesignScript.Geometry.PolyCurve.ToString
Pobierz reprezentację ciągu znaków PolyCurve

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Utwórz PolyCurve przez połączenie krzywych. Odwraca krzywą, aby utworzyć połączenie. Wybierz preferowaną tolerancję połączenia z zakresu od 1e-6 do 1e-3 jednostek.
curves: Krzywe do połączenia w PolyCurve
joinTolerance: Tolerancja do określenia rozmiaru odstępu dozwolonego między krzywymi do połączenia
Returns: PolyCurve utworzona przez połączone krzywe
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Utwórz PolyCurve, łącząc punkty. Aby zamknąć PolyCurve, parametr „connectLastToFirst” musi mieć wartość True.
points: Punkty, aby utworzyć PolyCurve
connectLastToFirst: Wartość prawda (True), aby połączyć ostatni punkt z pierwszym punktem, wartość fałsz (False), aby pozostawić figurę otwartą
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.Curves
Zwraca krzywe polycurve
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
Zwraca krzywą polycurve według indeksu
index: Długość do zlokalizowania punktu
endOrStart: Wartość prawda (True), aby liczyć od końca PolyCurve, wartość fałsz (False), aby liczyć od początku PolyCurve
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
Wydłuża polycurve o łuk styczny
length: Długość łuku pomocniczego
radius: Promień łuku
endOrStart: wydłużenie końca lub początku PolyCurve

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
Odsuń polycurve w jej płaszczyźnie.
signedDistance: Wartość odsunięcia
extendCircular: Przełącz, aby zaokrąglić rogi
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Zaokrąglij polycurve w jej płaszczyźnie.
radius: Promień zaokrąglenia
rightSide: Wartość prawda (True), aby umieścić zaokrąglenie po prawej stronie względem początku PolyCurve, wartość fałsz (False), aby umieścić je po lewej stronie
Returns: Filleted polyCurve
round,smooth,radius