Autodesk.DesignScript.Geometry.Properties.Resources.LowerModelerExtentExceeded
Wyszukuje zlokalizowany ciąg podobny do: Wybrane wartości są spoza dozwolonego zakresu modelowania; rozważ wybranie ustawiania {0} z zakresem modelowania między {1} a {2} w oknie dialogowym Ustawienia => Zakres roboczy geometrii.

Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
Wyszukuje zlokalizowany ciąg podobny do: Przekroczono dozwolone zakresy modelowania, rozważ wybranie mniejszych wartości.

Autodesk.DesignScript.Geometry.Properties.Resources.UpperModelerExtentExceeded
Wyszukuje zlokalizowany ciąg podobny do: Wybrane wartości są spoza dozwolonego zakresu modelowania; rozważ wybranie ustawiania {0} z zakresem modelowania między {1} a {2} w oknie dialogowym Ustawienia => Zakres roboczy geometrii.