Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
Pobierz reprezentację ciągu znaków TSplineReflection

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
Utwórz odbicie promieniowe dla symetrii bryły T-splajn względem danej płaszczyzny z daną liczbą segmentów i danym kątem (w stopniach) między każdą parą segmentów.
plane: Płaszczyzna, która normalnie jest osią odbicia promieniowego T-splajn. Podana we współrzędnych globalnych
segmentsCount: Liczba segmentów odbicia promieniowego
segmentAngle: Kąt między każdą parą segmentów linii symetrii radialnej (w stopniach). Jeśli ustawiono wartość 0, jest definiowany przez (360 / segmentsCount)
Returns: Odbicie promieniowe T-splajn
tspline,symmetry,reflection,radial