Autodesk.DesignScript.Geometry.Curve.ToString
Pobierz reprezentację ciągu znaków krzywej

Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
Utwórz krzywą przez linię powierzchni w przestrzeni uv
baseSurface: Powierzchnia do wykorzystania
startParams: Początkowy UV, gdzie rozpocznie się łuk
endParams: Końcowe UV, w którym nastąpi koniec krzywej
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Utwórz krzywą, która łączy się między dwoma łukami
curve1: Pierwsza krzywa do połączenia
curve2: Druga krzywa do połączenia
endOrStart1: znacznik, aby wskazać koniec krzywej1 do połączenia
endOrStart2: znacznik, aby wskazać koniec krzywej1 do połączenia
isG2Continuous: flaga wskazująca, czy krzywa wynikowa jest ciągłością G1 lub G2
Returns: Krzywa wynikowa połączenia dwóch krzywych
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
Utwórz krzywą przez izolinię powierzchni
baseSurface: Powierzchnia bazowa
direction: jeśli 0, izolinia jest ustawiona w kierunku U,  jeśli 1 - wzdłuż kierunku V
parameter: ustalone dla wartości krzywej innych parametrów powierzchni
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
Pobierz CoordinateSystem z początkiem w punkcie dla danego parametru. Oś X jest wyrównana z normalną krzywej, oś Y jest wyrównana ze styczną krzywej w tym punkcie, a oś Z jest wyrównana z wektorem do góry lub binormalną w tym punkcie
param: Parametr, gdzie nastąpi ocena
Returns: Układ współrzędnych w parametrze krzywej
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
Zwraca płaszczyznę, której normalna jest wyrównana ze styczną krzywej. Parametry są dostosowywane, tak że 0 jest zawsze punktem początkowym, a 1 punktem końcowym.
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtDistance(System.Double)
Pobierz punkt o określonej długości łuku wzdłuż krzywej
segmentLength: Odległość wzdłuż krzywej, do której oceniać
Returns: Punkt w podanej długości łuku
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
Zwraca punkty rozmieszczone równomiernie wzdłuż długości krzywej na podstawie wejściowych liczby podziałów
divisions: Liczba podziałów
Returns: Punkty rozmieszczone równomiernie wzdłuż długości krzywej

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
Zwraca punkty w równych odstępach wzdłuż długości krzywej według równych długości cięciwy na podstawie wejściowych liczby podziałów
divisions: Liczba podziałów
Returns: Lista punktów na krzywej

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Zwraca punkty rozmieszczone równomiernie wzdłuż krzywej w danej długości segmentu i od podanego punktu
point: Punkt odniesienia, od którego mierzyć
segmentLength: Odległość wzdłuż krzywej, od której oceniać
Returns: Lista punktów na krzywej

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Zwraca punkty w równych odstępach na krzywej o danej długości cięciwy, poczynając od podanego punktu
point: Punkt odniesienia, od którego mierzyć
chordLength: Długość cięciwy
Returns: Lista punktów na krzywej

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
Zwraca CoordinateSystem o określonej odległości od punktu początkowego krzywej. Oś Y leży styczna do krzywej, a oś X jest krzywizną.
segmentLength: Odległość wzdłuż krzywej, na której oceniać
Returns: Układ współrzędnych na krzywej
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtDistance(System.Double)
Zwraca układ współrzędnych w określonej odległości od punktu początkowego krzywej. Oś Y jest styczna do krzywej, a oś X jest krzywizną.
segmentLength: Odległość wzdłuż krzywej, do której oceniać
Returns: Układ współrzędnych na krzywej
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
Zwraca płaszczyznę o określonej odległości wzdłuż krzywej od punktu początkowego. Normalna płaszczyzny jest wyrównana ze styczną krzywej.
segmentLength: Odległość wzdłuż krzywej, na której ocenia​ć
Returns: Płaszczyzna na krzywej
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PlaneAtDistance(System.Double)
Zwraca płaszczyznę w określonej odległości wzdłuż krzywej od punktu początkowego. Normalna płaszczyzny jest wyrównana ze styczną krzywej.
segmentLength: Odległość wzdłuż krzywej, do której oceniać
Returns: Płaszczyzna na krzywej
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.DistanceAtParameter(System.Double)
Pobierz długość segmentu mierzoną od punktu początkowego krzywej do danego parametru.
param: Wartość między 0 a 1
Returns: Długość segmentu
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtDistance(System.Double)
Pobierz parametr z określonej długości łuku wzdłuż krzywej.
segmentLength: Odległość wzdłuż krzywej, do której oceniać
Returns: Parametr
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.LengthBetweenParameters(System.Double,System.Double)
Pobierz długość łuku między dwoma punktami parametrów na krzywej
startParam: Początek domeny
endParam: Koniec domeny
Returns: Długość łuku między dwoma parametrami
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Pobierz parametr w określonym punkcie wzdłuż krzywej. Jeśli punkt nie leży na krzywej, zostanie pobrany najbliższy parametr. Jeśli krzywą wejściową jest PolyCurve, ta funkcja zwróci poprawny parametr tylko w przypadku, gdy punkt leży na krzywej PolyCurve. W przypadku innych typów krzywych funkcja zwróci parametr wzdłuż krzywej leżącej najbliżej punktu wejściowego.
point: Punkt na krzywej lub blisko krzywej
Returns: Parametr na krzywej w przypadku krzywych PolyCurve lub najbliższy parametr wzdłuż krzywej w przypadku innych typów krzywych.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.DivideEqually(System.Int32)
Dzieli krzywą na daną liczbę krzywych równej długości
divisions: Liczba podziałów
Returns: Szyk krzywych po podzieleniu
chopcurve,segment,slices

Autodesk.DesignScript.Geometry.Curve.DivideByDistance(System.Int32)
Dzieli krzywą na daną liczbę krzywych o równych odległościach od początku i końca każdej krzywej (równe cięciwy).
divisions: Liczba podziałów
Returns: Szyk krzywych po podzieleniu
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByLengthFromParameter(System.Double,System.Double)
Dzieli krzywą na krzywe o podanej długości mierzone od podanego parametru położenia
length: Długość krzywych po podziale
parameter: Położenie parametru dla pomiaru z
Returns: Szyk krzywych po podzieleniu
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.DivideByDistanceFromParameter(System.Double,System.Double)
Dzieli krzywą na krzywe o podanej długości cięciwy, mierzone od podanego położenia parametru
distance: Długość cięciwy dla każdej krzywej uzyskanej z podziału
parameter: Położenie parametru dla pomiaru z
Returns: Szyk krzywych po podzieleniu
divide by chordlength,chord,segment,chopcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimStart(System.Double)
Usuwa początek krzywej dla określonego parametru
startParameter: Parametr, od którego chcesz rozpocząć cięcie
Returns: Nowa krzywa z usuniętym początkiem
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimEnd(System.Double)
Usuwa koniec krzywej od określonego parametru
endParameter: Parametr, od którego chcesz rozpocząć cięcie
Returns: Nowa krzywa z usuniętym początkiem
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrim(System.Double,System.Double)
Usuwa początek i koniec krzywej według określonych parametrów.
startParameter: Parametr, od którego chcesz rozpocząć cięcie
endParameter: Parametr, od którego chcesz rozpocząć cięcie
Returns: Nowa krzywa z usuniętymi segmentami zewnętrznymi
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.ParameterTrimInterior(System.Double,System.Double)
Usuwa wewnętrzny fragment krzywej dla określonych parametrów
startParameter: Parametr, od którego chcesz rozpocząć cięcie
endParameter: Parametr, w którym chcesz rozpocząć Utnij
Returns: Nowa krzywa z usuniętym segmentem wewnętrznym
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.ParameterTrimSegments(System.Double[])
Usuwa kilka segmentów krzywej, pomijając segmenty 1, 3, 5...
parameters: Listę Parametry, w którym chcesz podzielić krzywą
Returns: Szyk krzywych, pomijając segmenty 1, 3, 5...
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
Usuwa kilka segmentów krzywej, pomijając segmenty 2, 4, 6..., jeśli wartość logiczna to prawda (True)
parameters: Lista parametrów, przy których krzywa zostanie podzielona
discardEvenSegments: Przełącz, aby odrzucić segmenty parzyste
Returns: Szyk krzywych z pominięciem segmentów 2, 4, 6... , jeśli wartość logiczna to Prawda
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double)
Podziel krzywą na dwie części dla danego parametru
parameter: Parametr, gdzie nastąpi podział
Returns: Dwie krzywe pozostałe po podziale
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double)
Podziel krzywą na dwie części według danego parametru
parameter: Parametr, w którym chcesz wykonać podział
Returns: Dwie krzywe pozostałe po podziale
cutinto,divide,curve2curves,cut

Autodesk.DesignScript.Geometry.Curve.ParameterSplit(System.Double[])
Podziel krzywą na wiele części dla podanych parametrów
parameters: Lista parametrów, w którym chcesz podzielić krzywą
Returns: Krzywe pozostałe po podziale
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Połącz zestaw krzywych z końcem PolyCurve. Odwraca krzywe w celu zapewnienia połączenia.
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany

Autodesk.DesignScript.Geometry.Curve.Join(Autodesk.DesignScript.Geometry.Curve)
Połącz tę krzywą i krzywą wejściową w nową PolyCurve, dokładnie zachowując formę oryginalnych krzywych.
curve: Krzywa do dołączenia
Returns: PolyCurve składająca się z dwóch łuków
convertcurve,curve2polycurve,joincurve,concat

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
Wydłuż krzywą na określoną odległość od określonego końca określonego przez punkt wewnętrzny. Wskazana strona zostanie wydłużona. Zamkniętych krzywych, takich jak okręgi czy elipsy, nie można wydłużyć.
distance: Odległość wydłużenia
pickSide: Punkt na końcu do wydłużenia
Returns: Rozszerzona krzywa
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
Wydłuż krzywą o daną odległość na jej stronie początkowej. Zamkniętych krzywych, takich jak okręgi czy elipsy, nie można wydłużyć.
distance: Odległość wydłużenia
Returns: Rozszerzona krzywa
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
Wydłuż krzywą na określoną odległość na jej końcu. Zamkniętych krzywych, takich jak okręgi czy elipsy, nie można wydłużyć.
distance: Odległość wydłużenia
Returns: Rozszerzona krzywa
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.Patch
Zaślep zamkniętą krzywą
Returns: Powierzchnia po wewnętrznej stronie łuku
fill,profiletosurf,loop,loop2surf,edgesurf

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Rzutuje krzywą wejściową wzdłuż danego kierunku rzutowania na określoną geometrię bazową. Geometria do rzutowania na listę wektorów geometrii rzutowanych na geometrię bazową