Autodesk.DesignScript.Geometry.Surface.ToString
Pobierz reprezentację ciągu znaków powierzchni

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Połącz kolekcję powierzchni w jedną powierzchnię. Ta metoda może zwrócić obiekt polySurface, jeśli wynikowe połączenie będzie nierozgałęzione lub wielopowierzchniowe.
surfaces: Kolekcja powierzchni.
Returns: Suma powierzchni
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Utwórz powierzchnię poprzez wyciągnięcie między wejściowymi krzywymi przekroju poprzecznego.
crossSections: Curves to loft through
Returns: Surface created by loft
loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
Utwórz powierzchnię poprzez wyciągnięcie między wejściowymi liniami przekroju poprzecznego. Jest to nieco szybszy proces i powstałe obiekty cechują się mniejszą gładkością niż w przypadku Surface.ByLoft.
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Wyciągnij powierzchnię przez przekroje poprzeczne z określoną krzywą prowadzącą (inaczej tor). Krzywa prowadząca musi przecinać wszystkie krzywe przekroju.
loftbyrail

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Wyciągnij powierzchnię przez przekroje poprzeczne z określonymi krzywymi prowadzącymi (inaczej tory). Krzywe prowadzące muszą przecinać wszystkie krzywe przekroju.
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Utwórz powierzchnię poprzez przeciągnięcie krzywej przekroju poprzecznego wzdłuż ścieżki.
profile: Curve to sweep
path: Path curve used to sweep along
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Utwórz powierzchnię wieloboku, łącząc punkty wejściowe w zamkniętym wieloboku i zamykając wielobok.
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Przeciągnij krzywą przekroju poprzecznego wzdłuż ścieżki prowadzonej przez dwa tory
path: Dane wejściowe ścieżki do przeciągnięcia wzdłuż ścieżki.
guideRail: Prowadnica definiująca orientację przeciągnięcia wzdłuż ścieżki.
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Utwórz powierzchnię poprzez przeciągnięcie krzywej profilu wokół półprostej osi utworzonej przez punkt początkowy w kierunku wektora osi, rozpoczynając od start_angle w stopniach, przeciągając sweep_angle w stopniach.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Utwórz powierzchnię poprzez wypełnienie wnętrza zamkniętej obwiedni określonej przez wejściowe krzywe.
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Różnica logiczna tej powierzchni i połączenia powierzchni wejściowych. Ta metoda może zwrócić obiekt polySurface, jeśli wynikowa wartość logiczna będzie nierozgałęziona lub wielopowierzchniowa.
others: Inne powierzchnie do odjęcia
Returns: Wynikowa powierzchnia logiczna lub PolySurface
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Przytnij powierzchnię za pomocą kolekcji jednej lub więcej pętli wewnątrz powierzchni wejściowej. Jedna z pętli musi być pętlą obwiedni powierzchni wejściowej. Ponadto należy dodać jedną lub więcej z pętli wewnętrznych dla otworów.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
Zwróć normalną powierzchni w punkcie wejściowym na powierzchni.
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
Pobiera reprezentację NURBS powierzchni. Ta metoda może w pewnych okolicznościach przybliżyć powierzchnię.

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Pobiera reprezentację NURBS powierzchni w określonych granicach tolerancji. Ta metoda może w pewnych okolicznościach przybliżyć powierzchnię.
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Pogrub powierzchnię w bryłę, wyciągając w kierunku normalnych powierzchni po obu stronach powierzchni.
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Pogrub powierzchnię w bryłę, wyciągając w kierunku normalnych powierzchni. Jeśli parametr both_sides ma wartość prawda, powierzchnia zostaje pogrubiona po obu stronach.
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
Odsuń powierzchnię w kierunku normalnej powierzchni o określoną odległość.
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
Zwrócony układ współrzędnych używa xAxis, yAxis i zAxis do przedstawienia uDir, vDir i normalnej. Długość xAxis, yAxis reprezentuje krzywizny.
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
Zwróć CoordinateSystem wyrównany z kierunkami krzywizn głównych.
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
Zwróć wektor styczny U dla określonych parametrów U i V.
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
Zwróć wektor styczny V dla określonych parametrów U i V.
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
Zwróć wektor normalny dla określonych parametrów U i V.
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
Zwróć pochodne dla współrzędnych wejściowych U i V.
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
Zwraca wektory kierunku głównego dla parametrów U i V.
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
Utwórz krzywą linii parametru na danej powierzchni. Utwórz krzywą reprezentującą linię parametru u lub v na powierzchni. Linia parametru przebiega w kierunku wzrastającego parametru u lub v przy stałym przeciwległym parametrze u lub v. Powstała krzywa będzie pasowała do parametryzacji powierzchni, a jej zakres będzie ograniczony przez zakres parametrów powierzchni. Typ zwróconej krzywej będzie zależał od typu powierzchni.
isoDirection: Jeśli kierunek == 0, tworzy linię parametru U, jeśli kierunek == 1, tworzy linię parametru V.
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Zwraca nową powierzchnię z odwróconą normalną. Pozostawia powierzchnię bez zmian.
Returns: Surface, which is the same as the input surface but with flipped normals

Autodesk.DesignScript.Geometry.Surface.Join(Autodesk.DesignScript.Geometry.Surface)
Łączy tę powierzchnię i powierzchnię wejściową w PolySurface
topolysurface

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Łączy tę powierzchnię i powierzchnie wejściowe w PolySurface
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Rzutuje geometrię wejściową na tę powierzchnię, w kierunku wektora wejściowego. !!Ta metoda rzutowania obsługuje obecnie tylko punkty lub krzywe!!
projecttosurface,projectonto