Autodesk.DesignScript.Geometry.NurbsCurve.ToString
Pobierz reprezentację ciągu znaków krzywej NURBS

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Utwórz BSplineCurve, używając dokładnie określonych punktów sterujących. UWAGA 1: BSplineCurves z deg=1 zawierają nieciągłości G1, które mogą powodować problemy z wyciąganiem, przeciąganiem i innymi operacjami. Należy ich unikać i używać zamiast nich PolyCurve. UWAGA 2: jeśli krzywa jest okresowa (zamknięta), to pierwszy i ostatni punkt MUSZĄ być takie same.
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Utwórz BSplineCurve, używając dokładnie określonych punktów sterujących. UWAGA 1: BSplineCurves z deg=1 zawierają nieciągłości G1, które mogą powodować problemy z wyciąganiem, przeciąganiem i innymi operacjami. Należy ich unikać i używać zamiast nich PolyCurve. UWAGA 2: jeśli krzywa jest okresowa (zamknięta), to pierwszy i ostatni punkt MUSZĄ być takie same.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Utwórz BSplineCurve, używając dokładnie określonych punktów sterujących. UWAGA 1: BSplineCurves z deg=1 zawierają nieciągłości G1, które mogą powodować problemy z wyciąganiem, przeciąganiem i innymi operacjami. Należy ich unikać i używać zamiast nich PolyCurve. UWAGA 2: jeśli krzywa jest okresowa (zamknięta), to pierwszy i ostatni punkt MUSZĄ być takie same.
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
Utwórz BSplineCurve z wierzchołków sterujących, szerokości i węzłów. Z ASM DOCS: Stopień: powinien być większy niż 1 (piecewise-liniowy splajn) i mniejszy niż 26 (maksymalny stopień bazowy B-splajn obsługiwany przez ASM). Szerokość: wszystkie wartości szerokości (jeśli podane) powinny być wyłącznie dodatnie. Szerokości mniejsze niż 1e-11 będą odrzucane, a działanie funkcji nie powiedzie się. Węzły: Wektor węzłowy powinien występować w sekwencji niemalejącej. Mnogość węzła wewnętrznego nie powinna być większa niż stopień + 1 na węźle początkowym/końcowym i stopień na węźle wewnętrznym (umożliwia to przedstawienie krzywych z nieciągłościami G1). Należy zwrócić uwagę, że niezamknięte wektory węzłowe są obsługiwane, ale zostaną przekształcone na zamknięte, a w danych dotyczących punktów sterujących/szerokości wprowadzone zostaną stosowne zmiany. szyk węzłów: rozmiar węzła musi być num_control_points + stopień + 1
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Utwórz BSplineCurve poprzez interpolację między punktami.
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Utwórz BSplineCurve poprzez interpolację między punktami. UWAGA 2: jeśli krzywa jest okresowa (zamknięta), to pierwszy i ostatni punkt MUSZĄ być takie same.
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Utwórz BSplineCurve poprzez interpolację między punktami o określonym stopniu.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Zwraca BSplineCurve przez punkty, z kierunkami stycznych.
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
Pobierz punkty sterujące NurbsCurve. Są to punkty interpolowane przez krzywą.
Returns: Szyk punktów

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
Węzły krzywej. Węzły to seria wartości parametrów (typu double) służących do określenia, gdzie i jak punkty sterujące wpływają na krzywą.
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
Zwraca wagi punktów sterujących NurbsCurve. Wagi określają wpływ każdego z punktów sterujących na kształt krzywej.
Returns: Weights of nurbs curve
ptweight