Autodesk.DesignScript.Geometry.Helix.ToString
Pobierz reprezentację ciągu znaków helisy

Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Utwórz spiralę. Spirala zawsze obraca się w kierunku zgodnym z ruchem wskazówek zegara o podany kierunek osi. Patrząc wzdłuż kierunku osi, można zobaczyć punkt obracający się w kierunku zgodnym z ruchem wskazówek zegara wokół osi, kiedy porusza się wzdłuż krzywej w kierunku wzrastającego parametru. Nachylenie to odległość, na jaką przesuwa się spirala w kierunku osi na obrót. Wartość ta może być dodatnia lub ujemna.
axisPoint: Axis point
axisDirection: Axis direction vector
startPoint: Helix start point
pitch: Distance of the helix per each 360 degrees in the direction of the axis
angleTurns: How many turns in degrees
Returns: Helix created by axis
helix,screw,corkscrew,thread