Autodesk.DesignScript.Geometry.Cone.ToString
Pobierz reprezentację ciągu znaków stożka

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Utwórz stożek o podanym promieniu bazowym w punkcie początkowym, wydłużając go do wierzchołka w punkcie końcowym.
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Utwórz stożek z osią od punktu początkowego do punktu końcowego, o określonych promieniach na początku i końcu. Ten obiekt nie ma wierzchołka i może być traktowany jako przycięty stożek.
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Tworzy stożek z punktem bazowym na początku CoordinateSystem, wydłużając go w kierunku osi Z CoordinateSystem, z okrągłą podstawą w płaszczyźnie XY CoordinateSystem.

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Tworzy stożek z punktem bazowym na początku CoordinateSystem, wydłużając go w kierunku osi Z CoordinateSystem, z okrągłymi podstawami w płaszczyźnie XY CoordinateSystem.
cone,cone by height,cones