Autodesk.DesignScript.Geometry.EllipseArc.ToString
Pobierz reprezentację ciągu znaków łuku elipsy

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Utwórz EllipseArc w płaszczyźnie z podanym promieniami wzdłuż osi X i Y oraz kątami, przez które zostanie przeciągnięta
plane: Płaszczyzna, na której znajduje się łuk elipsy
xRadius: Promień EllipseArc w kierunku X płaszczyzny
yRadius: Promień EllipseArc w kierunku Y płaszczyzny
startAngle: Kąt początkowy łuku mierzony od dodatniej osi X płaszczyzny wejściowej
sweepAngle: Kąt dla przeciągnięcia od kąta początkowego w stopniach
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiStartAngleSweepAngle(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Utwórz EllipseArc w płaszczyźnie z podanym promieniami wzdłuż osi X i Y oraz kąty do przeciągnięcia przez
plane: Płaszczyzna EllipseArc jest zawarta w
xRadius: Promień EllipseArc w kierunku X płaszczyzny
yRadius: Promień EllipseArc w kierunku Y płaszczyzny
startAngle: Kąt początkowy łuku, mierzoną od dodatniej osi X płaszczyzny wejściowej
sweepAngle: Kąt do przeciągnięcia od kąta początkowego w stopniach
ellipsearc,arcs