Autodesk.DesignScript.Geometry.Solid.ToString
Pobierz reprezentację ciągu znaków bryły

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},Autodesk.DesignScript.Geometry.Curve)
Utwórz bryłę poprzez wyciągnięcie między wejściowymi krzywymi zamkniętymi przekroju poprzecznego z krzywą prowadzącą jako pomoc. Krzywa prowadząca musi przecinać wszystkie krzywe przekroju.
Brep,brep,guide,loft

Autodesk.DesignScript.Geometry.Solid.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Utwórz bryłę poprzez wyciągnięcie między wejściowymi krzywymi zamkniętymi przekroju poprzecznego z krzywymi prowadzącymi jako pomoc. Krzywe prowadzące muszą przecinać wszystkie krzywe przekroju.
Brep,brep,guides,loft

Autodesk.DesignScript.Geometry.Solid.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Boolean)
Utwórz bryłę poprzez wyciągnięcie między wejściowymi przekrojami składającymi się z zamkniętych krzywych PolyCurve. Ta operacja jest zoptymalizowana pod kątem przekrojów składających się wyłącznie z segmentów linii, w przypadku których wierzchołki są w tej samej kolejności. Opcja sprawdzania i naprawy, jeśli jest włączona, gwarantuje poprawność utworzonej bryły. Jej wyłączenie powinno zwiększyć wydajność.
Brep,brep,ruled,loft

Autodesk.DesignScript.Geometry.Solid.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Przeciągnij krzywą zamkniętą profilu wzdłuż dwóch krzywych toru.
path: Dane wejściowe ścieżki do przeciągnięcia wzdłuż ścieżki.
guideRail: Prowadnica definiująca orientację przeciągnięcia wzdłuż ścieżki.
profile: The profile curve to sweep along the path
Brep,brep,sweep2,guides,sweepprofile

Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Utwórz bryłę obrotu, przeciągając krzywą profilu wokół półprostej osi utworzonej przez początek i wektor osi, od kąta początkowego w stopniach do kąta przeciągnięcia w stopniach.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Solid created by revolve
Brep,brep,lathe,revolveprofile

Autodesk.DesignScript.Geometry.Solid.UnionAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Solid})
Łączy listę brył z tą bryłą.
addition,merge,combine,unionmany,union multi

Autodesk.DesignScript.Geometry.Solid.Difference(Autodesk.DesignScript.Geometry.Solid)
Operacja różnicy logicznej tej i innej bryły

Autodesk.DesignScript.Geometry.Solid.ThinShell(System.Double,System.Double)
Uzyskaj powłokę bryły z powierzchni tej bryły
internalFaceThickness: Odległość do wydłużenia skorupy do wewnątrz
externalFaceThickness: Odległość do wydłużenia skorupy na zewnątrz
extract shell,offset and extract

Autodesk.DesignScript.Geometry.Solid.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Rzutuje geometrię wejściową na tę bryłę, w kierunku wektora wejściowego. !!Ta metoda rzutowania obsługuje obecnie tylko punkty lub krzywe!!
projectonto,projectonsolid,projecttosolid

Autodesk.DesignScript.Geometry.Solid.Separate
Dzieli bryłę na pojedyncze bryły, jeśli składa się ona z więcej niż jednej odłączonej bryły. Jeśli jest to pojedyncza ciągła bryła, zwraca tę samą bryłę.
Returns: oddzielne rozłączne bryły
split,disjoint