Autodesk.DesignScript.Geometry.Arc.ToString
Pobierz reprezentację ciągu znaków łuku

Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Utwórz łuk, który jest najbardziej zbliżony do kolekcji punktów
points: Lista punktów, dla których należy znaleźć najlepsze dopasowanie łuku
Returns: Arc created by best fit through points
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Utwórz łuk lub styczny łuk podwójny przez punkty początkowe i końcowe oraz styczności na początku i na końcu
point1: Punkt dla początku łuku podwójnego
vector1: Wektor styczny dla początku łuku podwójnego
point2: Punkt dla końca łuku podwójnego
vector2: Wektor styczny dla końca łuku podwójnego
arc,tangent

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Utwórz łuk od punktu początkowego do punktu końcowego z początkiem stycznym do wektora
startPoint: Start point of arc
endPoint: End point of arc
startTangent: Start tangent direction vector
arc,tangent,arcs