Autodesk.DesignScript.Geometry.IndexGroup.ToString
Pobierz reprezentację ciągu znaków IndexGroup

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
Porównaj dwie IndexGroup
other: Inne IndexGroup
Returns: Czy oba obiekty są równe

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
Pobierz wartość skrótu dla tego typu
Returns: Unikalna wartość skrótu dla tego obiektu

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
Utwórz IndexGroup zawierającą cztery indeksy
a: Index a
b: Index b
c: Index c
d: Index d
Returns: IndexGroup
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Utwórz trzy IndexGroup zawierającą trzy indeksy
a: Index a
b: Index b
c: Index c
Returns: IndexGroup
tri,polygon,mesh,meshes