Autodesk.DesignScript.Geometry.BoundingBox.ToString
Uzyskaj reprezentację ciągu znaków ramki ograniczającej

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Porównaj dwa BoundingBox
other: Inny BoundingBox
Returns: Czy oba obiekty są równe

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
Pobierz wartość skrótu dla tego typu
Returns: Unikalna wartość skrótu dla tego obiektu

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(Autodesk.DesignScript.Geometry.Geometry)
Utwórz BoundingBox o wyrównanej osi wokół geometrii wejściowej.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Utwórz BoundingBox o wyrównanej osi wokół geometrii wejściowych.
geom: Geometries to determine bounding box
Returns: Bounding box enclosing geometries
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
Utwórz BoundingBox o niewyrównanej osi wokół geometrii wejściowej, zorientowaną na osie X, Y i Z CoordinateSystem.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
Utwórz BoundingBox o niewyrównanej osi wokół geometrii wejściowych, zorientowaną na osie X, Y i Z CoordinateSystem.
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
Tworzy BoundingBox od współrzędnych minimalnych (dolny, lewy, tylni narożnik sześcianu) do maksymalnych (górny, prawy, przedni narożnik sześcianu). CoordinateSystem jest przekształceniem Z obszaru współrzędnych ramki NA obszar modelu. Ta metoda jest tak zaprojektowana, by pasowała do interfejsu API programu Revit', dzięki czemu można wyodrębnić parametry z BoundingBox programu Revit bez konieczności konwersji.
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
CoordinateSystem, w którym zdefiniowana jest ta BoundingBox

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Pobierz punkt przecięcia dwóch BoundingBoxes
other: Other bounding box to intersect
Returns: Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Określ, czy dwie BoundingBoxes przecinają się
other: Other bounding box
Returns: Do bounding boxes intersect
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
Określ, czy BoundingBox jest pusta
Returns: Returns true if the bounding box is empty