Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Tworzy NurbsSurface z określonymi punktami interpolowanymi oraz stopniami U i V. Powstała powierzchnia będzie przechodzić przez wszystkie z tych punktów.
points: Siatka punktów dla powierzchni nurbs
uDegree: Stopnie w kierunku U
vDegree: Stopnie w kierunku V
Returns: Powierzchnia nurbs utworzona na podstawie punktów
fit,topoints