Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Utwórz prostopadłościan wyśrodkowany w punkcie wejściowym, z określoną szerokością, długością i wysokością.
origin: Punkt początkowy
width: Szerokość prostopadłościanu
length: Długość prostopadłościanu
height: Wysokość prostopadłościanu
Returns: Prostopadłościan utworzony na podstawie długości
box,cube,cubebysize,bycenter,cubes