Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Utwórz łuk od punktu początkowego do punktu końcowego z początkiem stycznym do wektora
startPoint: Punkt początkowy łuku
endPoint: Punkt końcowy łuku
startTangent: Wektor kierunku stycznej początkowej
arc,tangent,arcs