Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Utwórz trzy IndexGroup zawierającą trzy indeksy
a: Indeks a
b: Indeks b
c: Indeks c
Returns: IndexGroup
tri,polygon,mesh,meshes