Autodesk.DesignScript.Geometry.Properties.Resources.OutsideAllowableModelingRange
Wyszukuje zlokalizowany ciąg podobny do: Wybrane wartości są spoza dozwolonego zakresu modelowania; rozważ wybranie ustawienia {0} z zakresem modelowania między {1} a {2} w oknie dialogowym „Preferencje => Ogólne => Skalowanie geometrii”.