Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Tworzy okrąg ze środkiem i promieniem wejściowym w płaszczyźnie globalnej XY, ze współrzędną globalną Z jako normalną.
centerPoint: Punkt środkowy okręgu
radius: Promień
Returns: Okrąg utworzony na podstawie punktu środkowego i promienia
circle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
Utwórz okrąg ze środkiem w początku płaszczyzny wejściowej (głównym), leżącym w płaszczyźnie wejściowej, o podanym promieniu.
plane: Główny punkt płaszczyzny do wyśrodkowania okręgu
radius: Promień
Returns: Okrąg utworzony na podstawie płaszczyzny i promienia
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Utwórz okrąg przechodzący przez trzy punkty.
p1: 1. punkt okręgu
p2: 2. punkt okręgu
p3: 3. punkt okręgu
circle