Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Utwórz jedną lub więcej krzywych PolyCurve przez zgrupowanie połączonych krzywych. Wybierz preferowaną tolerancję łączenia między 1e-6 a 1e-3 jednostek.
curves: Krzywe do zgrupowania w celu utworzenia jednej lub wielu krzywych PolyCurve
joinTolerance: Tolerancja do określenia rozmiaru odstępu dozwolonego między krzywymi do połączenia

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Zaokrąglij polycurve w jej płaszczyźnie.
radius: Promień zaokrąglenia
rightSide: Wartość prawda (True), aby umieścić zaokrąglenie po prawej stronie względem początku PolyCurve, wartość fałsz (False), aby umieścić je po lewej stronie
Returns: Zaokrąglona PolyCurve
round,smooth,radius