Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Utwórz prostokąt ze środkiem w początku GUW w płaszczyźnie XY GUW, o określonej szerokości (długość osi X) i długości (długość osi Y).
width: Szerokość prostokąta
length: Długość prostokąta
Returns: Prostokąt utworzony na podstawie szerokości i długości
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Utwórz prostokąt ze środkiem w głównym punkcie na płaszczyźnie wejściowej, o szerokości wejściowej (długość osi X) i długości (długość osi Y).
plane: Płaszczyzna służąca do wyśrodkowania prostokąta
width: Szerokość prostokąta
length: Długość prostokąta
Returns: Prostokąt utworzony na podstawie szerokości i długości
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Utwórz prostokąt ze środkiem w początku wejściowym w płaszczyźnie XY CoordinateSystem, o określonej szerokości (długość osi X) i długości (długość osi Y).
coordinateSystem: Układ współrzędnych prostokąta (środek prostokąta)
width: Szerokość prostokąta
length: Długość prostokąta
Returns: Prostokąt utworzony z szerokości i długości
rectbylengths