Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Utwórz elipsę ze środkiem w punkcie wejściowym, wyrównaną z płaszczyzną XY GUW, o określonych promieniach osi X i Y.
origin: Punkt początkowy elipsy
xAxisRadius: Promień osi X
yAxisRadius: Promień osi Y
Returns: Elipsa utworzona na podstawie początku i promienia
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Utwórz elipsę ze środkiem w punkcie wejściowym, z dwoma określonymi osiami. Osie powinny być skierowane względem siebie pod kątem 90 stopni.
origin: Punkt początkowy elipsy
xAxisRadius: Promień osi X
yAxisRadius: Promień osi Y
Returns: Elipsa utworzona z wektorów początku
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Utwórz elipsę wyśrodkowaną na i wyrównaną z wejściowym CoordinateSystem, o promieniu x_radius w kierunku X UW promieniu y_radius w kierunku Y UW.
origin: Układ współrzędnych początku elipsy
xAxisRadius: Promień osi X
yAxisRadius: Promień osi Y
Returns: Elipsa utworzona na podstawie układu współrzędnych i promieni
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Utwórz elipsę wyśrodkowaną na i wyrównaną z płaszczyzną wejściową, o promieniu x_radius w kierunku osi X płaszczyzny i promieniu y_radius w kierunku osi Y płaszczyzny.
plane: Płaszczyzna, na której rysowany jest łuk elipsy
xAxisRadius: Promień osi X
yAxisRadius: Promień osi Y
Returns: Elipsa utworzona z płaszczyzny i promieni
ellipse,aligned ellipse,ellipsebylengths