Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Utwórz BSplineCurve, używając dokładnie określonych punktów sterujących. UWAGA 1: BSplineCurves z deg=1 zawierają nieciągłości G1, które mogą powodować problemy z wyciąganiem, przeciąganiem i innymi operacjami. Należy ich unikać i używać zamiast nich PolyCurve. UWAGA 2: jeśli krzywa jest okresowa (zamknięta), to pierwszy i ostatni punkt MUSZĄ być takie same.
points: Punkty dla krzywej nurbs
Returns: Krzywa nurbs utworzona z punktów
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Utwórz BSplineCurve, używając dokładnie określonych punktów sterujących. UWAGA 1: BSplineCurves z deg=1 zawierają nieciągłości G1, które mogą powodować problemy z wyciąganiem, przeciąganiem i innymi operacjami. Należy ich unikać i używać zamiast nich PolyCurve. UWAGA 2: jeśli krzywa jest okresowa (zamknięta), to pierwszy i ostatni punkt MUSZĄ być takie same.
points: Punkty dla krzywej nurbs
degree: Stopień krzywej
Returns: Krzywa nurbs utworzona z punktów
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Utwórz BSplineCurve, używając dokładnie określonych punktów sterujących. UWAGA 1: BSplineCurves z deg=1 zawierają nieciągłości G1, które mogą powodować problemy z wyciąganiem, przeciąganiem i innymi operacjami. Należy ich unikać i używać zamiast nich PolyCurve. UWAGA 2: jeśli krzywa jest okresowa (zamknięta), to pierwszy i ostatni punkt MUSZĄ być takie same.
points: Punkty dla krzywej nurbs
degree: Stopień krzywej
closeCurve: Przełącz na krzywą zamkniętą
Returns: Krzywa nurbs utworzona z punktów
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Utwórz BSplineCurve poprzez interpolację między punktami. UWAGA 2: jeśli krzywa jest okresowa (zamknięta), to pierwszy i ostatni punkt MUSZĄ być takie same.
points: Punkty dla krzywej nurbs
closeCurve: Przełącz na krzywą zamkniętą
Returns: Krzywa nurbs utworzona z punktów
fit,approximate,spline,lines
0.5,0.5,0.5,0.45