Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Utwórz płaszczyznę „zorientowaną”, położoną w punkcie początkowym z wektorem normalnym, ale z określoną orientacją osi X. Nie ma to wpływu na operacje dzielenia, przecinania, rzutowania, itp., określa jedynie orientację wejściowego układu współrzędnych.
origin: Punkt początkowy płaszczyzny
normal: Wektor kierunku normalnej
xAxis: Wektor kierunku osi X
Returns: Płaszczyzna utworzona na podstawie normalnej początku i osi x

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Utwórz płaszczyznę zawierającą linię wejściową i punkt zewnętrzny. Punkt nie może leżeć na linii ani na osi linii.
line: Linia służąca do określenia płaszczyzny
point: Punkt służący do określenia płaszczyzny
Returns: Płaszczyzna utworzona na podstawie linii i punktu
lines
0.4