Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Utwórz bryłę obrotu, przeciągając krzywą profilu wokół półprostej osi utworzonej przez początek i wektor osi, od kąta początkowego w stopniach do kąta przeciągnięcia w stopniach.
profile: Krzywa profilu do obrócenia
axisOrigin: Początek osi obracającej się
axisDirection: Kierunek osi obracającej się
startAngle: Kąt początkowy w stopniach
sweepAngle: Kąt przeciągnięcia w stopniach
Returns: Bryła utworzona przez obrót
Brep,brep,lathe,revolveprofile