Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Utwórz powierzchnię poprzez wyciągnięcie między wejściowymi krzywymi przekroju poprzecznego.
crossSections: Krzywe do wyciągnięcia złożonego
Returns: Powierzchnia utworzona przez wyciągnięcie złożone
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Wyciągnij powierzchnię przez przekroje poprzeczne z określonymi krzywymi prowadzącymi (inaczej tory). Krzywe prowadzące muszą przecinać wszystkie krzywe przekroju.
crossSections: Krzywe do wyciągnięcia złożonego
guideCurves: Krzywe prowadzące wyciągnięcie złożone
Returns: Powierzchnia utworzona przez wyciągnięcie złożone
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Utwórz powierzchnię wieloboku, łącząc punkty wejściowe w zamkniętym wieloboku i zamykając wielobok.
points: Lista punktów obwodu
Returns: Powierzchnia utworzona z punktów obwodu
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Utwórz powierzchnię poprzez przeciągnięcie krzywej profilu wokół półprostej osi utworzonej przez punkt początkowy w kierunku wektora osi, rozpoczynając od start_angle w stopniach, przeciągając sweep_angle w stopniach.
profile: Krzywa profilu do obrócenia
axisOrigin: Początek osi obracającej się
axisDirection: Kierunek osi obracającej się
startAngle: Kąt początkowy w stopniach
sweepAngle: Kąt przeciągnięcia w stopniach
Returns: Powierzchnia utworzona przez obrót profilu
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Utwórz powierzchnię poprzez wypełnienie wnętrza zamkniętej obwiedni określonej przez wejściowe krzywe.
closedCurve: Krzywa zamknięta służąca jako obwiednia powierzchni
Returns: Powierzchnia utworzona przez zamknięcie
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Pobiera reprezentację NURBS powierzchni w określonych granicach tolerancji. Ta metoda może w pewnych okolicznościach przybliżyć powierzchnię.
tolerance: Określona tolerancja
Returns: Reprezentacja powierzchni w postaci powierzchni nurbs
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Pogrub powierzchnię w bryłę, wyciągając w kierunku normalnych powierzchni po obu stronach powierzchni.
thickness: Wartość do pogrubienia
Returns: Powierzchnia pogrubiona jako bryła
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Pogrub powierzchnię w bryłę, wyciągając w kierunku normalnych powierzchni. Jeśli parametr both_sides ma wartość prawda, powierzchnia zostaje pogrubiona po obu stronach.
thickness: Wartość do pogrubienia
both_sides: Prawda (true) w celu pogrubienia po obu stronach, fałsz (false) w celu pogrubienia po jednej stronie
Returns: Powierzchnia pogrubiona jako bryła
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
Zwrócony układ współrzędnych używa xAxis, yAxis i zAxis do przedstawienia uDir, vDir i normalnej. Długość xAxis, yAxis reprezentuje krzywizny.
u: Komponent U parametru
v: Komponent V parametru
Returns: Układ współrzędnych oparty na normalnej, kierunku U i kierunku V w położeniu UV na powierzchni

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Zwraca nową powierzchnię z odwróconą normalną. Pozostawia powierzchnię bez zmian.
Returns: Powierzchnia taka sama jak powierzchnia wejściowa, ale z odwróconymi normalnymi