Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Tworzy linię styczną do krzywej wejściowej, umieszczonej w punkcie parametru krzywej wejściowej.
curve: Krzywa bazowa dla linii stycznej
parameter: Wartość parametru
Returns: Linia styczna
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Utwórz linię prostą, zaczynając od punktu początkowego, wydłużając w kierunku wektora o określoną długość.
startPoint: Punkt początkowy linii
direction: Wektor kierunkowy
length: Długość linii
Returns: Linia utworzona na podstawie kierunku początkowego i długości
linebyvector,lines