Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Przekształć powierzchnię bryły T-splajn w bryłę lub powierzchnię w zależności od kształtu.
Uwaga: mogą wystąpić subtelne nieoczekiwane zmiany w wynikowej B-Rep, jeśli powierzchnię wejściową utworzono w wersji T-splinów wyższej niż wersja załadowana w dodatku Dynamo, ponieważ w tym przypadku wersja kopii powierzchni zostanie obniżona do wersji dodatku Dynamo i wykorzystana w konwersji.
matchTopology: Określa, czy powstała bryła powinna mieć tę samą topologię co powierzchnia wejściowa T-splajn.
Returns: Element topologii (bryła lub powierzchnia)
tspline,brep,solid,surface