Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Utwórz wektor z 3 współrzędnych przestrzeni euklidesowej
x: Współrzędna X
y: Współrzędna Y
z: Współrzędna Z
Returns: Wektor utworzony na podstawie współrzędnych
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Utwórz wektor z 3 współrzędnych przestrzeni euklidesowej i normalizuj wektor
x: Współrzędna X
y: Współrzędna Y
z: Współrzędna Z
normalized: Wartość prawda (True), aby wektor wynikowy został znormalizowany. W przeciwnym razie — fałsz (False)
Returns: Wektor utworzony na podstawie współrzędnych
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Utwórz iloczyn skalarny dwóch wektorów
vec: drugi wektor
Returns: Wynikowy iloczyn skalarny
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Określ, czy dwa wektory są równoległe, czy nie.
otherVector: Inny wektor
Returns: Zwraca wartość prawda (true), jeśli wektory są równoległe; w przeciwnym razie zwraca wartość fałsz (false).

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Określ, czy dwa wektory są prawie równe. Wartość tolerancji 1e-5 podano w celu rozwiązywania problemów z dokładnością.
otherVector: Inny wektor
Returns: Zwraca wartość prawda (true), jeśli wektory są prawie równe; w przeciwnym razie zwraca wartość fałsz (false).
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Przekształć ten wektor przez wejściowy model CoordinateSystem.
coordinateSystem: Układ współrzędnych służący do przekształcenia wektora
Returns: Przekształcony wektor

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Obraca wektor wokół osi o określoną liczbę stopni
axis: Wektor osi obrotu
degrees: Liczba stopni obrotu
Returns: Obrócony wektor
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Obraca wektor wokół początku i normalnej płaszczyzny o określony stopień
plane: Płaszczyzna obrotu
degrees: Liczba stopni obrotu
Returns: Obrócony wektor
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Skaluj wektor jednolicie wokół początku
scale_factor: Współczynnik skali
Returns: Przeskalowany wektor
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Zwraca wartość kąta między dwoma wektorami w zakresie od 0 do 360 stopni. Kierunek kąta jest określany na podstawie osi obrotu.
otherVector: Inny wektor
rotationAxis: Oś obrotu
Returns: Zwraca kąt między podanymi wektorami w stopniach od 0 do 360.
rotation angle,