Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Utwórz spiralę. Spirala zawsze obraca się w kierunku zgodnym z ruchem wskazówek zegara o podany kierunek osi. Patrząc wzdłuż kierunku osi, można zobaczyć punkt obracający się w kierunku zgodnym z ruchem wskazówek zegara wokół osi, kiedy porusza się wzdłuż krzywej w kierunku wzrastającego parametru. Nachylenie to odległość, na jaką przesuwa się spirala w kierunku osi na obrót. Wartość ta może być dodatnia lub ujemna.
axisPoint: Punkt osi
axisDirection: Wektor kierunku osi
startPoint: Punkt początkowy helisy
pitch: Odległość helisy na każde 360 stopni w kierunku osi
angleTurns: Liczba obrotów w stopniach
Returns: Helisa utworzona na podstawie osi
helix,screw,corkscrew,thread