Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Pobierz punkt przecięcia dwóch BoundingBoxes
other: Inna ramka ograniczająca do przecięcia
Returns: Ramka ograniczająca uzyskana z przecięcia się ramek ograniczających

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Określ, czy dwie BoundingBoxes przecinają się
other: Inna ramka ograniczająca
Returns: Czy ramki ograniczające się przecinają
get overlap