Autodesk.DesignScript.Geometry.Helix.ByAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Créer une hélice. L'hélice pivote toujours dans le sens horaire autour de la direction d'axe spécifiée. Si elle est affichée le long de l'axe de direction, l'utilisateur voit le point pivoter dans le sens horaire autour de l'axe à mesure qu'il se déplace le long de la courbe dans la direction du paramètre croissant. L'inclinaison est la distance de déplacement de l'hélice dans la direction de l'axe par tour. La valeur peut être positive ou négative.
axisPoint: Point d'axe
axisDirection: Vecteur de direction de l'axe
startPoint: Point de départ de l'hélice
pitch: Distance de l'hélice par tranche de 360 degrés dans la direction de l'axe
angleTurns: Nombre de tours en degrés
Returns: Hélice créée par axe
helix,screw,corkscrew,thread