Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Obtenir l'intersection de deux BoundingBoxes
other: Autre zone de délimitation à entrecouper
Returns: Zone de délimitation obtenue à partir de l'intersection de zones de délimitation

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Déterminer si deux BoundingBoxes s'entrecoupent
other: Autre zone de délimitation
Returns: Les zones de délimitation s'entrecoupent-elle?
get overlap