Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Former un vecteur à l'aide de 3 coordonnées euclidiennes
x: Coordonnée X
y: Coordonnée Y
z: Coordonnée Z
Returns: Vecteur créé par coordonnées
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Former un vecteur à l'aide de 3 coordonnées euclidiennes et normaliser le vecteur
x: Coordonnée X
y: Coordonnée Y
z: Coordonnée Z
normalized: True pour normaliser le vecteur, False pour ne pas normaliser
Returns: Vecteur créé par coordonnées
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Former le produit scalaire de deux vecteurs
vec: un second vecteur
Returns: Produit scalaire obtenu
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Déterminez si deux vecteurs sont parallèles.
otherVector: Autre vecteur
Returns: Renvoie true si les vecteurs sont parallèles; false dans le cas contraire.

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Déterminez si deux vecteurs sont presque égaux. Une valeur de tolérance de 1e-5 est donnée pour gérer les problèmes de précision.
otherVector: Autre vecteur
Returns: Renvoie true si les vecteurs sont presque égaux; false dans le cas contraire.
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transformer ce vecteur selon la matrice CoordinateSystem d'entrée.
coordinateSystem: Système de coordonnées utilisé pour transformer le vecteur
Returns: Vecteur transformé

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Fait pivoter un vecteur autour d'un axe selon un nombre de degrés spécifié
axis: Vecteur de l'axe de rotation
degrees: Nombre de degrés de rotation
Returns: Vecteur pivoté
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Fait pivoter un vecteur autour de l'origine et de la normale du plan selon un degré spécifié
plane: Plan de rotation
degrees: Nombre de degrés de rotation
Returns: Vecteur pivoté
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Mettre à l'échelle le vecteur uniformément autour de l'origine
scale_factor: Facteur d'échelle
Returns: Vecteur mis à l'échelle
resize,size

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Renvoie l'angle entre les deux vecteurs en degrés, de 0 à 360. Utilise l'axe de rotation pour déterminer la direction de l'angle.
otherVector: Autre vecteur
rotationAxis: Axe de rotation
Returns: Renvoie l'angle entre les vecteurs fournis en degrés de 0 à 360
rotation angle,