Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Crée un arc à partir du point de début jusqu'au point de fin avec le début tangent au vecteur
startPoint: Point de départ de l'arc
endPoint: Point de fin de l'arc
startTangent: Vecteur de direction de la tangente de départ
arc,tangent,arcs