Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Crée une NurbsSurface avec des points interpolés et des degrés U et V spécifiés. La surface obtenue passe par tous les points.
points: Grille de points pour une surface NURBS
uDegree: Degré dans la direction U
vDegree: Degré dans la direction V
Returns: Surface NURBS créée par des points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
Renvoie des noeuds de surface dans la direction U. Les noeuds sont une série de valeurs de paramètres (doubles) servant à déterminer où et comment les points de contrôle affectent la surface.
Returns: Nœuds U NURBS de la surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
Renvoie des noeuds de surface dans la direction V. Les noeuds sont une série de valeurs de paramètres (doubles) servant à déterminer où et comment les points de contrôle affectent la surface.
Returns: Nœuds V NURBS de la surface