Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Convertir la surface T-Spline en solide ou en surface en fonction de la forme
Remarque: Quelques légers changements inattendus sont susceptibles de se produire dans la B-Rep de sortie si la surface d'entrée a été créée dans une version de T-Spline supérieure à celle qui a été chargée dans Dynamo. Dans ce cas, en effet, une copie de la surface sera créée dans la version utilisée par Dynamo et utilisée pour la conversion.
matchTopology: Détermine si le corps généré doit présenter la même topologie que la surface T-Spline d'entrée.
Returns: Entité de topologie (solide ou surface)
tspline,brep,solid,surface