Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Créer un IndexGroup stockant trois index
a: Index a
b: Index b
c: Index c
Returns: GroupeIndex
tri,polygon,mesh,meshes