Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Créer une ligne tangente à la Curve d'entrée, située sur le point paramétrique de la Curve d'entrée.
curve: Courbe de base pour la ligne tangente
parameter: Valeur du paramètre
Returns: Ligne tangente
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Créer une ligne droite partant du point de début, s'étendant dans la direction du vecteur en fonction de la longueur spécifiée.
startPoint: Point de départ de la ligne
direction: Vecteur de direction
length: Longueur de la ligne
Returns: Ligne à partir de la direction de départ et de la longueur
linebyvector,lines