Autodesk.DesignScript.Geometry.Properties.Resources.OutsideAllowableModelingRange
Recherche une chaîne localisée semblable à Vos entrées sont hors de l'intervalle de modélisation autorisé. Choisissez le paramètre {0} avec un intervalle de modélisation compris entre {1} et {2} dans la boîte de dialogue "Préférences => Général => Mise à l'échelle de la géométrie".