Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Créer un Cuboid centré au point d'entrée, en fonction de la largeur, de la longueur et de la hauteur spécifiées.
origin: Point d'origine
width: Largeur du cuboïde
length: Longueur du cuboïde
height: Hauteur du cuboïde
Returns: Cuboïde créé par des longueurs
box,cube,cubebysize,bycenter,cubes