Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Créer un rectangle centré au niveau de l'origine du SCG dans le plan XY du SCG, avec la largeur (longueur de l'axe X) et la longueur (longueur de l'axe Y) spécifiées.
width: Largeur du rectangle
length: Longueur du rectangle
Returns: Rectangle créé par la largeur et la longueur
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Créer un rectangle centré au niveau de la racine du plan d'entrée, avec la largeur d'entrée (longueur de l'axe X du plan) et la longueur d'entrée (longueur de l'axe Y du plan).
plane: Plan utilisé pour centrer le rectangle
width: Largeur du rectangle
length: Longueur du rectangle
Returns: Rectangle créé par la largeur et la longueur
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Créer un rectangle centré au niveau de l'origine d'entrée dans le plan XY du CoordinateSystem, avec la largeur (longueur de l'axe X) et la longueur (longueur de l'axe Y) spécifiées.
coordinateSystem: Système de coordonnées du rectangle (centre du rectangle)
width: Largeur du rectangle
length: Longueur du rectangle
Returns: Rectangle créé à partir de la largeur et de la longueur
rectbylengths