Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Créer une surface par lissage entre les Curves de profil de coupe d'entrée.
crossSections: Courbes de lissage
Returns: Surface créée par lissage
loft

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Lisser une surface au travers des profils de coupe avec des courbes de guidage indiquées (également appelées "rails"). Les courbes de guidage doivent entrecouper toutes les courbes de profil de coupe.
crossSections: Courbes de lissage
guideCurves: Courbes pour guider le lissage
Returns: Surface créée par lissage
loftbyrails,loft rails,guides

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Créer une surface en balayant une Curve de profil de coupe le long d'une trajectoire.
profile: Courbe de balayage
path: Courbe de la trajectoire utilisée pour le balayage le long de
Returns: Surface créée par balayage du profil le long de la trajectoire
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Créer une surface de polygone en reliant les points d'entrée dans un polygone fermé et en corrigeant celui-ci.
points: Liste des points du périmètre
Returns: Surface créée à partir de points de périmètre
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Créer une surface par balayage de la Curve de profil autour du rayon de l'axe formé par le point d'origine dans la direction du vecteur d'axe. L'angle initial en degrés est start_angle, et le balayage est appliqué à l'angle sweep_angle en degrés.
profile: Courbe de contour à faire pivoter
axisOrigin: Origine de l'axe de révolution
axisDirection: Direction de l'axe de révolution
startAngle: Angle de départ en degrés
sweepAngle: Angle de balayage en degrés
Returns: Surface créée par un profil de révolution
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Créer une surface en remplissant l'intérieur d'un contour fermé défini par les Curves d'entrée.
closedCurve: Courbe fermée utilisée comme limite de surface
Returns: Surface créée par correction
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Obtient une représentation NURBS de la surface en fonction d'une tolérance spécifiée. Cette méthode peut générer une surface approximative dans certaines circonstances.
tolerance: Tolérance spécifiée
Returns: Représentation de surface NURBS de la surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Epaissir la surface dans un solide, en réalisant une extrusion dans la direction des normales de la surface sur les deux côtés de la surface.
thickness: Quantité à épaissir
Returns: Surfaces épaissies en tant que solide
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Epaissir la surface dans un solide, en réalisant une extrusion dans la direction des normales de la surface. Si le paramètre both_sides est True, la surface est épaissie sur les deux côtés.
thickness: Quantité à épaissir
both_sides: True pour épaissir des deux côtés, false pour épaissir un seul côté
Returns: Surfaces épaissies en tant que solide
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
Le système de coordination renvoyé utilise xAxis, yAxis et zAxis pour représenter uDir, vDir et la normale. La longueur de xAxis et yAxis représente les courbures.
u: Composant U du paramètre
v: Composant V du paramètre
Returns: Système de coordonnées basé sur la normale, la direction U et la direction V à la position UV sur la surface

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Renvoie une nouvelle surface avec la normale inversée. Laisse cette surface inchangée.
Returns: Surface, qui est identique à la surface d'entrée, mais dont les normales sont inversées