Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Créer une BSplineCurve à l'aide de points de contrôle explicites. Remarque 1: les BSplineCurves avec un degré = 1 possèdent des discontinuités G1, qui entraînent des problèmes au niveau de l'extrusion, du balayage et d'autres opérations. Elles doivent être évitées. Utilisez une polycourbe. Remarque 2: si la courbe est périodique (fermée), le premier point et le dernier point DOIVENT être les mêmes.
points: Points pour la courbe NURBS
Returns: Courbe NURBS créée à partir de points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Créer une BSplineCurve à l'aide de points de contrôle explicites. Remarque 1: les BSplineCurves avec un degré = 1 possèdent des discontinuités G1, qui entraînent des problèmes au niveau de l'extrusion, du balayage et d'autres opérations. Elles doivent être évitées. Utilisez une polycourbe. Remarque 2: si la courbe est périodique (fermée), le premier point et le dernier point DOIVENT être les mêmes.
points: Points pour la courbe NURBS
degree: Degré de la courbe
Returns: Courbe NURBS créée à partir de points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Créer une BSplineCurve à l'aide de points de contrôle explicites. Remarque 1: les BSplineCurves avec un degré = 1 possèdent des discontinuités G1, qui entraînent des problèmes au niveau de l'extrusion, du balayage et d'autres opérations. Elles doivent être évitées. Utilisez une polycourbe. Remarque 2: si la courbe est périodique (fermée), le premier point et le dernier point DOIVENT être les mêmes.
points: Points pour la courbe NURBS
degree: Degré de la courbe
closeCurve: Activer/Désactiver pour fermer la courbe
Returns: Courbe NURBS créée à partir de points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Créer une BSplineCurve par interpolation entre des points. Remarque 2: si la courbe est périodique (fermée), le premier et le dernier point doivent être les mêmes.
points: Points pour la courbe NURBS
closeCurve: Activer/Désactiver pour fermer la courbe
Returns: Courbe NURBS créée à partir de points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
Noeuds de la courbe. Les noeuds sont une série de valeurs de paramètres (doubles) servant à déterminer où et comment les points de contrôle affectent la courbe.
Returns: Les nœuds de la courbe NURBS