Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Créez un plan "orienté ", positionné au niveau du point d'origine avec la normale du vecteur, mais avec une orientation de l'axe X spécifique. Cela n'a aucune incidence sur les opérations liées à la scission, à l'intersection, au projet, etc. Cela indique uniquement l'orientation du système de coordonnées d'entrée.
origin: Point d'origine du plan
normal: Vecteur de direction normale
xAxis: Vecteur de direction de l'axe X
Returns: Plan par normale d'origine et axe X

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Les axes X et Y se trouvent dans le plan. L'axe Z est le produit vectoriel de deux vecteurs.
origin: Point d'origine du plan
xAxis: Vecteur de direction de l'axe X du plan
yAxis: Vecteur de direction de l'axe Y du plan
Returns: Plan créé par l'axe X et l'axe Y de l'origine

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Créer le plan contenant la ligne d'entrée et le point externe. Le point ne peut pas se trouver sur la ligne ou dans l'axe de la ligne.
line: Ligne utilisée pour déterminer le plan
point: Point utilisé pour déterminer le plan
Returns: Plan créé à partir d'une ligne et d'un point
lines
0.4