Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Créer une ellipse centrée au niveau du point d'entrée, alignée avec le plan XY du SCG, avec les rayons des axes X et Y spécifiés.
origin: Point d'origine de l'ellipse
xAxisRadius: Rayon de l'axe X
yAxisRadius: Rayon de l'axe Y
Returns: Ellipse créée par une origine et des rayons
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Créer une ellipse centrée au niveau du point d'entrée, avec deux axes spécifiés. Les axes doivent être positionnés à 90 degrés l'un par rapport à l'autre.
origin: Point d'origine de l'ellipse
xAxisRadius: Rayon de l'axe X
yAxisRadius: Rayon de l'axe Y
Returns: Ellipse créée à partir de vecteurs d'origine
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Créer une ellipse centrée et alignée avec le CoordinateSystem d'entrée, avec un rayon x_radius dans la direction X du système de coordonnées, et un rayon y_radius dans la direction Y du système de coordonnées.
origin: Système de coordonnées d'origine de l'ellipse
xAxisRadius: Rayon de l'axe X
yAxisRadius: Rayon de l'axe Y
Returns: Ellipse créée par un système de coordonnées et des rayons
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Créer une ellipse centrée et alignée avec le plan d'entrée, avec un rayon x_radius dans la direction de l'axe X du plan, et un rayon y_radius dans la direction de l'axe Y du plan.
plane: Plan sur lequel l'arc de l'ellipse est dessiné
xAxisRadius: Rayon de l'axe X
yAxisRadius: Rayon de l'axe Y
Returns: Ellipse créée à partir d'un plan et de rayons
ellipse,aligned ellipse,ellipsebylengths