Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Créez une ou plusieurs polycourbes en regroupant les courbes connectées. Choisissez une tolérance de jonction préférée entre 1e-6 et 1e-3.
curves: Courbes à regrouper pour créer une ou plusieurs polycourbes
joinTolerance: Tolérance pour déterminer la taille de l'écart autorisé entre les courbes à joindre

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Raccorder la polycourbe dans son plan.
radius: Rayon du congé
rightSide: True pour définir un congé sur le côté droit par rapport au début de la polycourbe, False pour définir un congé sur le côté gauche
Returns: Polycourbe raccordée
round,smooth,radius