Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Crée un Circle à l'aide d'un point central d'entrée et un rayon dans le plan XY univers, avec l'univers Z standard.
centerPoint: Point central du cercle
radius: Rayon
Returns: Cercle créé avec un point central et un rayon
circle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
Créer un Circle centré au niveau de l'origine du plan d'entrée (racine), dans le plan d'entrée, avec un rayon donné.
plane: Racine du plan utilisée pour centrer le cercle
radius: Rayon
Returns: Cercle créé avec un plan et un rayon
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Créer un Circle passant par trois points d'entrée.
p1: 1er point du cercle
p2: 2e point du cercle
p3: 3e point du cercle
circle