Autodesk.DesignScript.Geometry.Solid.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Créer un solide de révolution, en balayant la courbe de profil autour du rayon d'axe formé par l'origine et le vecteur de l'axe, à partir de l'angle de départ en degrés vers l'angle de balayage en degrés.
profile: Courbe de contour à faire pivoter
axisOrigin: Origine de l'axe de révolution
axisDirection: Direction de l'axe de révolution
startAngle: Angle de départ en degrés
sweepAngle: Angle de balayage en degrés
Returns: Solide créé par révolution
Brep,brep,lathe,revolveprofile